{
  "collegeName": "University of California, Los Angeles",
  "programType": "Major",
  "programName": "Environmental Science (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Environmental Science major is designed to provide students with a comprehensive understanding of the natural world and the impact of human activities on the environment. The program focuses on the scientific principles underlying environmental issues and prepares students for careers in research, conservation, policy, and education.",
  "shortProgramDescription": "The Environmental Science B.S. program at UCLA equips students with a broad understanding of environmental systems, scientific research methods, and solutions to environmental challenges.",
  "classHighlights": [
    "Environmental Science Foundations: Students begin with introductory courses in environmental science, ecology, and conservation biology, establishing a broad understanding of environmental systems and the impact of human activities.",
    "Scientific Principles and Methods: Coursework includes chemistry (CHEM 14A/14B or CHEM 20A/20B), physics (PHYSICS 6A/6B or PHYSICS 1A/1B), and biology (LIFESCI 7A/7B/7C), providing a foundation in the natural sciences. Statistics and data analysis are also emphasized through courses like STATS 10 or STATS 13.",
    "Ecological and Earth Systems: Students study ecological principles, earth systems, and the interactions between human and natural systems through courses such as GEOG 1 or GEOG 2, and ENVIRONMENTAL SCI 15.",
    "Environmental Policy and Management: The program includes coursework on environmental policy, management, and conservation, preparing students for careers in these areas.",
    "Electives and Specializations: Students can choose from a range of electives to explore specific interests, such as climate change, sustainability, or environmental justice, allowing for a tailored educational experience."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of environmental science and ecology.",
    "Apply scientific methods and data analysis to environmental problems.",
    "Analyze the impact of human activities on the environment.",
    "Develop solutions to environmental challenges through a combination of scientific knowledge and policy understanding.",
    "Communicate effectively about environmental issues and solutions."
  ],
  "similarPrograms": [
    {
      "title": "Environmental Studies",
      "link": "https://newstudents.ucla.edu/studyarea/?type=MAJ&code=0350"
    },
    {
      "title": "Ecology, Behavior, and Evolution",
      "link": "https://newstudents.ucla.edu/studyarea/?type=MAJ&code=0360"
    },
    {
      "title": "Atmospheric and Oceanic Sciences",
      "link": "https://newstudents.ucla.edu/studyarea/?type=MAJ&code=0300"
    }
  ],
  "sources": [
    "https://newstudents.ucla.edu/studyarea/?type=MAJ&code=0351",
    "https://environmentalscience.ucla.edu/undergraduate-program"
  ],
  "programDuration": "4 years (quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "The Environmental Science major is designed for students who wish to pursue a broad, interdisciplinary education in environmental science. The program is structured to provide a strong foundation in the natural sciences, as well as coursework in environmental policy and management."
}