{
  "collegeName": "Stanford University",
  "programType": "Minor",
  "programName": "Aeronautics and Astronautics Minor",
  "degreeAwarded": "Minor",
  "fullProgramDescription": "The Aeronautics and Astronautics Minor provides an interdisciplinary introduction to the fields of aeronautics and astronautics. The program is designed for students who wish to gain a foundational understanding of aerospace engineering principles, including the design, analysis, and operation of aircraft and spacecraft. Students learn about aerodynamics, propulsion systems, structural mechanics, and other key aspects of aerospace engineering. The minor complements a range of majors, including engineering, physics, and mathematics.",
  "shortProgramDescription": "The Aeronautics and Astronautics Minor provides a foundational understanding of aerospace engineering principles, preparing students for careers or further study in aeronautics and astronautics.",
  "classHighlights": [
    "Fundamental courses: Students take core courses such as Introduction to Aerospace Engineering (AA101), Introduction to Flight (AA212), and Aerospace Structures (AA271), which provide a broad introduction to the field.",
    "Aerospace Systems: Courses like Aircraft Performance (AA214) and Spacecraft Design (AA236) cover the design, analysis, and operation of aircraft and spacecraft, including aerodynamics, propulsion, and orbital mechanics.",
    "Technical Electives: Students choose from a range of technical electives, including courses on aerodynamics, propulsion, structural mechanics, and aerospace systems, allowing them to tailor their studies to their interests."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of aeronautics and astronautics, including aerodynamics, propulsion, and structural mechanics.",
    "Analyze and design aerospace systems, including aircraft and spacecraft.",
    "Apply mathematical and scientific principles to solve problems in aerospace engineering.",
    "Communicate technical concepts and results effectively."
  ],
  "similarPrograms": [
    {
      "title": "Aeronautics and Astronautics (M.S., Ph.D.)",
      "link": "https://aa.stanford.edu/graduate-programs"
    },
    {
      "title": "Mechanical Engineering Minor",
      "link": "https://me.stanford.edu/undergrad/minor"
    },
    {
      "title": "Engineering Minor",
      "link": "https://engineering.stanford.edu/students/engineering-minor"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/AA-MIN",
    "https://aa.stanford.edu/undergraduate-program/minor"
  ],
  "programDuration": "Variable, typically 2-4 years (quarter system)",
  "creditRequirements": "At least 20 units, as specified by the department",
  "additionalInformation": "The Aeronautics and Astronautics Minor is open to students from a variety of majors. Interested students should consult with the department for specific requirements and advising."
}