{
  "collegeName": "Stanford University",
  "programType": "Minor",
  "programName": "Africana/Afro-American Studies Minor",
  "degreeAwarded": "Minor",
  "fullProgramDescription": "The minor in Africana/Afro-American Studies offers students the opportunity to develop a sophisticated understanding of the experiences, cultures, and histories of people of African descent throughout the world. Students take courses that examine the complex and diverse experiences of black peoples across time, space, and cultural contexts. The program is designed to be interdisciplinary, drawing on a range of departments and fields, including history, literature, sociology, anthropology, and more.",
  "shortProgramDescription": "The Africana/Afro-American Studies minor provides an interdisciplinary exploration of the histories, cultures, and experiences of people of African descent globally.",
  "classHighlights": [
    "The minor requires a minimum of 25 units. Students must take AFRAM 45: Introduction to Afro-American Studies and one of the gateway courses: AFRAM 145: Afro-American Family or AFRAM 147: African Diaspora.",
    "Students then choose at least three elective courses, which must be taken from at least two different departments and may include courses such as History of African Americans, Topics in Feminist Theory: Black Feminist Theory, African Diaspora: Black Expressions in the U.S. and Caribbean, and others.",
    "Courses in the minor may also include topics such as Africa and Africans in the World, Race and Identity in the Americas, Black Social Movements, and various special topics courses related to the African diasporic experience.",
    "Students are encouraged to explore the diverse range of courses offered across departments, allowing them to tailor their study to their interests and academic goals."
  ],
  "learningOutcomes": [
    "Develop a nuanced understanding of the histories, cultures, and experiences of people of African descent globally.",
    "Analyze the complex and diverse experiences of black peoples across different times, spaces, and cultural contexts.",
    "Apply interdisciplinary perspectives to the study of the African diasporic experience, drawing on fields such as history, literature, sociology, and anthropology.",
    "Critically evaluate the representations and experiences of black peoples in various contexts, including the United States, Africa, and the broader diaspora."
  ],
  "similarPrograms": [
    {
      "title": "Comparative Studies in Race and Ethnicity",
      "link": "https://csre.stanford.edu"
    },
    {
      "title": "Native American Studies",
      "link": "https://nativeamericanstudies.stanford.edu"
    },
    {
      "title": "Chicana/o Latina/o Studies",
      "link": "https://bulletin.stanford.edu/programs/CLAM-MIN"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/AFRAM-MIN",
    "https://afram.stanford.edu"
  ],
  "programDuration": "Variable, typically 2-4 years (quarter system)",
  "creditRequirements": "25 units minimum",
  "additionalInformation": "The minor is open to students from all disciplines. Students should consult with the director of undergraduate studies in Africana/Afro-American Studies for guidance on course selection and program requirements."
}