{
  "collegeName": "Stanford University",
  "programType": "Minor",
  "programName": "American Studies Minor",
  "degreeAwarded": "Minor",
  "fullProgramDescription": "The American Studies Minor is an interdisciplinary program that explores the diverse cultural, historical, and social contexts of the United States. Students engage with a range of topics, from the colonial era to the present, through courses in departments such as English, History, African and African American Studies, and Comparative Studies in Race and Ethnicity. The minor is designed for students who wish to complement their major field with a nuanced understanding of American cultures, identities, and power structures. Students are required to complete 25 units of course work, with at least 18 units at the 100-level or above, and not more than 10 units from a single department.",
  "shortProgramDescription": "The American Studies Minor provides an interdisciplinary exploration of U.S. cultures, histories, and identities, preparing students for nuanced understanding of American contexts.",
  "classHighlights": [
    "Courses in American Studies span multiple departments, including English, History, and Comparative Studies in Race and Ethnicity, offering a diverse array of topics and methodologies.",
    "The program emphasizes thematic and historical explorations, including the study of American literature, cultural history, and social movements.",
    "Students examine the complexities of American identity, culture, and society through upper-division courses that focus on specific historical periods, cultural themes, or critical issues."
  ],
  "learningOutcomes": [
    "Understand the complexities of American cultures, histories, and identities through an interdisciplinary lens.",
    "Analyze the intersections of power, culture, and identity in American contexts.",
    "Apply critical perspectives to the study of American cultures and societies."
  ],
  "similarPrograms": [
    {
      "title": "Native American Studies",
      "link": "https://nativeamericanstudies.stanford.edu"
    },
    {
      "title": "Comparative Studies in Race and Ethnicity",
      "link": "https://csre.stanford.edu"
    },
    {
      "title": "English",
      "link": "https://english.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/AMSTU-MIN",
    "https://amstud.stanford.edu"
  ],
  "programDuration": "Variable, typically 2-4 years (quarter system)",
  "creditRequirements": "25 units, with at least 18 units at the 100-level or above, and not more than 10 units from a single department (quarter system)",
  "additionalInformation": "Students must declare the minor and plan their course of study in consultation with the American Studies faculty director or adviser."
}