{
  "collegeName": "Stanford University",
  "programType": "Minor",
  "programName": "Anthropology Minor",
  "degreeAwarded": "Minor",
  "fullProgramDescription": "The Anthropology minor program allows students to explore the anthropological study of human diversity and complexity, both past and present. Students take a range of courses that cover various subfields within anthropology, including sociocultural anthropology, archaeology, biological anthropology, and linguistic anthropology. The minor is designed to complement a major in another field and provide a deeper understanding of human cultures, behaviors, and biological characteristics.",
  "shortProgramDescription": "The Anthropology minor provides a foundational understanding of human diversity through coursework in sociocultural anthropology, archaeology, biological anthropology, and linguistic anthropology.",
  "classHighlights": [
    "Sociocultural Anthropology: Courses in this subfield explore human cultural diversity, social structures, and practices. Examples include ANTHRO 3AC (Introduction to Anthropology: Comparison and Context), ANTHRO 106 (Contested Worlds), and other upper-division courses that delve into specific cultural contexts and anthropological theories.",
    "Archaeology: Archaeological courses examine human past through material remains, including ANTHRO 2AC (Introduction to Archaeology and Prehistory) and advanced courses like ANTHRO 116 (The Archaeology of Human Origins) and ANTHRO 121 (The Development of Archaeological Thought).",
    "Biological Anthropology: Courses in biological anthropology, such as ANTHRO 1A (Introduction to Biological Anthropology) and ANTHRO 112 (Human Osteology), focus on human evolution, genetics, and biological variation.",
    "Linguistic Anthropology: Linguistic anthropology courses, including ANTHRO 104 (Language and Culture), investigate the relationship between language, culture, and society."
  ],
  "learningOutcomes": [
    "Understand the major subfields of anthropology and their theoretical frameworks.",
    "Analyze human cultural diversity and complexity through an anthropological lens.",
    "Apply anthropological concepts and methods to understand human behavior and cultural practices.",
    "Critically evaluate the role of anthropology in understanding human societies and cultures."
  ],
  "similarPrograms": [
    {
      "title": "Sociology Minor",
      "link": "https://sociology.stanford.edu/undergraduate-program/minor"
    },
    {
      "title": "History Minor",
      "link": "https://history.stanford.edu/undergraduate-program/minor"
    },
    {
      "title": "Comparative Studies in Race and Ethnicity Minor",
      "link": "https://csre.stanford.edu/undergrad/minor"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/ANTHR-MIN",
    "https://anthropology.stanford.edu/undergraduate-program/minor"
  ],
  "programDuration": "Variable, typically 2-4 years (quarter system)",
  "creditRequirements": "At least 20 units of ANTHRO courses, with a minimum of 3 courses at the 100-level or above",
  "additionalInformation": "The Anthropology minor is open to students from all disciplines. Course selection should be made in consultation with the Anthropology department's undergraduate advisor."
}