{
  "collegeName": "Stanford University",
  "programType": "Minor",
  "programName": "Archaeology Minor",
  "degreeAwarded": "Minor",
  "fullProgramDescription": "The minor in Archaeology is designed for students who wish to pursue a structured course of study in archaeology. The program allows students to build on foundational courses in archaeology, anthropology, and related fields, while exploring specialized topics through electives. Students develop an understanding of archaeological methods, theoretical approaches, and the cultural and historical contexts of archaeological findings. The minor is administered by the Department of Anthropology.",
  "shortProgramDescription": "The Archaeology Minor at Stanford provides a structured program of study in archaeological methods, theory, and cultural contexts.",
  "classHighlights": [
    "Foundational courses introduce students to the principles and methods of archaeology, including archaeological science, theory, and the cultural contexts of material remains.",
    "Electives allow students to explore specialized topics such as archaeological methods and theory, the archaeology of specific regions or cultures, and the application of scientific techniques to archaeological research.",
    "Courses in related departments, such as Anthropology, Classics, and Art History, provide additional depth and context for understanding archaeological findings and their significance."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles and methods of archaeology",
    "Analyze and interpret archaeological data and material culture",
    "Apply theoretical frameworks to understanding archaeological contexts",
    "Recognize the cultural and historical significance of archaeological findings",
    "Integrate knowledge from related disciplines to deepen understanding of archaeological topics"
  ],
  "similarPrograms": [
    {
      "title": "Anthropology Major",
      "link": "https://bulletin.stanford.edu/programs/ANTHRO-BA"
    },
    {
      "title": "Classics Major",
      "link": "https://bulletin.stanford.edu/programs/CLASSICS-BA"
    },
    {
      "title": "Art History Major",
      "link": "https://bulletin.stanford.edu/programs/ARTHIST-BA"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/ARCHA-MIN",
    "https://anthropology.stanford.edu"
  ],
  "programDuration": "Variable, typically 4-6 quarters (quarter system)",
  "creditRequirements": "25 units minimum (quarter system)",
  "additionalInformation": "The Archaeology Minor is administered by the Department of Anthropology. Students should consult with the minor advisor to plan their course of study."
}