{
  "collegeName": "Stanford University",
  "programType": "Minor",
  "programName": "Art History Minor",
  "degreeAwarded": "Minor",
  "fullProgramDescription": "The Art History minor program provides a comprehensive understanding of the history of art from a variety of cultures and historical periods. Students are introduced to the methods and theories that underlie the discipline, and they develop skills in analyzing and interpreting works of art. Coursework covers a range of topics, from ancient to contemporary art, and includes classes on diverse artistic traditions.",
  "shortProgramDescription": "The Art History minor offers students a broad understanding of the history of art, covering various cultures and periods, and develops their analytical and interpretive skills.",
  "classHighlights": [
    "The introductory course, Introduction to Art History (ARTHIST 1 or 1P), provides a foundational understanding of the history of art and introduces students to the methods and theories of the discipline.",
    "Students are required to complete at least 5 additional courses in Art History, which may include classes on specific historical periods, such as Renaissance, Modern, or Contemporary art, as well as courses on diverse artistic traditions, like Asian or African art.",
    "Upper-level courses allow students to explore specialized topics, such as art theory, curatorial practice, and the history of specific art forms, like architecture or sculpture."
  ],
  "learningOutcomes": [
    "Analyze and interpret works of art within their historical and cultural contexts.",
    "Understand the methods and theories that underlie the discipline of Art History.",
    "Develop skills in visual analysis and critical thinking.",
    "Recognize the diversity of artistic traditions and their contributions to the history of art."
  ],
  "similarPrograms": [
    {
      "title": "Art and Archaeology",
      "link": "https://archaeology.stanford.edu/programs/undergraduate/art-and-archaeology-major"
    },
    {
      "title": "Modern Thought and Literature",
      "link": "https://mtl.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/ART-MIN",
    "https://arthistory.stanford.edu/undergraduate-program"
  ],
  "programDuration": "Variable (quarter system)",
  "creditRequirements": "At least 30 units of Art History coursework",
  "additionalInformation": "The minor is open to students from all disciplines. Coursework must be taken for a letter grade, and students are required to file a minor program form with the Department of Art History."
}