{
  "collegeName": "Stanford University",
  "programType": "Minor",
  "programName": "Asian American Studies Minor",
  "degreeAwarded": "Minor",
  "fullProgramDescription": "The minor in Asian American Studies offers students the opportunity to engage in interdisciplinary study of the history, experiences, and contributions of Asian Americans. The program includes foundational courses and electives that explore the diversity of Asian American communities. Students are encouraged to examine the intersections of race, gender, class, and sexuality within the context of Asian American Studies. The program is designed to complement a wide range of majors and to provide students with a deeper understanding of the complex issues facing Asian American communities.",
  "shortProgramDescription": "The Asian American Studies minor provides an interdisciplinary exploration of Asian American history, culture, and experiences, preparing students for diverse careers and further study.",
  "classHighlights": [
    "The Asian American Studies minor includes foundational courses that introduce students to the field's key concepts, histories, and methodologies. Courses such as 'Introduction to Asian American Studies' provide a broad overview of the field.",
    "Electives in the program allow students to explore specific topics in Asian American Studies, such as the history of Asian Americans, their cultural productions, and their social and political experiences. Courses may be drawn from departments such as Ethnic Studies, History, English, and Comparative Studies.",
    "The program also includes courses that examine the intersections of Asian American Studies with other fields, such as gender studies, queer studies, and critical race theory, enabling students to contextualize their knowledge within broader academic discourses."
  ],
  "learningOutcomes": [
    "Analyze the historical and contemporary experiences of Asian Americans.",
    "Understand the diversity within Asian American communities.",
    "Examine the intersections of race, gender, class, and sexuality within the context of Asian American Studies.",
    "Apply interdisciplinary methodologies to the study of Asian American cultures and experiences.",
    "Evaluate the contributions and challenges of Asian American communities."
  ],
  "similarPrograms": [
    {
      "title": "Native American Studies",
      "link": "https://bulletin.stanford.edu/programs/NATIVAM-STU"
    },
    {
      "title": "Comparative Studies in Race & Ethnicity",
      "link": "https://bulletin.stanford.edu/programs/CSRE-MIN"
    },
    {
      "title": "Chicana/o-Latina/o Studies",
      "link": "https://bulletin.stanford.edu/programs/CLST-MIN"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/ASAM-MIN"
  ],
  "programDuration": "Variable, typically 4-8 quarters (quarter system)",
  "creditRequirements": "24 units (quarter system)",
  "additionalInformation": "The Asian American Studies minor is open to all Stanford students. Course offerings may vary by quarter and not all courses count towards the minor; consult the department for specific course approvals and advising."
}