{
  "collegeName": "Stanford University",
  "programType": "Minor",
  "programName": "Biology Minor",
  "degreeAwarded": "Minor",
  "fullProgramDescription": "The Biology Minor is designed for students who wish to supplement their major with a substantial exposure to biology. The program allows students to explore the fundamental principles of biology and its related disciplines.",
  "shortProgramDescription": "The Biology Minor at Stanford provides a comprehensive understanding of biological principles for students majoring in other fields.",
  "classHighlights": [
    "The Biology Minor requires a foundational course in Biological Diversity, Ecology, and Evolution (BIO 43/83), and a minimum of 25 units of additional Biology courses, including some upper-level classes that explore specific areas such as Genetics (BIO 44/84), Biochemistry (BIO 41/81), or Developmental Biology.",
    "Students must also complete a minimum of two laboratory courses (at least one with an associated lecture) to gain practical experience in biological research methods and techniques.",
    "Electives can be chosen from a wide range of upper-level Biology courses to allow students to tailor their minor to their interests, including courses on molecular biology, ecology, and evolutionary biology."
  ],
  "learningOutcomes": [
    "Understand the major principles of biology, including the structure and function of cells, genetics, evolution, and ecology.",
    "Analyze and interpret biological data, including experimental results and observational studies.",
    "Apply biological knowledge to real-world problems and issues.",
    "Develop critical thinking and problem-solving skills in the context of biological systems."
  ],
  "similarPrograms": [
    {
      "title": "Biology (B.S.)",
      "link": "https://bulletin.stanford.edu/programs/BIOL-BS"
    },
    {
      "title": "Bioengineering (B.S.)",
      "link": "https://bulletin.stanford.edu/programs/BIOE-BS"
    },
    {
      "title": "Environmental Earth Systems Science (B.S.)",
      "link": "https://bulletin.stanford.edu/programs/EESS-BS"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/BIO-MIN",
    "https://biology.stanford.edu/undergraduate-program/degree-requirements"
  ],
  "programDuration": "Variable, typically 4-6 quarters",
  "creditRequirements": "At least 25 units of Biology courses",
  "additionalInformation": "The Biology Minor is open to students from all disciplines. Course choices should be made in consultation with a Biology department advisor to ensure they align with the student's academic goals and interests."
}