{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Chemical Engineering (BS)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The undergraduate program in Chemical Engineering provides a foundation in the principles of chemical engineering, including transport processes, thermodynamics, and reaction kinetics. Students learn to apply mathematical and scientific principles to analyze and design chemical processes and systems. The program includes coursework in mathematics, physics, chemistry, and biology, as well as core chemical engineering courses and electives.",
  "shortProgramDescription": "Stanford's Chemical Engineering BS program provides a strong foundation in the principles of chemical engineering, preparing students for careers or further study.",
  "classHighlights": [
    "Mathematics and Science: Students complete a series of mathematics courses (MATH19, MATH20, MATH21) and science courses (PHYSICS41, PHYSICS43, CHEM31X, CHEM32X, BIOSC43 or BIOSC73).",
    "Chemical Engineering Fundamentals: Core courses include Introduction to Chemical Engineering (CHEME12), Chemical Engineering Thermodynamics (CHEME102A), Transport Processes (CHEME102B), and Chemical Engineering Laboratory (CHEME130).",
    "Chemical Engineering Core: Students take additional core courses such as Chemical Reaction Engineering (CHEME142), Process Control and Dynamics (CHEME162), and Unit Operations (CHEME154 or CHEME155).",
    "Electives and Specializations: Students choose from a range of electives, including courses in biotechnology, energy, and environmental engineering, to develop a depth of knowledge in their area of interest.",
    "Laboratory and Research Experience: Students gain hands-on experience in chemical engineering laboratory courses and may participate in research projects or internships.",
    "Engineering and Design: Courses emphasize the application of chemical engineering principles to design and optimize processes and systems."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of chemical engineering to analyze and design processes and systems.",
    "Use mathematical and scientific principles to solve chemical engineering problems.",
    "Demonstrate understanding of thermodynamics, transport phenomena, and reaction kinetics.",
    "Design and conduct experiments, and analyze data.",
    "Communicate effectively in written and oral forms.",
    "Work effectively in teams and demonstrate leadership skills.",
    "Consider ethical, societal, and environmental implications of chemical engineering practice."
  ],
  "similarPrograms": [
    {
      "title": "Energy Resources Engineering",
      "link": "https://bulletin.stanford.edu/programs/ERES-BS"
    },
    {
      "title": "Environmental Engineering",
      "link": "https://bulletin.stanford.edu/programs/ENVENG-BS"
    },
    {
      "title": "Materials Science and Engineering",
      "link": "https://bulletin.stanford.edu/programs/MATSCI-BS"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/CHEME-BS",
    "https://engineering.stanford.edu/departments/chemical-engineering",
    "https://ughb.stanford.edu/majors-minors/chemical-engineering-program"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "Students must declare the major through the School of Engineering. The program requires a minimum GPA in core courses, and students must complete a series of required courses in mathematics, science, and chemical engineering."
}