{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Chicana/o - Latina/o Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Chicana/o - Latina/o Studies offers an undergraduate major that provides students with a deep understanding of the histories, cultures, and experiences of Chicanas/os and Latinas/os in the United States. The program is interdisciplinary, drawing on fields such as history, sociology, literature, and cultural studies. Students explore the complex social, economic, and political contexts that have shaped the lives of Chicanas/os and Latinas/os, and they develop critical thinking, research, and analytical skills.",
  "shortProgramDescription": "The Chicana/o - Latina/o Studies major at Stanford University offers students a comprehensive understanding of the histories, cultures, and experiences of Chicanas/os and Latinas/os in the United States.",
  "classHighlights": [
    "The program includes core courses that introduce students to the field of Chicana/o - Latina/o Studies, covering topics such as the history of Chicanas/os and Latinas/os, their cultural productions, and the social and economic contexts that have shaped their lives.",
    "Students take additional courses that explore specific themes, such as identity, culture, and politics, and they have the opportunity to engage with faculty and peers in small, discussion-based classes.",
    "The major also includes a range of electives that allow students to pursue their interests in areas such as history, literature, sociology, and cultural studies.",
    "Courses in the major are taught from a variety of disciplinary perspectives, including history, sociology, literature, and cultural studies, and they often incorporate critical theory and methodologies from these fields.",
    "Students are encouraged to think critically about the complex social, economic, and political contexts that have shaped the lives of Chicanas/os and Latinas/os, and to develop their own research and analytical skills through coursework and independent projects."
  ],
  "learningOutcomes": [
    "Demonstrate a deep understanding of the histories, cultures, and experiences of Chicanas/os and Latinas/os in the United States.",
    "Analyze the complex social, economic, and political contexts that have shaped the lives of Chicanas/os and Latinas/os.",
    "Apply critical thinking, research, and analytical skills to the study of Chicana/o - Latina/o Studies.",
    "Communicate effectively about the histories, cultures, and experiences of Chicanas/os and Latinas/os in written and oral forms.",
    "Evaluate the significance of Chicana/o - Latina/o Studies in relation to broader social, economic, and political contexts."
  ],
  "similarPrograms": [
    {
      "title": "Comparative Studies in Race and Ethnicity",
      "link": "https://csre.stanford.edu"
    },
    {
      "title": "Native American Studies",
      "link": "https://nativeamericanstudies.stanford.edu"
    },
    {
      "title": "Latin American Studies",
      "link": "https://latinamericanstudies.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/CHILT-BA",
    "https://chilat.stanford.edu"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units",
  "additionalInformation": "Students declare the major through the Department of Chicana/o - Latina/o Studies. The major is designed to be completed in four years, with a total of 45 units required."
}