{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Data Science (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Data Science major is designed to provide students with a comprehensive understanding of the methods and systems for acquiring, processing, and analyzing data. The program emphasizes the development of skills in data analysis, machine learning, and data visualization, as well as an understanding of the social and ethical implications of data science. Students in the program take courses in data science, computer science, statistics, and mathematics, and have the opportunity to pursue a range of electives and specializations.",
  "shortProgramDescription": "The Data Science B.A. at Stanford University provides a broad education in data science, including data analysis, machine learning, and data visualization, as well as the social and ethical implications of data science.",
  "classHighlights": [
    "Foundational Courses: Students take introductory courses in data science (DATSCI 101), programming (CS 106A or equivalent), and statistics (STAT 60 or equivalent), which provide a foundation in data analysis and programming.",
    "Data Science Core: The data science core includes courses in data mining (DATSCI 203), machine learning (CS 229 or DATSCI 242), and data visualization (DATSCI 156 or CS 448), which provide a comprehensive understanding of data science methods and techniques.",
    "Mathematics and Statistics: Students take courses in mathematics (MATH 19-21 or equivalent) and statistics (STAT 116 or equivalent), which provide a foundation in mathematical and statistical concepts.",
    "Computing and Programming: Students take courses in computer science (CS 107 or equivalent) and programming, which provide a foundation in programming and software development.",
    "Electives and Specializations: Students have the opportunity to pursue a range of electives and specializations, including courses in data mining, machine learning, and data visualization, as well as specializations in areas such as artificial intelligence, human-computer interaction, and data ethics."
  ],
  "learningOutcomes": [
    "Understand the fundamental concepts and techniques of data science, including data analysis, machine learning, and data visualization.",
    "Apply data science methods and techniques to real-world problems and datasets.",
    "Understand the social and ethical implications of data science and be able to evaluate the potential impact of data science on society.",
    "Communicate complex data insights effectively to both technical and non-technical audiences.",
    "Work effectively in teams to design, develop, and deploy data science solutions."
  ],
  "similarPrograms": [
    {
      "title": "Computer Science (B.S.)",
      "link": "https://bulletin.stanford.edu/programs/CS-BS"
    },
    {
      "title": "Statistics (B.S.)",
      "link": "https://bulletin.stanford.edu/programs/STAT-BS"
    },
    {
      "title": "Mathematical and Computational Science (B.S.)",
      "link": "https://bulletin.stanford.edu/programs/MATH-BS"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/DATSC-BA",
    "https://datascience.stanford.edu/undergrad"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "Students declare the Data Science major through the Office of the University Registrar. The major is open to students from a variety of backgrounds and disciplines."
}