{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Energy Science and Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The undergraduate major in Energy Science and Engineering (ENERGY) is an interdisciplinary program that focuses on the scientific and engineering principles underlying energy production, conversion, transmission, and use. Students explore energy-related topics across multiple disciplines and acquire a foundation to develop effective solutions to contemporary energy challenges.",
  "shortProgramDescription": "The ENERGY major provides a broad understanding of energy science and engineering, enabling students to address complex energy challenges through an interdisciplinary approach.",
  "classHighlights": [
    "The program includes foundational courses in the natural sciences and mathematics, such as Introduction to Energy Science and Engineering (ENERGY 101), Energy and the Environment (ENERGY 102), Calculus (MATH 19-21, 51), and Physics (PHYSICS 41, 43).",
    "Engineering and applied science courses cover topics like energy conversion, thermodynamics, and energy systems, including Energy Systems (ENERGY 105), Thermodynamics (ME 300), and Energy and the Environment (ENERGY 203).",
    "Students also complete courses in their chosen track or focus area, such as energy systems, sustainable energy, or energy policy, which may include electives like Renewable Energy (ENERGY 152), Energy Economics (ENERGY 205), or Energy and Climate Change (ENERGY 204).",
    "Additional requirements include a minimum of three units of energy-related research or project-based coursework, such as the Energy Senior Project (ENERGY 194), and a writing-intensive course, like Energy and the Environment (ENERGY 102W)."
  ],
  "learningOutcomes": [
    "Demonstrate a comprehensive understanding of energy science and engineering principles, including energy production, conversion, and use.",
    "Apply knowledge from multiple disciplines to analyze and develop solutions to complex energy challenges.",
    "Evaluate the environmental, social, and economic impacts of energy systems and technologies.",
    "Communicate technical information effectively to diverse audiences, both orally and in writing.",
    "Design and conduct experiments or analyses to investigate energy-related problems, and interpret the results.",
    "Work effectively in teams to address energy challenges and develop innovative solutions.",
    "Stay current with emerging trends and advancements in energy science and engineering."
  ],
  "similarPrograms": [
    {
      "title": "Earth Systems",
      "link": "https://earthsystems.stanford.edu"
    },
    {
      "title": "Environmental Engineering",
      "link": "https://cee.stanford.edu"
    },
    {
      "title": "Mechanical Engineering",
      "link": "https://me.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/ENERGY-BS",
    "https://schoolofearth.stanford.edu/undergraduate/energy-science-engineering-major",
    "https://energy.stanford.edu/undergraduate-program"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "The major is offered through the School of Earth, Energy & Environmental Sciences. Students must declare the major through the School of Earth, Energy & Environmental Sciences, and advising is available through the department."
}