{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "French (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The French major is designed to develop the student's language proficiency and cultural awareness. Students take courses that cover French literature, culture, history, and language. The major is designed to be flexible, allowing students to pursue their interests and career goals.",
  "shortProgramDescription": "The French major at Stanford develops language skills and cultural understanding through coursework in literature, culture, and language.",
  "classHighlights": [
    "Language Courses: Students take language courses that cover grammar, vocabulary, and conversation. These courses are designed to develop students' language proficiency and include topics such as French phonetics, grammar, and composition.",
    "Literature and Culture Courses: Students take courses that cover French literature and culture, including works by major authors and historical periods. These courses explore the cultural and historical context of French literature and its relevance to contemporary issues.",
    "Advanced Language and Culture Courses: Advanced courses focus on specific topics such as 20th-century French literature, Francophone cultures, and historical studies. These courses develop students' critical thinking and analytical skills.",
    "Electives and Tracks: Students can choose from a range of electives that allow them to pursue their interests, including courses in film studies, cultural studies, and linguistic analysis."
  ],
  "learningOutcomes": [
    "Develop advanced language proficiency in reading, writing, and speaking French.",
    "Understand and analyze French literature and culture in their historical and cultural contexts.",
    "Cultivate critical thinking and analytical skills through the study of French texts and cultural artifacts.",
    "Demonstrate an appreciation for the diversity of Francophone cultures and communities."
  ],
  "similarPrograms": [
    {
      "title": "Italian",
      "link": "https://bulletin.stanford.edu/programs/ITALN-BA"
    },
    {
      "title": "Spanish",
      "link": "https://bulletin.stanford.edu/programs/SPANR-BA"
    },
    {
      "title": "Comparative Literature",
      "link": "https://bulletin.stanford.edu/programs/COMPLIT-BA"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/FRENC-BA",
    "https://french-italian.stanford.edu/undergraduate-studies/major-french"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units minimum for the major; total approx. 180 quarter units for the degree",
  "additionalInformation": "Students declaring the major should consult with the department's undergraduate adviser. Coursework taken abroad may be counted toward the major with prior approval."
}