{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "History (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of History offers an undergraduate major in History leading to a Bachelor of Arts degree. The History major is designed to give students a broad understanding of the world's past and to develop critical skills in reading, writing, and research. Students work closely with advisors to select a program of study that fits their interests and goals, choosing from a wide range of courses that cover different periods, regions, and themes.",
  "shortProgramDescription": "Stanford's History B.A. program provides a broad education in historical contexts, research methods, and critical analysis, preparing students for diverse careers or advanced study.",
  "classHighlights": [
    "Introductory Courses: Students begin with introductory courses such as History 1-2 (Introduction to Historical Study) or History 4A-B (History of Western Civilization), which provide foundational knowledge and skills.",
    "Regional and Thematic Courses: The major includes a broad range of regional and thematic courses, such as History 121 (The United States in the 20th Century), History 145 (Modern China), and History 171 (Europe in the 20th Century), allowing students to explore different historical contexts.",
    "Advanced Research and Writing: Students complete advanced research and writing courses, such as History 201A-B (Research Seminar), where they develop and hone their research and writing skills.",
    "Electives and Depth: Students choose from a variety of electives, including upper-division courses that provide depth in specific historical areas, such as cultural, social, or political history.",
    "Thematic and Comparative Studies: The department offers thematic and comparative studies courses, enabling students to explore historical themes across different regions and periods."
  ],
  "learningOutcomes": [
    "Analyze historical sources and contexts critically.",
    "Conduct independent research using primary and secondary sources.",
    "Develop clear and persuasive writing and argumentation skills.",
    "Understand diverse historical perspectives and contexts.",
    "Apply historical knowledge to contemporary issues and problems."
  ],
  "similarPrograms": [
    {
      "title": "Classics",
      "link": "https://bulletin.stanford.edu/programs/CLASSICS-BA"
    },
    {
      "title": "Comparative Literature",
      "link": "https://bulletin.stanford.edu/programs/COMPLIT-BA"
    },
    {
      "title": "History Minor",
      "link": "https://history.stanford.edu/undergraduate-program/minor"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/HSTRY-BA",
    "https://history.stanford.edu/undergraduate-program/major"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 history units (including required courses and electives); total approximately 180 quarter units",
  "additionalInformation": "Students are advised to declare the major by the end of their sophomore year and to work closely with departmental advisors to plan their course of study."
}