{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Human Biology (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Human Biology major is an undergraduate program that provides a broad and integrative view of human health, incorporating perspectives from biology, psychology, anthropology, and sociology. The major is designed for students who wish to understand the complex factors influencing human health and well-being. It covers a range of topics, from molecular and cellular biology to social and cultural contexts of health.",
  "shortProgramDescription": "The Human Biology B.A. at Stanford provides a comprehensive understanding of human health from multiple disciplinary perspectives.",
  "classHighlights": [
    "The major begins with foundational courses in biological sciences, including Human Biology: Health, Risk, and Resilience (HUMBIO 3N) and Principles of Human Biology (HUMBIO 4N), which introduce the scope and frameworks of the field.",
    "Students take core courses in biology, including Genetics, Development, and Physiology (BIO 43/44, HUMBIO 120), and statistical methodologies for analyzing health-related data.",
    "Courses in psychology, sociology, and anthropology provide a social sciences perspective on human health, covering topics like health disparities, cultural determinants of health, and the psychology of health behaviors.",
    "Upper-level electives allow students to delve into specialized topics such as global health, epidemiology, nutrition, and environmental influences on health.",
    "The major culminates in advanced seminars or capstone experiences that synthesize knowledge and apply it to real-world health issues."
  ],
  "learningOutcomes": [
    "Understand the biological, social, and cultural factors influencing human health.",
    "Apply principles from biology, psychology, sociology, and anthropology to analyze health-related issues.",
    "Analyze data related to human health, incorporating statistical methodologies and critical thinking.",
    "Evaluate the complex interplay of determinants of health, including genetics, environment, culture, and socioeconomic status.",
    "Communicate knowledge about human health effectively, both orally and in writing."
  ],
  "similarPrograms": [
    {
      "title": "Biology",
      "link": "https://biology.stanford.edu/undergraduate-program"
    },
    {
      "title": "Psychology",
      "link": "https://psychology.stanford.edu/undergraduate-program"
    },
    {
      "title": "Public Health and Health Policy",
      "link": "https://publichealth.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/HUMBI-BA",
    "https://humbio.stanford.edu"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units of HUMBIO courses; total approximately 180 quarter units",
  "additionalInformation": "The major is open to students from various backgrounds. Advising is available through the Human Biology department. Students are encouraged to explore research opportunities and internships related to human health."
}