{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Iberian and Latin American Cultures (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Iberian and Latin American Cultures (ILAC) offers an undergraduate major that explores the cultures of the Iberian Peninsula and Latin America from the Middle Ages to the present, focusing on the historical, social, and cultural contexts that have shaped these regions. Students engage with a diverse range of materials, including literature, film, and visual arts, and have the opportunity to develop proficiency in Spanish, Portuguese, or other relevant languages. The major is designed to foster critical thinking, cultural competence, and a nuanced understanding of the complex historical and contemporary dynamics at play in these regions.",
  "shortProgramDescription": "The ILAC major at Stanford University provides a comprehensive education in the cultures, histories, and societies of the Iberian Peninsula and Latin America.",
  "classHighlights": [
    "The major requires students to complete a series of core courses that introduce them to the foundational knowledge and methodologies of the field, including ILAC 111A, ILAC 111B, and ILAC 121.",
    "Students then choose from a range of upper-division courses that allow them to explore specific topics and themes in greater depth, such as ILAC 160, ILAC 170, and ILAC 180.",
    "Courses in the major are organized around several key areas, including historical and cultural contexts, literary and cultural analysis, and language proficiency.",
    "Students also have the opportunity to engage with related disciplines, such as history, anthropology, and comparative literature, and to pursue coursework in relevant languages, including Spanish and Portuguese.",
    "Electives and seminars provide students with the chance to explore specialized topics and to develop advanced research and critical thinking skills."
  ],
  "learningOutcomes": [
    "Demonstrate a nuanced understanding of the cultures, histories, and societies of the Iberian Peninsula and Latin America.",
    "Analyze and interpret a range of cultural materials, including literature, film, and visual arts.",
    "Develop proficiency in Spanish, Portuguese, or other relevant languages.",
    "Apply critical thinking and cultural competence to complex historical and contemporary dynamics.",
    "Engage with related disciplines, such as history, anthropology, and comparative literature."
  ],
  "similarPrograms": [
    {
      "title": "Spanish and Portuguese",
      "link": "https://span-port.stanford.edu"
    },
    {
      "title": "Comparative Literature",
      "link": "https://complit.stanford.edu"
    },
    {
      "title": "Latin American Studies",
      "link": "https://las.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/ILAC-BA",
    "https://ilac.stanford.edu/undergraduate/major"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units in the major; total approximately 180 quarter units",
  "additionalInformation": "Students declare the major through the Department of Iberian and Latin American Cultures. Coursework in relevant languages is strongly recommended."
}