{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "International Relations (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The undergraduate major in International Relations is an interdisciplinary program that provides students with a comprehensive understanding of global issues, international politics, and the complex interactions between states, international organizations, and non-state actors. The program draws on coursework from several departments, including Political Science, Economics, History, and Languages, to equip students with the analytical tools and knowledge necessary to navigate the complexities of global affairs.",
  "shortProgramDescription": "The International Relations major at Stanford University provides a broad-based education in global issues, combining coursework in politics, economics, history, and culture to prepare students for careers in international affairs.",
  "classHighlights": [
    "The introductory course, Introduction to International Relations (INTLR 23N), provides a foundational understanding of global politics and international relations theories.",
    "Students take core courses in International Relations Theory (INTLR 121), International Political Economy (INTLR 122), and International Security (INTLR 123), which provide a deep understanding of the theoretical frameworks, economic factors, and security dynamics that shape global interactions.",
    "Electives in regional studies, such as courses on Europe, Asia, Africa, and Latin America, allow students to explore specific geographic areas and their roles in global affairs.",
    "Courses in Economics, including International Economics (ECON 56) and Economic Development (ECON 156), provide students with an understanding of the economic dimensions of international relations.",
    "History courses, such as Modern International History (HIST 105) and Globalization and its Discontents (HIST 165), offer insights into the historical context of contemporary global issues.",
    "Language proficiency is also a key component, with students encouraged to develop skills in languages relevant to their area of interest.",
    "The major includes a range of electives that allow students to tailor their coursework to their interests and career goals, including courses on human rights, global governance, and environmental issues."
  ],
  "learningOutcomes": [
    "Understand the major theories and concepts in international relations.",
    "Analyze global issues from multiple disciplinary perspectives.",
    "Apply knowledge of international politics, economics, and history to real-world problems.",
    "Develop effective written and oral communication skills.",
    "Cultivate critical thinking and problem-solving abilities.",
    "Demonstrate an understanding of cultural and linguistic diversity in global contexts."
  ],
  "similarPrograms": [
    {
      "title": "Global Studies Minor",
      "link": "https://globals.stanford.edu"
    },
    {
      "title": "International Policy Studies",
      "link": "https://fsi.stanford.edu/programs/ips"
    },
    {
      "title": "Comparative Studies in Society and Culture",
      "link": "https://csso.ca"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/INTLR-BA",
    "https://internationalrelations.stanford.edu",
    "https://undergrad.stanford.edu/programs/international-relations"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units of INTLR courses, with additional requirements in related departments; total approx. 180 quarter units",
  "additionalInformation": "Students are encouraged to study abroad and to pursue internships or research opportunities to enhance their understanding of global issues and career prospects."
}