{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Public Policy (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Public Policy Program is an interdisciplinary major that introduces students to the methods and substance of public policy. It draws on insights and approaches from economics, political science, history, sociology, law, and philosophy to study policy issues and processes, providing students with a comprehensive understanding of the policy-making process and the impact of policy on society.",
  "shortProgramDescription": "The Public Policy B.A. provides students with a rigorous understanding of policy issues, processes, and institutions, drawing on multiple disciplines to analyze and address societal challenges.",
  "classHighlights": [
    "The Public Policy Program requires students to complete a set of core courses that provide a foundation in policy analysis, including Introduction to Public Policy (PUBPOL 101), Policy Analysis (PUBPOL 201), and Institutions and Interests in American Politics (PUBPOL 103).",
    "Students also take courses in economics, including Principles of Economics (ECON 1 or ECON 50), and statistics, such as Introduction to Statistical Methods in Economics and the Social Sciences (STAT 203 or PUBPOL 303).",
    "The program also includes a range of electives that allow students to explore specific policy areas, such as education, healthcare, or environmental policy, and to develop skills in areas like data analysis, program evaluation, or policy advocacy."
  ],
  "learningOutcomes": [
    "Understand the policy-making process and the role of institutions, interests, and ideas in shaping policy outcomes.",
    "Analyze policy issues using insights and methods from multiple disciplines.",
    "Apply data analysis and statistical techniques to policy problems.",
    "Communicate complex policy information to diverse audiences.",
    "Evaluate the impact of policy on different populations and communities."
  ],
  "similarPrograms": [
    {
      "title": "Political Science",
      "link": "https://politicalscience.stanford.edu/undergraduate-program"
    },
    {
      "title": "Economics",
      "link": "https://economics.stanford.edu/undergraduate-program"
    },
    {
      "title": "Urban Studies",
      "link": "https://urbstudies.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/PUBPO-BA",
    "https://publicpolicy.stanford.edu/undergraduate-program"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "Students declare the Public Policy major through the University's major declaration process. The major is open to students from all undergraduate schools and departments."
}