{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Religious Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Religious Studies major is an interdisciplinary exploration of religion and its role in human history. Majors examine the cultural, social, philosophical, and artistic dimensions of religious traditions, with a focus on primary texts, historical contexts, and comparative methods. The program is designed to foster critical thinking, cultural understanding, and nuanced analysis of complex religious phenomena. Students may choose from a variety of courses that span multiple religious traditions and historical periods.",
  "shortProgramDescription": "The Religious Studies B.A. provides an in-depth, interdisciplinary understanding of religion's role in human culture and history, preparing students for diverse careers or further study.",
  "classHighlights": [
    "Students begin with foundational courses in Religious Studies, such as Introduction to the Study of Religion, which introduces methods and approaches in the field.",
    "The program includes a range of courses on specific religious traditions, such as Introduction to the Hebrew Bible, The Life of Jesus, and Buddhist Thought, that explore the historical, cultural, and theological dimensions of these traditions.",
    "Courses in the program also examine the intersection of religion with other disciplines, such as history, philosophy, and literature, enabling students to contextualize and analyze religious phenomena from multiple perspectives.",
    "Students may choose from a variety of electives that explore themes such as religion and culture, the anthropology of religion, and the history of Christianity, among others.",
    "The major requires students to complete a minimum of 12 units of Religious Studies courses at the 100-level or above, ensuring a depth of knowledge in the field."
  ],
  "learningOutcomes": [
    "Analyze and interpret primary texts and historical contexts within religious traditions.",
    "Apply comparative methods to understand similarities and differences across religious traditions.",
    "Demonstrate an understanding of the cultural, social, and historical contexts in which religious traditions develop.",
    "Evaluate the role of religion in shaping individual and collective identities.",
    "Communicate complex ideas about religion clearly and effectively in written and oral forms.",
    "Apply critical thinking and nuanced analysis to the study of religious phenomena."
  ],
  "similarPrograms": [
    {
      "title": "Classics",
      "link": "https://bulletin.stanford.edu/programs/CLASSICS-BA"
    },
    {
      "title": "Comparative Literature",
      "link": "https://bulletin.stanford.edu/programs/COMPLIT-BA"
    },
    {
      "title": "Philosophy",
      "link": "https://bulletin.stanford.edu/programs/PHIL-BA"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/RELST-BA",
    "https://religiousstudies.stanford.edu"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units of Religious Studies and related courses; total approximately 180 quarter units",
  "additionalInformation": "Students declare the major through the School of Humanities and Sciences. The major is flexible, allowing students to tailor their coursework to their interests. No specific language proficiency is required, but students are encouraged to develop proficiency in a relevant language."
}