{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Anthropology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Anthropology program at MIT is an interdisciplinary field that explores human diversity through culture, history, and biology. Students examine human societies, behaviors, and the impact of global processes. The major prepares students for diverse careers or further study by developing critical thinking, research, and analytical skills.",
  "shortProgramDescription": "MIT's Anthropology B.S. provides a comprehensive understanding of human societies and cultures, preparing students for careers or graduate study.",
  "classHighlights": [
    "Core anthropology courses: Students complete foundational courses in sociocultural anthropology, archaeology, and biological anthropology, examining human diversity, cultural practices, and the history of the field.",
    "Theory and methods: Courses cover anthropological theory, research methods, and statistical analysis, preparing students to design and conduct research.",
    "Electives: Students choose from electives in areas such as global health, environmental anthropology, science and technology studies, and cultural heritage, allowing them to tailor their studies to their interests.",
    "Research and writing: Students develop research and writing skills through coursework and independent projects, learning to critically analyze and present anthropological data.",
    "Anthropology in context: Courses explore the intersections of anthropology with other fields, such as science, technology, and society, and the role of anthropology in addressing global challenges."
  ],
  "learningOutcomes": [
    "Understand the principles and theories of anthropology and their application to human societies and cultures.",
    "Develop research and analytical skills, including data collection, analysis, and interpretation.",
    "Cultivate critical thinking and problem-solving skills in the context of anthropological inquiry.",
    "Communicate complex ideas and research findings effectively in written and oral forms.",
    "Apply anthropological knowledge to real-world issues, such as global health, environmental sustainability, and cultural heritage."
  ],
  "similarPrograms": [
    {
      "title": "Science, Technology, and Society",
      "link": "https://sts.mit.edu"
    },
    {
      "title": "Global Studies",
      "link": "https://globalstudies.mit.edu"
    },
    {
      "title": "History",
      "link": "https://history.mit.edu"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/anthropology-course-21a",
    "https://anthropology.mit.edu/undergraduate-program"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of 180 units; at least 66 units in Anthropology and related fields",
  "additionalInformation": "Students are encouraged to participate in research projects, internships, and study abroad programs to enhance their undergraduate experience."
}