{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Biology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Department of Biology offers a Bachelor of Science degree in Biology, providing a foundation in the biological sciences. The program includes core subjects in genetics, biochemistry, molecular biology, and cell biology, as well as laboratory and research experiences. Students can choose from a variety of electives to explore different areas of biology in depth.",
  "shortProgramDescription": "The Biology B.S. program at MIT provides a comprehensive education in the biological sciences, preparing students for careers in research, medicine, and other fields.",
  "classHighlights": [
    "Foundational courses: Students begin with foundational courses in biology (7.012, 7.013, or 7.014), chemistry (5.111, 5.112 or 5.113, 5.114), and physics (8.01, 8.02 or 8.03, 8.04). These courses provide a broad background in the sciences and introduce key concepts in biology.",
    "Core biology courses: The core biology curriculum includes Genetics (7.03), Biochemistry (7.05 or 5.07), Molecular Biology (7.28), and Cell Biology (7.29 or 7.51). These courses build on the foundational knowledge and provide a deeper understanding of biological processes.",
    "Laboratory and research experiences: Students gain hands-on experience in laboratory and research settings through courses like Laboratory in Molecular Biology and Genetics (7.08), Experimental Biology (7.38), and Undergraduate Research Opportunities Program (UROP). These experiences develop experimental techniques and critical thinking.",
    "Electives and advanced courses: Students can choose from a range of electives and advanced courses to explore different areas of biology, such as developmental biology, microbiology, and evolutionary biology. Examples include Developmental Biology (7.72), Microbiology (7.34), and Evolutionary Biology (7.70)."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of biology, including genetics, biochemistry, and molecular biology.",
    "Apply scientific knowledge and critical thinking to biological problems.",
    "Design and conduct experiments, collect and analyze data, and draw conclusions based on evidence.",
    "Communicate complex biological concepts effectively in written and oral forms.",
    "Evaluate the ethical and societal implications of biological research and applications."
  ],
  "similarPrograms": [
    {
      "title": "Biological Engineering",
      "link": "https://catalog.mit.edu/degree-charts/biological-engineering-course-20"
    },
    {
      "title": "Chemistry",
      "link": "https://catalog.mit.edu/degree-charts/chemistry-course-5"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/biology-course-7",
    "https://biology.mit.edu/undergraduate/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-186 units (MIT's unit system)",
  "additionalInformation": "Students must complete GIR (General Institute Requirements) subjects in science, math, and humanities. Departmental requirements and electives provide flexibility and depth in biological sciences. Research and laboratory experiences are integral to the program."
}