{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Chemistry (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Department of Chemistry offers a program leading to the degree of Bachelor of Science in Chemistry. The program is designed to give students a thorough understanding of the principles of chemistry and to provide a foundation for further study or for professional work in chemistry or related fields. The program includes a core of required courses in chemistry, physics, and mathematics, as well as a selection of advanced courses in chemistry and related fields.",
  "shortProgramDescription": "The Chemistry B.S. program at MIT provides a comprehensive education in chemistry, preparing students for graduate study or a career in chemistry or related fields.",
  "classHighlights": [
    "The chemistry core includes five chemistry subjects (5.111, 5.112, 5.113, 5.114, 5.115 or 5.116) and two laboratory subjects (5.311, 5.312).",
    "Students also take physics (8.01, 8.02 or 8.03) and mathematics (18.01, 18.02, 18.03 or 18.04) courses to build a strong foundation in the physical sciences.",
    "Additional chemistry courses are required, including physical chemistry (5.60, 5.61), and advanced laboratory or chemistry electives.",
    "Students must also complete a set of GIR subjects in calculus, physics, biology, and chemistry."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of chemistry, including the structure and properties of matter.",
    "Apply chemical principles to solve problems and understand chemical reactions and processes.",
    "Demonstrate laboratory skills, including the ability to design and conduct experiments.",
    "Communicate chemical information effectively, both in writing and orally.",
    "Understand the role of chemistry in a broader scientific and societal context."
  ],
  "similarPrograms": [
    {
      "title": "Biochemistry",
      "link": "https://biology.mit.edu/undergraduate/degree-programs/biochemistry/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/chemistry-course-5",
    "https://chemistry.mit.edu/undergraduate-program/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-192 units (total), with 66-72 units in chemistry and related subjects",
  "additionalInformation": "Students must maintain a minimum GPA and complete specific GIR and chemistry core requirements; research opportunities are available."
}