{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Chemical Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Department of Chemical Engineering offers an undergraduate program that provides a foundation in the principles of chemical engineering, including thermodynamics, transport phenomena, and reaction kinetics. The program emphasizes the application of these principles to the design and operation of chemical processes and equipment. Students develop skills in problem-solving, data analysis, and communication, preparing them for careers in industry, research, or further study.",
  "shortProgramDescription": "MIT's Chemical Engineering B.S. program provides a rigorous foundation in chemical engineering principles, preparing students for diverse careers or further study.",
  "classHighlights": [
    "Core chemical engineering subjects: Courses in thermodynamics (10.40), transport phenomena (10.50), and reaction kinetics (10.37) provide the fundamental principles of the field.",
    "Mathematics and chemistry foundation: Students complete coursework in differential equations (18.03), calculus (18.01-02), and chemistry (5.111-12, 5.60), establishing a strong mathematical and scientific basis.",
    "Process design and laboratory: Unit operations laboratory (10.04) and process design (10.49) courses teach experimental techniques, data analysis, and design principles.",
    "Departmental and restricted electives: Students choose from a range of departmental and restricted electives, such as biochemical engineering (10.24), energy systems (10.67), and materials science (3.091), to explore specialized areas.",
    "General Institute requirements: Additional coursework includes physics (8.01-04), biology (7.012 or 7.013), and humanities/social sciences (requirement varies).",
    "Experiential learning: Students often engage in UROPs, research projects, or internships, gaining practical experience and applying theoretical knowledge."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of chemical engineering to analyze and design processes.",
    "Demonstrate understanding of thermodynamics, transport phenomena, and reaction kinetics.",
    "Design and conduct experiments, analyzing data to inform process improvements.",
    "Communicate effectively through written and oral presentations.",
    "Work effectively in teams to solve complex problems.",
    "Integrate knowledge from mathematics, science, and engineering to address real-world challenges."
  ],
  "similarPrograms": [
    {
      "title": "Chemistry",
      "link": "https://chemistry.mit.edu/undergraduate-program/"
    },
    {
      "title": "Materials Science and Engineering",
      "link": "https://mse.mit.edu/academics/undergraduate/"
    },
    {
      "title": "Energy Studies Minor",
      "link": "https://energy.mit.edu/academics/energy-studies-minor/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/chemical-engineering-course-10-c/",
    "https://cheme.mit.edu/academics/undergraduate/",
    "https://catalog.mit.edu/departments/chemical-engineering/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180 units (MIT unit system)",
  "additionalInformation": "Students must complete the General Institute Requirements and departmental requirements. Research and internship opportunities are available. GPA and progress requirements apply."
}