{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Chemical-Biological Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Department of Chemical Engineering offers a program leading to the degree of Bachelor of Science in Chemical Engineering. The program is designed to provide a broad foundation in the principles of chemical engineering, including the application of these principles to solve problems in the field. Students learn about transport phenomena, thermodynamics, kinetics, and process control, as well as the application of these concepts to the design and operation of chemical processes. The program also includes coursework in biology, mathematics, and physics, and provides opportunities for hands-on learning through laboratory and design projects.",
  "shortProgramDescription": "MIT's Chemical-Biological Engineering B.S. program provides a comprehensive education in chemical engineering principles, with a focus on biological applications and hands-on learning.",
  "classHighlights": [
    "The program begins with foundational coursework in mathematics (Calculus I, II, and III, Differential Equations), physics (Mechanics, Electricity and Magnetism), and chemistry (General Chemistry, Organic Chemistry).",
    "Core chemical engineering courses include Thermodynamics, Transport Phenomena, Chemical Engineering Thermodynamics, and Chemical and Biological Engineering Laboratory.",
    "Students also take coursework in biology, including Introduction to Biology, Molecular Biology, and Biological Chemistry, to provide a foundation for understanding biological systems and their applications in chemical engineering.",
    "Additional coursework includes Process Dynamics and Control, Chemical Engineering Design, and elective courses in areas such as biochemical engineering, environmental engineering, and materials science.",
    "The program also includes a laboratory component, where students gain hands-on experience with experimental design, data collection, and data analysis.",
    "Students can choose from a range of electives to tailor their education to their interests and career goals."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of chemical engineering to solve problems in the field.",
    "Understand and analyze complex chemical and biological systems.",
    "Design and operate chemical processes and equipment.",
    "Use mathematical models and computational tools to analyze and optimize chemical processes.",
    "Communicate complex ideas and results effectively through written and oral reports.",
    "Work effectively in teams to solve problems and complete projects."
  ],
  "similarPrograms": [
    {
      "title": "Chemical Engineering Minor",
      "link": "https://catalog.mit.edu/undergraduate/chemical-engineering-minor/"
    },
    {
      "title": "Biological Engineering",
      "link": "https://be.mit.edu/"
    },
    {
      "title": "Chemistry",
      "link": "https://chemistry.mit.edu/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/chemical-biological-engineering-course-10-b",
    "https://engineering.mit.edu/",
    "https://www.mit.edu/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-192 units (semester credits)",
  "additionalInformation": "The program is accredited by the Engineering Accreditation Commission of ABET. Students are required to complete a minimum of 180 units, including General Institute Requirements, Departmental Requirements, and Electives. Students must also meet the Institute's residency requirements and maintain a minimum GPA."
}