{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Climate System Science and Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Climate System Science and Engineering major is an interdisciplinary program that focuses on the complex interactions within the Earth's climate system. It combines coursework from the departments of Earth, Atmospheric and Planetary Sciences and Civil and Environmental Engineering to provide a comprehensive understanding of climate dynamics, impacts, and potential solutions. Students in this major explore the science behind climate change, its effects on the environment and society, and the engineering approaches to mitigate and adapt to these changes.",
  "shortProgramDescription": "The Climate System Science and Engineering major at MIT equips students with a deep understanding of the climate system and the skills to address climate-related challenges through science and engineering.",
  "classHighlights": [
    "Core subjects in Earth, Atmospheric, and Planetary Sciences (12 units): 1.12 Introduction to Geology (or equivalent field experience), 12.001 Introduction to Geology, 12.111 Introduction to Atmosphere and Ocean, and 8.03 Physics III.",
    "Climate Science and Dynamics (24 units): Subjects include 12.310 Environmental Fluid Mechanics, 12.800 Fluid Dynamics, 12.843 Climate Change Science, and electives like 12.814 Atmospheric Physics or 12.815 Climate Change Economics.",
    "Engineering and Policy (24 units): Courses cover 1.017 Computing and Data Analysis, 1.018 Environmental Impact Assessment and 1.819 Environmental Engineering, alongside electives in energy systems, climate policy, and sustainable infrastructure.",
    "Mathematics and Physics Foundations: Calculus (18.01-18.03), Differential Equations (18.03), and Physics (8.01-8.03) lay the groundwork for advanced subjects.",
    "Electives and Specializations: Students choose from a range of subjects to develop depth in areas like renewable energy, climate modeling, or environmental policy, including subjects like 22.081/22.082 Energy and 1.850 Water Resource Systems."
  ],
  "learningOutcomes": [
    "Understand the fundamental processes governing the Earth's climate system, including interactions between the atmosphere, oceans, land, and ice.",
    "Analyze the impacts of climate change on natural and human systems, and assess potential vulnerabilities and risks.",
    "Apply engineering principles to develop solutions for mitigating and adapting to climate change, including renewable energy systems, carbon capture, and climate-resilient infrastructure.",
    "Use data analysis, modeling, and computational tools to study climate dynamics and predict future changes.",
    "Communicate complex climate-related information to diverse audiences, including technical and non-technical stakeholders.",
    "Evaluate the social, economic, and policy dimensions of climate change, and consider the ethical implications of different response strategies."
  ],
  "similarPrograms": [
    {
      "title": "Earth, Atmospheric, and Planetary Sciences",
      "link": "https://eaps.mit.edu/"
    },
    {
      "title": "Civil and Environmental Engineering",
      "link": "https://cee.mit.edu/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/climate-system-science-engineering-course-1-12",
    "https://eaps.mit.edu/undergraduate/major-climate-system-science-engineering",
    "https://cee.mit.edu/academics/graduate/doctoral/climate-urban-sustainability/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-192 units (semester credit system)",
  "additionalInformation": "Students must declare the major by the end of the sophomore year and meet specific GPA requirements. The program encourages undergraduate research and participation in climate-related projects."
}