{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Computer Science and Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "This program provides a foundation in the fundamental concepts of computer science and engineering, including the design, development, and testing of computer systems and algorithms. Students take a range of courses in computer science, mathematics, and engineering, and have the opportunity to pursue advanced topics and electives in areas such as artificial intelligence, data science, and computer networks.",
  "shortProgramDescription": "MIT's Computer Science and Engineering B.S. provides a rigorous foundation in computer science and engineering, preparing students for careers or further study.",
  "classHighlights": [
    "The program begins with foundational courses in programming (6.0001 Introduction to Computer Science Programming in Python, 6.0002 Introduction to Computational Thinking and Data Science), data structures (6.006 Introduction to Algorithms), and computer system engineering (6.033 Computer System Engineering).",
    "Mathematics coursework includes calculus (18.01 Calculus I, 18.02 Calculus II), linear algebra (18.06 Linear Algebra), and discrete mathematics (6.042J Mathematics for Computer Science).",
    "Core computer science courses cover algorithms (6.006 Introduction to Algorithms), computer system engineering (6.033 Computer System Engineering), and software engineering (6.031 Elements of Software Construction).",
    "Students also complete a range of advanced courses in areas such as computer architecture (6.823 Computer System Architecture), operating systems (6.828 Operating System Engineering), and computer networks (6.829 Computer Networks).",
    "Electives allow students to explore specialized topics, including artificial intelligence (6.034 Artificial Intelligence), data science (6.419 Data Science), and computer vision (6.869 Advances in Computer Vision).",
    "Laboratory and project-based courses provide hands-on experience with computer systems and software development, such as 6.033 Computer System Engineering and 6.031 Elements of Software Construction."
  ],
  "learningOutcomes": [
    "Apply fundamental concepts of computer science and engineering to design and develop computer systems and algorithms.",
    "Analyze and solve complex problems in computer science and engineering using mathematical and computational techniques.",
    "Understand the principles of computer system engineering, including computer architecture, operating systems, and software engineering.",
    "Design and implement software systems using a range of programming languages and development methodologies.",
    "Communicate technical concepts and results effectively in written and oral form.",
    "Evaluate the ethical, social, and economic implications of computer science and engineering.",
    "Pursue advanced topics and stay current with developments in the field."
  ],
  "similarPrograms": [
    {
      "title": "Electrical Engineering and Computer Science (B.S.)",
      "link": "https://catalog.mit.edu/programs/eecs/"
    },
    {
      "title": "Computer Science (B.S.)",
      "link": "https://catalog.mit.edu/degree-charts/computer-science-course-6-4/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/computer-science-engineering-course-6-3",
    "https://www.eecs.mit.edu/",
    "https://www.csail.mit.edu/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "360 units (total), including 228 units of required and restricted electives in computer science and engineering, and 54 units of general institute requirements",
  "additionalInformation": "Students must maintain a minimum GPA and complete a range of required and restricted elective courses. The program is accredited by the Engineering Accreditation Commission of ABET."
}