{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Engineering program at MIT is designed to provide a foundation in engineering principles, mathematics, and science, with a focus on developing problem-solving skills and preparing students for a wide range of careers in engineering and other fields.",
  "shortProgramDescription": "MIT's Engineering B.S. program provides a broad foundation in engineering principles, mathematics, and science, preparing students for diverse careers.",
  "classHighlights": [
    "The Engineering program requires a foundation in mathematics, including Calculus I-III (18.01-18.03), Differential Equations (18.03), and Linear Algebra (18.06).",
    "Students complete a core in physics, including Mechanics (8.01), Electricity and Magnetism (8.02), and Waves and Optics (8.03).",
    "Engineering fundamentals are covered through courses such as Introduction to Electrical Engineering and Computer Science (6.01), and Introduction to Mechanical Engineering (2.001).",
    "Students choose from a range of engineering disciplines, including Electrical Engineering and Computer Science, Mechanical Engineering, and Chemical Engineering, each with its own set of required and elective courses.",
    "Departmental courses provide advanced knowledge in the chosen field, with opportunities for hands-on learning and project-based work.",
    "General Institute Requirements (GIRs) ensure a broad education, including science, humanities, and social sciences.",
    "Electives allow students to explore specialized topics and interests within their chosen field."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of mathematics and science to engineering problems.",
    "Design and conduct experiments, and analyze data to solve engineering problems.",
    "Develop and implement solutions to complex engineering challenges.",
    "Communicate effectively with diverse stakeholders.",
    "Work effectively in teams to achieve common goals.",
    "Understand the social, environmental, and economic contexts of engineering practice."
  ],
  "similarPrograms": [
    {
      "title": "Aeronautics and Astronautics",
      "link": "https://catalog.mit.edu/degree-charts/aeronautics-astronautics-course-16/"
    },
    {
      "title": "Chemical Engineering",
      "link": "https://catalog.mit.edu/degree-charts/engineering-chemical-engineering-course-10-eng/"
    },
    {
      "title": "Civil and Environmental Engineering",
      "link": "https://catalog.mit.edu/degree-charts/civil-environmental-engineering-course-1/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/engineering-course-10-eng/",
    "https://engineering.mit.edu/",
    "https://www.mit.edu/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "At least 180 units (MIT's unit system; roughly equivalent to 120-128 semester credits)",
  "additionalInformation": "Students must fulfill General Institute Requirements (GIRs), complete department-specific requirements, and maintain a satisfactory GPA. Engineering programs are accredited by the Engineering Accreditation Commission of ABET."
}