{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Global Studies and Languages (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Global Studies and Languages (GSL) major is an interdisciplinary program that allows students to explore global issues from multiple disciplinary perspectives and focuses on gaining skills in a foreign language. GSL majors take courses in the humanities, social sciences, and languages and investigate global phenomena through a range of lenses, producing a nuanced understanding of cultural and societal processes.",
  "shortProgramDescription": "The GSL major combines language proficiency with the study of global issues, preparing students for diverse careers or further study.",
  "classHighlights": [
    "Language proficiency: Students achieve advanced language skills via coursework and, often, study abroad, with options to develop proficiency in languages including but not limited to Spanish, French, German, Chinese, Japanese, and Arabic.",
    "Global Studies core: Courses in global studies provide a foundation in cultural theory, global processes, and issues such as human rights, migration, and environmental sustainability.",
    "Electives: Majors select from a variety of electives, enabling them to focus on geographic or thematic areas of interest, such as global development, international politics, or cross-cultural communication.",
    "Research and writing: Through seminar papers and research projects, students develop critical analysis and writing skills, integrating their language abilities with global knowledge.",
    "Cultural and societal analysis: The program offers insights into different cultures and societies, equipping students to engage thoughtfully with global challenges.",
    "Interdisciplinary approaches: GSL majors are encouraged to combine perspectives from various disciplines, enriching their understanding of global phenomena."
  ],
  "learningOutcomes": [
    "Demonstrate advanced proficiency in a foreign language.",
    "Analyze global issues from multiple disciplinary perspectives.",
    "Understand cultural and societal processes shaping global phenomena.",
    "Apply critical thinking and research skills to global challenges.",
    "Integrate language skills with knowledge of global issues.",
    "Communicate complex ideas effectively in written and oral forms."
  ],
  "similarPrograms": [
    {
      "title": "Foreign Languages and Literatures",
      "link": "https://catalog.mit.edu/departments/humanities/global-studies-languages/undergraduate-programs/#foreign-languages-and-literatures"
    },
    {
      "title": "Anthropology",
      "link": "https://catalog.mit.edu/departments/social-sciences/anthropology/"
    },
    {
      "title": "International Studies Minor",
      "link": "https://catalog.mit.edu/departments/humanities/global-studies-languages/undergraduate-programs/#international-studies-minor"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/global-studies-languages-course-21g/",
    "https://globalstudies.mit.edu",
    "https://catalog.mit.edu/departments/humanities/global-studies-languages/undergraduate-programs/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "At least 180 units (MIT's unit system; 1 unit is roughly equivalent to 1 hour of work per week)",
  "additionalInformation": "Students declare the major through the Department of Global Studies and Languages. GSL majors are encouraged to study abroad and participate in relevant research or internship opportunities."
}