{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Materials Science and Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The undergraduate program in Materials Science and Engineering is designed to provide a foundation in the science and engineering of materials, including their structure, properties, and performance. The program includes coursework in materials science, physics, chemistry, and mathematics, as well as laboratory and research experiences.",
  "shortProgramDescription": "MIT's Materials Science and Engineering B.S. program provides a comprehensive education in the science and engineering of materials, preparing students for careers in industry, research, or graduate study.",
  "classHighlights": [
    "The program begins with foundational courses in materials science and engineering, including 3.091 (Introduction to Solid-State Chemistry) and 3.022 (Microstructural Analysis), which introduce students to the principles of materials science and the analysis of microstructures.",
    "Students then progress to more advanced coursework, including 3.024 (Electronic, Optical and Magnetic Properties of Materials) and 3.032 (Mechanical Behavior of Materials), which cover the electronic, optical, and mechanical properties of materials.",
    "Laboratory courses, such as 3.052 (Nanomechanics of Materials and Biomaterials) and 3.042 (Materials Processing Laboratory), provide hands-on experience with materials synthesis, characterization, and processing.",
    "Additional coursework in physics, chemistry, and mathematics provides a broad foundation in the underlying sciences, with courses such as 8.01 (Physics I) and 5.111 (Principles of Chemical Science).",
    "Students also complete a series of restricted electives, which allow them to explore specialized topics in materials science and engineering, such as biomaterials, nanomaterials, or energy materials.",
    "Throughout the program, students develop their skills in data analysis, experimental design, and problem-solving, preparing them for careers in industry, research, or graduate study."
  ],
  "learningOutcomes": [
    "Apply knowledge of materials science and engineering to solve problems in a variety of contexts.",
    "Analyze the structure, properties, and performance of materials.",
    "Design and conduct experiments to characterize materials and their properties.",
    "Use data analysis and problem-solving skills to interpret results and make informed decisions.",
    "Communicate complex technical information effectively in written and oral form.",
    "Work effectively in teams to solve problems and complete projects."
  ],
  "similarPrograms": [
    {
      "title": "Materials Science and Engineering Minor",
      "link": "https://catalog.mit.edu/majors/minors/materials-science-engineering-minor/"
    },
    {
      "title": "Chemical Engineering",
      "link": "https://catalog.mit.edu/departments/chemical-engineering/"
    },
    {
      "title": "Mechanical Engineering",
      "link": "https://catalog.mit.edu/departments/mechanical-engineering/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/materials-science-engineering-course-3-a",
    "https://www.mit.edu/~dmse/undergrad/",
    "https://catalog.mit.edu/majors/materials-science-engineering/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-186 units (MIT's unit system, where 1 unit is equivalent to approximately 1 hour of work per week)",
  "additionalInformation": "Students must complete a minimum of 180 units to graduate, including a set of required courses in materials science and engineering, physics, chemistry, and mathematics. The program is designed to be completed in 4 years, with a typical course load of 4-5 courses per semester."
}