{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Music (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Music program at MIT is designed for students who wish to pursue a deep understanding of music within the context of a science and engineering education. The curriculum covers a broad range of musical topics, from the physics of sound and music theory to the cultural and historical contexts of music. Students engage in performance, composition, and analysis, developing their skills as musicians and music scholars.",
  "shortProgramDescription": "The Music B.S. at MIT combines performance, theory, and history to provide a comprehensive musical education within a STEM environment.",
  "classHighlights": [
    "The program begins with foundational courses in Music Theory (21M.301-304) and Harmony and Counterpoint (21M.301-304), providing a strong understanding of musical structure and composition.",
    "Students explore the history of Western music through courses like History of Western Music (21M.205, 21M.606) and Non-Western Music (21M.216, 21M.287), broadening their cultural and historical knowledge.",
    "Courses in acoustics, such as The Physics of Music (21M.295, 8.03, 8.13), examine the physical principles underlying sound and music, integrating scientific inquiry into the musical curriculum.",
    "Performance is a key component, with requirements that include participation in ensembles and individual or group lessons, ensuring that students develop practical musical skills.",
    "Electives allow students to pursue specialized interests, including jazz studies, electronic music, and music technology, providing flexibility within the major.",
    "Analytical and theoretical coursework, including courses like Analysis of Music (21M.303, 21M.603) and Composition (21M.304, 21M.604), helps students develop a deeper understanding of music through both practical and theoretical lenses."
  ],
  "learningOutcomes": [
    "Demonstrate a thorough understanding of music theory and harmony.",
    "Analyze and interpret music from various historical and cultural contexts.",
    "Apply knowledge of the physics of sound to musical understanding.",
    "Perform at a high level as individuals and in ensembles.",
    "Compose and improvise music in various styles.",
    "Integrate musical knowledge with other disciplines, such as science and technology."
  ],
  "similarPrograms": [
    {
      "title": "Music Minor",
      "link": "https://catalog.mit.edu/degree-charts/music-minor/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/music-course-21m",
    "https://music.mit.edu/undergraduate/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-192 units (MIT's unit system; roughly equivalent to credits in other institutions)",
  "additionalInformation": "Admission to the major is by audition and interview. Students are expected to participate in music ensembles and other performance activities throughout their undergraduate career."
}