{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Nuclear Science and Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Nuclear Science and Engineering Department at MIT offers a Bachelor of Science degree that provides a comprehensive education in the fundamental principles of nuclear science and engineering. The program includes coursework in nuclear physics, reactor physics, radiation protection, nuclear systems, and energy policy, as well as laboratory and research experiences. Students develop skills in problem-solving, analysis, and communication, preparing them for careers in industry, government, or further study.",
  "shortProgramDescription": "The Nuclear Science and Engineering B.S. program at MIT provides a rigorous foundation in nuclear science and engineering principles, preparing students for diverse careers or further study.",
  "classHighlights": [
    "Nuclear Physics and Reactor Physics: Students take coursework in nuclear physics (22.02 Introduction to Applied Nuclear Physics) and reactor physics (22.06/22.061 Nuclear Reactor Physics), gaining a deep understanding of nuclear reactions, radiation transport, and reactor operation.",
    "Nuclear Systems and Energy Policy: Courses such as 22.033 Nuclear Systems Design and 22.081/22.082 Energy and the Environment cover the design and analysis of nuclear systems, as well as the broader context of energy production and policy.",
    "Radiation Protection and Nuclear Measurements: Students learn about radiation protection (22.55 Principles of Radiation Interactions) and nuclear measurements (22.03/22.033 Nuclear Systems Design), including laboratory experiments with radiation detection and measurement.",
    "Mathematics and Computation: The program requires a strong foundation in mathematics (including differential equations and linear algebra) and computational skills, applied to nuclear science and engineering problems.",
    "Laboratory and Research Experiences: Students participate in laboratory subjects (22.03/22.033 Nuclear Systems Design, 22.071/22.072 Nuclear Engineering Laboratory) and have opportunities to engage in research projects, developing experimental and analytical skills."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of nuclear physics and engineering to analyze and design nuclear systems.",
    "Understand radiation interactions, radiation protection, and nuclear measurements.",
    "Analyze and design nuclear reactors and other nuclear systems.",
    "Evaluate the role of nuclear energy in the broader energy landscape and policy context.",
    "Develop problem-solving, analytical, and communication skills in the context of nuclear science and engineering."
  ],
  "similarPrograms": [
    {
      "title": "Chemical Engineering",
      "link": "https://catalog.mit.edu/departments/chemical-engineering/"
    },
    {
      "title": "Materials Science and Engineering",
      "link": "https://catalog.mit.edu/departments/materials-science-engineering/"
    },
    {
      "title": "Physics",
      "link": "https://catalog.mit.edu/departments/physics/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/nuclear-science-engineering-course-22",
    "https://www.mit.edu/~22www/",
    "https://nse.mit.edu/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-192 units (total), with 66-72 units required for the major; semester credit system",
  "additionalInformation": "Students must complete a set of General Institute Requirements (GIRs) in addition to the major-specific coursework. Opportunities for research, internships, and international experiences are available."
}