{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Second Major",
  "programName": "Science, Technology, and Society/Second Major (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The STS major is an interdisciplinary program designed for students who wish to understand the social, political, and cultural dimensions of science and technology. The STS curriculum includes a foundation in the social sciences and humanities, as well as a range of electives that allow students to explore specific topics in depth.",
  "shortProgramDescription": "The STS major at MIT prepares students to think critically about the interactions between science, technology, and society, and to apply this understanding to real-world problems.",
  "classHighlights": [
    "Core STS Courses: The STS major includes a set of core courses that introduce students to the field, including STS.001/2 (Science, Technology, and Society) and STS.100/101 (Introduction to STS). These courses provide a foundation in the history, philosophy, and sociology of science and technology.",
    "STS Electives: Students in the STS major choose from a range of electives that allow them to explore specific topics in depth, including the history of science and technology, the politics of science and technology, and the cultural dimensions of science and technology. Examples of electives include STS.210 (The History of Science and Technology), STS.320 (The Politics of Science and Technology), and STS.330 (The Culture of Science and Technology).",
    "Methods and Theory: STS majors also take courses in research methods and theory, including STS.300 (Research Methods in STS) and STS.410 (Theories of STS). These courses provide students with the skills and knowledge they need to analyze and interpret complex data and to develop their own research projects.",
    "Concentration Courses: In addition to the core courses and electives, STS majors choose a concentration that allows them to focus on a specific area of interest. Concentrations may include topics such as the history of science and technology, science and technology policy, or the cultural dimensions of science and technology.",
    "General Institute Requirements: STS majors must also complete the General Institute Requirements, which include courses in mathematics, science, and humanities."
  ],
  "learningOutcomes": [
    "Understand the social, political, and cultural dimensions of science and technology",
    "Analyze the historical and contemporary interactions between science, technology, and society",
    "Apply STS concepts and methods to real-world problems",
    "Develop critical thinking and research skills",
    "Communicate complex ideas effectively in written and oral form"
  ],
  "similarPrograms": [
    {
      "title": "History and Science",
      "link": "https://catalog.mit.edu/interdisciplinary/hast/"
    },
    {
      "title": "Anthropology",
      "link": "https://catalog.mit.edu/anthropology/"
    },
    {
      "title": "Science, Technology, and Society Minor",
      "link": "https://catalog.mit.edu/minors/sts/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/science-technology-society-sts",
    "https://sts.mit.edu/undergraduate-program"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-192 units (total), including 48-54 units for the STS major",
  "additionalInformation": "The STS major is a flexible program that allows students to tailor their course of study to their interests and goals. Students are encouraged to pursue research and internship opportunities to gain practical experience in the field."
}