{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Urban Science and Planning with Computer Science (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Urban Science and Planning with Computer Science major combines the fields of urban planning and computer science. Students learn to apply computational methods to analyze and address urban challenges. The program focuses on developing skills in data analysis, software development, and urban planning principles.",
  "shortProgramDescription": "This interdisciplinary major equips students with the skills to analyze urban challenges using computational methods and apply urban planning principles.",
  "classHighlights": [
    "Students take foundational courses in computer science, including 6.0001 Introduction to Computer Science Programming in Python, 6.0002 Introduction to Computational Thinking and Data Science, and 6.001 Structure and Interpretation of Computer Programs.",
    "Courses in urban studies and planning include 11.001 Introduction to Urban Science, 11.203 Microeconomics, and 11.309J Urban Design.",
    "Mathematics and statistics coursework encompasses 18.01 Calculus, 18.02 Calculus, 6.041 Probabilistic Systems Analysis and Applied Probability, and 11.220 Quantitative Methods for Urban Analysis.",
    "Data analysis and computing courses include 6.045J Automata, Computability, and Complexity, 6.006 Introduction to Algorithms, and 6.031 Software Construction.",
    "Urban planning and policy courses cover topics such as urban development, transportation, and environmental planning, including 11.401J Introduction to Urban Planning, 11.434 Urban Policy, and 11.520 Planning for Sustainable Urban Development."
  ],
  "learningOutcomes": [
    "Apply computational methods to analyze and address urban challenges.",
    "Understand the principles of urban planning and development.",
    "Develop skills in data analysis, software development, and urban planning.",
    "Analyze complex urban systems and develop solutions.",
    "Communicate technical information to both technical and non-technical audiences."
  ],
  "similarPrograms": [
    {
      "title": "Computer Science and Engineering (B.S.)",
      "link": "https://catalog.mit.edu/programs/computer-science-engineering/"
    },
    {
      "title": "Urban Studies and Planning (Minor)",
      "link": "https://dusp.mit.edu/undergraduate/minor"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/urban-science-planning-computer-science-11-6",
    "https://dusp.mit.edu/undergraduate/major"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-192 units (semester system)",
  "additionalInformation": "Students must complete a GIR (General Institute Requirements) and a major-specific curriculum. Departmental advising is available."
}