{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Writing (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Writing major at MIT is an undergraduate program that focuses on the art and craft of writing. Students develop their skills in creative writing, technical writing, and other forms of writing. The program emphasizes the importance of language, literature, and culture in understanding the world.",
  "shortProgramDescription": "The Writing major at MIT prepares students for careers in writing, editing, and publishing, as well as for graduate study in literature and creative writing.",
  "classHighlights": [
    "Students in the Writing major take a range of courses that introduce them to different forms of writing, including poetry, fiction, and nonfiction. Courses such as Introduction to Creative Writing (21W.789) and Forms of Poetry (21W.762) help students develop their skills in various genres.",
    "The major requires students to take courses in literary analysis and criticism, such as Literary Criticism (21L.410) and Reading and Response (21W.751). These courses help students develop their critical thinking and analytical skills.",
    "Students also take courses that focus on the technical and professional aspects of writing, such as Technical Writing (21W.730) and Publishing and the Written Word (21W.035). These courses prepare students for careers in technical writing, editing, and publishing.",
    "The major allows students to explore their interests in various forms of writing through electives such as Creative Nonfiction (21W.766) and Playwriting (21W.732).",
    "Students are also required to take a course on the teaching of writing, such as Teaching Writing (21W.955), which prepares them for careers in teaching and education."
  ],
  "learningOutcomes": [
    "Develop skills in creative writing, technical writing, and other forms of writing",
    "Analyze and interpret literary texts",
    "Understand the cultural and historical contexts of literature",
    "Develop critical thinking and analytical skills",
    "Prepare for careers in writing, editing, and publishing, as well as for graduate study in literature and creative writing"
  ],
  "similarPrograms": [
    {
      "title": "Literature",
      "link": "https://catalog.mit.edu/degree-charts/literature-course-21l"
    },
    {
      "title": "Comparative Media Studies/Writing",
      "link": "https://catalog.mit.edu/degree-charts/comparative-media-studies-writing-course-cms"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/writing-course-21w",
    "https://writing.mit.edu"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "128-136 units (total), including GIRs and major requirements; semester system",
  "additionalInformation": "Students in the Writing major are encouraged to pursue internships and other experiential learning opportunities to gain practical experience in their field. The major also allows students to pursue a minor or a concentration in a related field."
}