{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Ancient Greek and Roman Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Ancient Greek and Roman Studies major provides students with a rigorous foundation in the languages, literature, history, and culture of ancient Greece and Rome. The program allows students to explore a broad range of topics, including classical languages, ancient history, classical literature, and the reception of classical antiquity. Coursework covers the social, cultural, and intellectual contexts of the ancient Mediterranean world, as well as its ongoing influence on contemporary society.",
  "shortProgramDescription": "The Ancient Greek and Roman Studies B.A. at UC Berkeley offers students a comprehensive understanding of ancient Greek and Roman civilizations, preparing them for careers in fields such as education, law, or the arts, or for graduate study.",
  "classHighlights": [
    "Language and Literature: Students develop proficiency in ancient Greek and/or Latin through required language courses (e.g., Ancient Greek 101-102, Latin 101-102) and engage with classical literature through surveys and specialized courses (e.g., Classics 131A, Greek 132).",
    "Ancient History and Culture: Coursework explores the historical and cultural contexts of ancient Greece and Rome, covering topics from the archaic period to late antiquity, and incorporating archaeology, epigraphy, and numismatics (e.g., Classics 120AC, History 128A).",
    "Classical Reception and Comparative Studies: Students examine the influence of classical antiquity on later cultures, analyzing the ways in which ancient Greek and Roman civilizations have shaped art, literature, and thought in subsequent periods (e.g., Classics 147, Comparative Literature 143)."
  ],
  "learningOutcomes": [
    "Demonstrate proficiency in reading and interpreting ancient Greek and/or Latin texts.",
    "Analyze the historical, cultural, and literary contexts of ancient Greece and Rome.",
    "Evaluate the ongoing influence of classical antiquity on contemporary culture.",
    "Apply critical thinking and analytical skills to the study of classical texts and artifacts.",
    "Communicate complex ideas effectively in written and oral forms."
  ],
  "similarPrograms": [
    {
      "title": "Classics Department",
      "link": "https://classics.berkeley.edu"
    },
    {
      "title": "Ancient History Minor",
      "link": "https://history.berkeley.edu/undergraduate/minor"
    },
    {
      "title": "Comparative Literature",
      "link": "https://complit.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/ancient-greek-roman-studies",
    "https://classics.berkeley.edu"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits (total), including major requirements",
  "additionalInformation": "Students must satisfy the University's foreign language requirement, typically through completion of two years of ancient Greek or Latin. The major involves a combination of core and elective courses, as well as a senior essay or capstone project."
}