{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Asian American and Asian Diaspora Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Asian American and Asian Diaspora Studies (BA) program provides students with a comprehensive understanding of the histories, cultures, and experiences of Asian Americans and the Asian diaspora. The program examines the complex and dynamic relationships between Asia, the United States, and other global contexts, and explores the ways in which Asian Americans and diasporic communities have shaped and been shaped by these contexts. Students engage with a range of disciplines, including history, literature, cultural studies, and social sciences, to develop a nuanced understanding of the complex issues and themes that define the field.",
  "shortProgramDescription": "The Asian American and Asian Diaspora Studies (BA) program provides students with a comprehensive understanding of the histories, cultures, and experiences of Asian Americans and the Asian diaspora.",
  "classHighlights": [
    "The program's core courses, such as Introduction to Asian American Studies and Research Methods in Asian American Studies, provide students with a foundation in the field and prepare them for more advanced coursework.",
    "Courses in the program's history and cultural studies tracks, such as History of Asian Americans and Asian American Literature, allow students to explore the complex and diverse experiences of Asian Americans and diasporic communities.",
    "The program's social sciences and contemporary issues tracks, such as Asian American Communities and Social Movements, enable students to examine the social, economic, and political contexts that shape the lives of Asian Americans and diasporic communities.",
    "Electives in the program allow students to pursue specialized interests, such as Asian American film, queer Asian American studies, or Asian American mental health.",
    "Courses in the program often incorporate community engagement, service-learning, and research projects, providing students with hands-on experience and practical skills."
  ],
  "learningOutcomes": [
    "Analyze the complex and dynamic relationships between Asia, the United States, and other global contexts.",
    "Understand the diverse experiences and cultures of Asian Americans and diasporic communities.",
    "Apply critical thinking and research skills to examine the social, economic, and political contexts that shape the lives of Asian Americans and diasporic communities.",
    "Develop effective communication and collaboration skills through written and oral assignments, group projects, and community engagement.",
    "Cultivate a nuanced understanding of the complex issues and themes that define the field of Asian American and Asian diaspora studies."
  ],
  "similarPrograms": [
    {
      "title": "Ethnic Studies",
      "link": "https://ethnicstudies.berkeley.edu"
    },
    {
      "title": "South and Southeast Asian Studies",
      "link": "https://seasia.berkeley.edu"
    },
    {
      "title": "East Asian Languages and Cultures",
      "link": "https://ealc.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/asian-american-diaspora-studies",
    "https://aas.berkeley.edu"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 credits (semester system)",
  "additionalInformation": "Students must complete a set of core courses, including Introduction to Asian American Studies and Research Methods in Asian American Studies, as well as a range of electives and upper-division coursework. The program encourages students to pursue research projects, community engagement, and internships to gain practical experience and skills."
}