{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Bioengineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Bioengineering Major provides a broad foundation in the principles and practices of bioengineering, preparing students for a wide range of careers in industry, academia, government, and healthcare. The curriculum encompasses core engineering principles, life sciences, and mathematics, as well as specialized courses in bioengineering topics. Students gain hands-on experience through laboratory courses and have opportunities to engage in research and design projects.",
  "shortProgramDescription": "The Bioengineering B.S. at UC Berkeley combines engineering principles with life sciences to prepare students for careers or graduate study in bioengineering and related fields.",
  "classHighlights": [
    "Foundational Courses: The program begins with foundational courses in mathematics (Calculus I-III, Differential Equations), physics, chemistry, and biology, providing a strong base for advanced bioengineering studies.",
    "Core Bioengineering Courses: Students take core bioengineering courses that cover topics such as biomechanics, biomaterials, bioengineering analysis, and systems physiology, introducing key concepts and techniques in the field.",
    "Engineering and Life Sciences: Courses in engineering mechanics, thermodynamics, and transport phenomena are complemented by life sciences courses, including molecular biology, biochemistry, and physiology, to provide a comprehensive understanding of biological systems and their engineering applications.",
    "Laboratory and Design Courses: Laboratory courses and design projects allow students to apply theoretical knowledge to practical problems, gaining experience in experimental design, data analysis, and problem-solving.",
    "Technical Electives: Students choose from a range of technical electives to deepen their knowledge in areas such as biomedical devices, tissue engineering, synthetic biology, and bioinformatics, tailoring their education to their interests and career goals."
  ],
  "learningOutcomes": [
    "Apply engineering principles to biological systems and medical devices.",
    "Understand the molecular and cellular basis of physiological processes.",
    "Analyze and design biomedical systems and devices.",
    "Communicate complex bioengineering concepts effectively.",
    "Work effectively in interdisciplinary teams.",
    "Apply mathematical and computational tools to bioengineering problems.",
    "Demonstrate an understanding of the ethical and societal implications of bioengineering."
  ],
  "similarPrograms": [
    {
      "title": "Chemical Engineering",
      "link": "https://chemical.berkeley.edu/undergrad/chemical-engineering-major"
    },
    {
      "title": "Mechanical Engineering",
      "link": "https://me.berkeley.edu/undergrad/major"
    },
    {
      "title": "Molecular and Cell Biology",
      "link": "https://mcb.berkeley.edu/undergrad/mcb-major"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/bioengineering",
    "https://bioeng.berkeley.edu/academics/undergraduate",
    "https://www.berkeley.edu/catalog/2023-24/ugrad/degree-programs/bioengineering"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "128-136 units (semester system)",
  "additionalInformation": "The major is administered by the Department of Bioengineering, with advising available through the College of Engineering. Students are encouraged to engage in research, internships, and design projects to complement their coursework."
}