{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Business Administration (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Bachelor of Arts in Business Administration program at UC Berkeley is designed to provide students with a comprehensive understanding of business practices, leadership, and the global economy. The program emphasizes analytical skills, ethical decision-making, and strategic thinking, preparing students for diverse careers in the business sector and beyond. The curriculum includes foundational courses in business, economics, and quantitative methods, as well as advanced electives in areas such as finance, marketing, and organizational behavior.",
  "shortProgramDescription": "The Business Administration B.A. at UC Berkeley develops analytical and leadership skills, preparing students for careers in business and related fields through a comprehensive curriculum.",
  "classHighlights": [
    "The program requires foundational courses that include Financial Accounting, Managerial Economics, and Business Communications, which provide a base understanding of business operations and economic principles.",
    "Students are also required to take courses in Finance, Marketing, and Organizational Behavior, which cover areas such as financial management, market analysis, and leadership.",
    "Electives allow students to specialize in areas of interest, including courses on entrepreneurship, global business, and business ethics.",
    "Quantitative methods are emphasized through courses in statistics and data analysis, equipping students with analytical skills.",
    "The curriculum includes a focus on the global economy and the social and ethical implications of business practices."
  ],
  "learningOutcomes": [
    "Apply analytical skills to business problems and decision-making.",
    "Demonstrate understanding of business functions, including finance, marketing, and organizational behavior.",
    "Analyze the impact of business practices on society and the global economy.",
    "Develop leadership and teamwork skills.",
    "Communicate effectively in a business context.",
    "Understand the ethical dimensions of business decisions."
  ],
  "similarPrograms": [
    {
      "title": "Business Administration Minor",
      "link": "https://haas.berkeley.edu/undergraduate/minor"
    },
    {
      "title": "Economics",
      "link": "https://economics.berkeley.edu/undergrad/major"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/business-administration",
    "https://haas.berkeley.edu/undergraduate/ba-in-business-administration"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The program is highly competitive, with admission based on a separate application process. GPA and coursework requirements must be met."
}