{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Celtic Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Celtic Studies at UC Berkeley offers an undergraduate major in Celtic Studies. The program focuses on the languages, literatures, and cultures of the Celtic-speaking peoples from the earliest times to the present. Students gain a broad understanding of Celtic cultures, as well as skills in Celtic languages.",
  "shortProgramDescription": "The Celtic Studies B.A. program explores the languages, literatures, and cultures of Celtic-speaking peoples, preparing students for careers or further study.",
  "classHighlights": [
    "Language and Literature: Courses cover Old Irish, Middle Welsh, and Modern Celtic languages, along with the literature of these languages. Examples include Celtic civilization (CELTIC 10), Old Irish (CELTIC 101), and Modern Irish (CELTIC 121).",
    "Celtic History and Culture: Classes examine the history, mythology, and cultural practices of Celtic-speaking regions. Relevant courses include History of the Celtic Peoples (CELTIC 110) and Celtic Culture and Society (CELTIC 130).",
    "Electives and Special Topics: Students can choose from a range of electives that explore various aspects of Celtic studies, including CELTIC 195 (Special Topics) and CELTIC 199 (Supervised Independent Study)."
  ],
  "learningOutcomes": [
    "Read and analyze Celtic languages, including Old Irish and Modern Irish.",
    "Understand the historical and cultural contexts of Celtic literatures and societies.",
    "Apply critical thinking to the study of Celtic cultures and their global connections.",
    "Communicate effectively about Celtic studies in written and oral forms."
  ],
  "similarPrograms": [
    {
      "title": "Comparative Literature",
      "link": "https://comparativeliterature.berkeley.edu"
    },
    {
      "title": "Linguistics",
      "link": "https://linguistics.berkeley.edu"
    },
    {
      "title": "History",
      "link": "https://history.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/celtic-studies",
    "https://celtic.berkeley.edu"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students are encouraged to study abroad in Celtic-speaking regions and to participate in research projects or internships related to Celtic studies."
}