{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Chicanx Latinx Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Chicanx Latinx Studies major is an interdisciplinary program that focuses on the experiences, histories, cultures, and social justice movements of Chicanx and Latinx communities. The program examines the complexities of identity, culture, and power, and prepares students for a wide range of careers and graduate study. Students engage with coursework across multiple departments, fostering critical thinking, research, and community engagement.",
  "shortProgramDescription": "The Chicanx Latinx Studies B.A. provides an in-depth understanding of Chicanx and Latinx histories, cultures, and social justice issues through interdisciplinary study.",
  "classHighlights": [
    "The introductory course, Introduction to Chicanx and Latinx Studies (ETHSTDLAT 10), provides a foundational understanding of the field.",
    "Core courses such as History of Chicanos/Latinos in the U.S. (HIST 125AC) and Chicanx/Latinx Literature (SPAN 130AC) explore the historical and literary contexts of Chicanx and Latinx experiences.",
    "Upper-division courses like Chicanx/Latinx Identities (ETHSTDLAT 166AC) and Chicanx and Latinx Art and Culture (ETHSTDLAT 130AC) allow students to dive deeper into specific themes and issues.",
    "Electives drawn from various departments enable students to explore related topics, including social justice, identity, and cultural studies, ensuring a broad and nuanced understanding of the field."
  ],
  "learningOutcomes": [
    "Analyze the historical and contemporary experiences of Chicanx and Latinx communities.",
    "Understand the complexities of identity, culture, and power in Chicanx and Latinx contexts.",
    "Apply critical thinking and research skills to issues affecting Chicanx and Latinx populations.",
    "Engage with diverse perspectives and foster community involvement.",
    "Prepare for careers or further study in fields related to Chicanx and Latinx Studies."
  ],
  "similarPrograms": [
    {
      "title": "Ethnic Studies",
      "link": "https://ethnicstudies.berkeley.edu"
    },
    {
      "title": "Latin American Studies",
      "link": "https://latinamericanstudies.berkeley.edu"
    },
    {
      "title": "Comparative Literature",
      "link": "https://complit.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/chicanx-latinx-studies",
    "https://ethst.berkeley.edu/undergraduate/chicanx-latinx-studies-major"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of 120 semester credits for the degree, with specific major requirements as outlined by the department.",
  "additionalInformation": "The major is designed to be completed in four years. Students are encouraged to engage with faculty advisors to tailor their coursework and research to their interests. Opportunities for internships, research, and study abroad are available."
}