{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Chinese Language (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of East Asian Languages and Cultures offers a major in Chinese Language, which includes coursework in Chinese language, literature, and culture. Students gain a deep understanding of Chinese culture and develop advanced language skills.",
  "shortProgramDescription": "The Chinese Language major at UC Berkeley develops advanced language skills and cultural understanding through coursework in Chinese language, literature, and culture.",
  "classHighlights": [
    "The Chinese Language major requires coursework in Chinese language, including grammar, vocabulary, and composition. Courses such as Chinese 101-102-103 (First-Year Chinese) and Chinese 104-105-106 (Second-Year Chinese) provide a foundation in language skills.",
    "Students also take courses in Chinese literature and culture, such as Chinese 198 (Readings in Chinese Literature and Culture) and Chinese 146 (Chinese Cinema).",
    "Upper-division coursework includes advanced language courses, such as Chinese 107 (Third-Year Chinese) and Chinese 108 (Chinese Reading and Writing), as well as courses on Chinese literature and culture, such as Chinese 130 (Classical Chinese) and Chinese 140 (Chinese Folklore).",
    "Students also have the opportunity to take elective courses in related fields, such as East Asian Studies, Comparative Literature, and Linguistics."
  ],
  "learningOutcomes": [
    "Develop advanced language skills in Chinese, including reading, writing, and speaking",
    "Gain a deep understanding of Chinese culture, including literature, history, and customs",
    "Analyze and interpret Chinese texts, including classical and modern literature",
    "Develop critical thinking and research skills through coursework and independent study"
  ],
  "similarPrograms": [
    {
      "title": "East Asian Languages and Cultures",
      "link": "https://ealc.berkeley.edu"
    },
    {
      "title": "East Asian Studies Minor",
      "link": "https://ealc.berkeley.edu/undergraduate/minor"
    },
    {
      "title": "Japanese Language (B.A.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/japanese-language"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/chinese-language",
    "https://ealc.berkeley.edu",
    "https://www.berkeley.edu/catalog"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students are encouraged to study abroad in China or Taiwan to enhance their language skills and cultural understanding. The major also offers opportunities for research and independent study."
}