{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Computer Science (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Computer Science major at UC Berkeley is designed to provide a broad and deep understanding of the principles and practices of computer science. The program emphasizes the development of problem-solving skills, algorithmic thinking, and the ability to design, implement, and test software systems. Students learn about the theoretical foundations of computer science, as well as the practical aspects of software development, including programming languages, data structures, algorithms, computer architecture, and software engineering.",
  "shortProgramDescription": "The UC Berkeley Computer Science B.A. provides a solid foundation in computer science principles, preparing students for careers or further study.",
  "classHighlights": [
    "The major requires foundational courses in Discrete Mathematics (MATH 55 or COMPSCI 70), Programming (COMPSCI 61A), and Data Structures (COMPSCI 61B).",
    "Students take core courses in Computer Architecture (COMPSCI 61C), Algorithms (COMPSCI 170), and Theory of Computation (COMPSCI 172 or 175).",
    "Upper-division electives allow students to explore specialized areas, such as artificial intelligence, computer networks, database systems, and software engineering.",
    "The program includes a breadth requirement, ensuring students are exposed to a range of computer science topics and related fields.",
    "Students must complete a total of 11 upper-division courses, including at least 7 from the Computer Science department.",
    "Electives enable students to tailor their education to their interests, whether in technical areas or interdisciplinary fields."
  ],
  "learningOutcomes": [
    "Understand and apply the fundamental principles of computer science.",
    "Design, implement, and test software systems.",
    "Analyze algorithms for correctness and efficiency.",
    "Understand the theoretical foundations of computer science.",
    "Communicate technical concepts effectively.",
    "Apply computer science concepts to real-world problems."
  ],
  "similarPrograms": [
    {
      "title": "Data Science",
      "link": "https://data.berkeley.edu/undergrad"
    },
    {
      "title": "Cognitive Science",
      "link": "https://cogsci.berkeley.edu"
    },
    {
      "title": "Computer Science Minor",
      "link": "https://www2.eecs.berkeley.edu/Catalog/Programs/minor_cs.html"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/computer-science-ba",
    "https://www.eecs.berkeley.edu/resources/undergrad",
    "https://www2.eecs.berkeley.edu/Catalog/Programs/computer_science_bs.html"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 total units (semester system)",
  "additionalInformation": "Students must fulfill the university's general education requirements and maintain a minimum GPA. The major is administered by the Department of Electrical Engineering and Computer Sciences."
}