{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "East Asian Religion, Thought and Culture (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The East Asian Religion, Thought and Culture major is an interdisciplinary program that provides students with a comprehensive understanding of the religious, philosophical, and cultural traditions of East Asia. The major covers the historical and cultural contexts of East Asian societies, including China, Japan, and Korea, and explores the complex interactions between different religious and cultural traditions.",
  "shortProgramDescription": "This major provides students with a nuanced understanding of East Asian cultures, religions, and philosophies, preparing them for a range of careers and graduate study.",
  "classHighlights": [
    "The major requires students to complete a set of core courses that introduce them to the major themes, texts, and methodologies of the field, including introductory surveys of East Asian cultures and religions.",
    "Students take upper-division courses that explore specific topics, such as Chinese Buddhism, Japanese Confucianism, and Korean shamanism, as well as the cultural and historical contexts that have shaped East Asian societies.",
    "Courses in the major also cover a range of disciplinary approaches, including history, literature, philosophy, and anthropology, allowing students to develop a rich understanding of the complex interactions between different cultural and religious traditions.",
    "The major includes coursework on the historical development of East Asian cultures, including the role of key texts, figures, and institutions in shaping cultural and religious practices.",
    "Students also have the opportunity to explore specialized topics, such as the role of women in East Asian cultures, the impact of globalization on East Asian societies, and the representation of East Asian cultures in literature and media."
  ],
  "learningOutcomes": [
    "Demonstrate a nuanced understanding of the major religious, philosophical, and cultural traditions of East Asia.",
    "Analyze the complex interactions between different cultural and religious traditions in East Asia.",
    "Apply a range of disciplinary approaches, including history, literature, philosophy, and anthropology, to the study of East Asian cultures and societies.",
    "Evaluate the historical and cultural contexts that have shaped East Asian societies.",
    "Communicate effectively about East Asian cultures, religions, and philosophies in written and oral form."
  ],
  "similarPrograms": [
    {
      "title": "Asian American and Asian Diaspora Studies",
      "link": "https://asianamericanstudies.berkeley.edu"
    },
    {
      "title": "East Asian Languages and Cultures",
      "link": "https://ealc.berkeley.edu"
    },
    {
      "title": "South and Southeast Asia Studies",
      "link": "https://seasia.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/east-asian-religion-thought-culture",
    "https://eastasian.berkeley.edu",
    "https://www.berkeley.edu/catalog/departments/east-asian-languages-and-cultures"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The major is designed to be completed within four years, with students typically declaring the major in their sophomore or junior year. Students are encouraged to study abroad in East Asia to enhance their language skills and cultural understanding."
}