{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "East Asian Humanities (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of East Asian Languages and Cultures offers an undergraduate major in East Asian Humanities leading to the Bachelor of Arts degree. The major is designed to provide students with a broad understanding of the cultures of East Asia, with a focus on the humanities. Students may concentrate on a particular country or period, or explore the region as a whole. The major requires a total of 12 courses, including 4 lower division language courses, 4 upper division language courses, and 4 upper division elective courses.",
  "shortProgramDescription": "The East Asian Humanities major provides students with a broad understanding of East Asian cultures, with a focus on humanities.",
  "classHighlights": [
    "Language courses: Students take 8 language courses, including lower division courses that introduce the fundamentals of East Asian languages, and upper division courses that build on these skills. Courses cover languages such as Chinese, Japanese, and Korean.",
    "Elective courses: Students take 4 upper division elective courses that explore various aspects of East Asian cultures, such as literature, history, and cultural studies. Courses may be chosen from a range of departments, including East Asian Languages and Cultures, History, and Comparative Literature.",
    "Pre-modern and modern courses: Elective courses may focus on pre-modern or modern topics, allowing students to explore different periods and themes in East Asian cultures. Courses may examine the historical and cultural contexts of East Asia, as well as contemporary issues and trends."
  ],
  "learningOutcomes": [
    "Demonstrate a broad understanding of East Asian cultures and histories",
    "Develop language skills in one or more East Asian languages",
    "Analyze and interpret cultural texts and artifacts",
    "Understand the historical and cultural contexts of East Asia",
    "Communicate effectively about East Asian cultures and issues"
  ],
  "similarPrograms": [
    {
      "title": "East Asian Languages and Cultures",
      "link": "https://ealc.berkeley.edu"
    },
    {
      "title": "Asian American and Asian Diaspora Studies",
      "link": "https://aaads.berkeley.edu"
    },
    {
      "title": "Comparative Literature",
      "link": "https://complit.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/east-asian-humanities",
    "https://ealc.berkeley.edu/undergraduate/major",
    "https://www.berkeley.edu/catalog/current/majors/EastAsianHumanities.html"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits (including major requirements and breadth courses)",
  "additionalInformation": "Students must complete a minimum of 12 courses in the major, including language and elective courses. Upper division courses must be taken at Berkeley or through the UC Education Abroad Program."
}