{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Electrical Engineering and Computer Sciences & Business Administration (B.S. MET)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The EECS & Business Administration program is an undergraduate major that combines the technical rigor of the Electrical Engineering and Computer Sciences (EECS) major with a comprehensive business education. The program is designed for students who seek a strong foundation in engineering and technology, along with the skills and knowledge to succeed in today's business environment. The program includes coursework in EECS, business administration, and economics, as well as a range of electives that allow students to tailor their education to their interests and career goals.",
  "shortProgramDescription": "The EECS & Business Administration major at UC Berkeley combines technical expertise in electrical engineering and computer sciences with a comprehensive business education, preparing students for leadership roles at the intersection of technology and business.",
  "classHighlights": [
    "The lower division coursework includes programming, data structures, computer architecture, and discrete mathematics, providing a foundation in computer science and engineering principles.",
    "Upper division EECS coursework covers topics such as algorithms, computer systems, electronics, and electrical engineering, with electives allowing students to explore areas like AI, systems, and networks.",
    "Business administration coursework includes classes in financial and managerial accounting, marketing, finance, and organizational behavior, giving students a broad understanding of business functions and practices.",
    "Students also take courses in economics, including microeconomics, macroeconomics, and econometrics, to understand economic principles and their application to business and technology.",
    "The program includes a range of electives and specializations, allowing students to tailor their education to their interests and career goals, whether in technology, entrepreneurship, or management."
  ],
  "learningOutcomes": [
    "Apply technical knowledge in electrical engineering and computer sciences to solve complex problems.",
    "Understand business principles, including finance, marketing, and organizational behavior.",
    "Analyze economic data and understand economic principles.",
    "Communicate technical and business information effectively to diverse audiences.",
    "Integrate technical and business knowledge to address real-world challenges.",
    "Work collaboratively in teams to design, develop, and implement solutions."
  ],
  "similarPrograms": [
    {
      "title": "Electrical Engineering and Computer Sciences (B.S.)",
      "link": "https://eecs.berkeley.edu"
    },
    {
      "title": "Business Administration (B.S.)",
      "link": "https://haas.berkeley.edu/undergraduate/programs/bsba.html"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/electrical-engineering-computer-sciences-business-administration",
    "https://eecs.berkeley.edu",
    "https://haas.berkeley.edu/undergraduate/programs/bsba.html"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of approximately 128-136 semester units, including major requirements, breadth requirements, and electives.",
  "additionalInformation": "The program is designed for students who are interested in pursuing careers at the intersection of technology and business. Students are advised to work closely with their academic advisors to ensure they meet all major requirements and prepare for their chosen career path."
}