{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Electrical Engineering & Computer Sciences (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Electrical Engineering and Computer Sciences (EECS) department offers a Bachelor of Science degree that provides a foundation in the fundamental principles of electrical engineering and computer science. The program emphasizes the development of skills in problem-solving, design, and analysis, as well as the ability to work effectively in teams. The curriculum includes a broad range of courses in electrical engineering and computer science, as well as a strong foundation in mathematics and physics.",
  "shortProgramDescription": "The EECS B.S. program at UC Berkeley provides a comprehensive education in electrical engineering and computer science, preparing students for a wide range of careers in industry, academia, and government.",
  "classHighlights": [
    "The lower division coursework includes introduction to programming in Python (CS 61A), data structures (CS 61B), and computer architecture and organization (CS 61C). Students also complete coursework in mathematics, including calculus and differential equations.",
    "Upper division coursework includes a range of required and elective courses in electrical engineering and computer science, such as computer systems and programming (CS 161), operating systems (CS 162), and electronic circuits (EE 105).",
    "Students also complete a range of technical electives, allowing them to specialize in areas such as artificial intelligence, computer networks, or digital signal processing.",
    "The program also includes a laboratory component, where students gain hands-on experience with electrical engineering and computer science concepts.",
    "Students are also required to complete a breadth requirement, which includes coursework in areas such as mathematics, physics, and engineering economics."
  ],
  "learningOutcomes": [
    "Apply knowledge of mathematics, science, and engineering to solve complex problems in electrical engineering and computer science.",
    "Design and implement software and hardware systems to meet specific requirements.",
    "Analyze and interpret data to inform design and decision-making.",
    "Work effectively in teams to achieve common goals.",
    "Communicate complex technical information to both technical and non-technical audiences.",
    "Understand the social and ethical implications of technological advancements."
  ],
  "similarPrograms": [
    {
      "title": "Computer Science (B.S.)",
      "link": "https://www2.eecs.berkeley.edu/Programs/CS/"
    },
    {
      "title": "Electrical Engineering (B.S.)",
      "link": "https://ee.berkeley.edu/academics/undergraduate-programs"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/electrical-engineering-computer-sciences",
    "https://www.eecs.berkeley.edu/Programs/eecs",
    "https://www.berkeley.edu/catalog/departments/EECS"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester units",
  "additionalInformation": "The EECS program is accredited by the Engineering Accreditation Commission of ABET. Students are encouraged to participate in research and internship opportunities to gain practical experience."
}