{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Environmental Earth Science (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Environmental Earth Science major provides a foundation in the natural sciences, preparing students to understand and help manage the Earth's resources and environment. The program integrates coursework in earth sciences, ecology, biology, chemistry, and physics to address environmental issues. Students can pursue a range of topics, from the earth's physical systems to the impact of human activities on the environment.",
  "shortProgramDescription": "The Environmental Earth Science B.S. program at UC Berkeley equips students with a comprehensive understanding of earth systems and environmental issues, preparing them for careers or graduate study in environmental fields.",
  "classHighlights": [
    "Earth Systems and Processes: The program starts with foundational courses in Earth Sciences, including Introduction to Environmental Science (EPS C003), Physical Geology (EPS 001), and Earth Systems (EPS 010). These courses introduce students to the Earth's physical systems, geological processes, and the interactions between the Earth's lithosphere, atmosphere, hydrosphere, and biosphere.",
    "Chemistry and Physics: Students take a series of chemistry and physics courses, including General Chemistry (CHEM 1A/1B/1AL), University Chemistry (CHEM 3A/3B), and introductory physics courses (PHYSICS 7A/7B). These provide a fundamental understanding of chemical and physical principles underpinning earth and environmental systems.",
    "Biology and Ecology: The program includes coursework in biology and ecology, such as Introductory Biology (IB 1A/1B), Ecology and Evolutionary Biology (IB 160), and Environmental Earth Science (EPS 120, various other electives). These courses explore the interactions between organisms and their environments, ecological principles, and evolutionary processes.",
    "Environmental and Earth Science Electives: Students select from a range of electives focusing on environmental issues, earth sciences, and related fields. These may include courses on climate change, hydrology, geomorphology, and environmental policy, allowing students to tailor their education to specific interests.",
    "Field and Laboratory Work: The program includes field and laboratory components, where students engage in hands-on learning experiences. Courses like Field Methods in Geosciences (EPS 116) and Environmental Geochemistry (EPS 128) provide practical skills and the opportunity to apply theoretical knowledge in real-world settings.",
    "Quantitative Skills: Throughout the curriculum, students develop quantitative skills through courses that emphasize data analysis, mathematical modeling, and statistical techniques, preparing them to analyze and address environmental challenges."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of earth sciences and environmental systems",
    "Analyze the interactions between human activities and the Earth's physical and biological systems",
    "Apply scientific principles to understand and manage environmental issues",
    "Develop skills in data collection, analysis, and interpretation relevant to environmental science",
    "Communicate complex environmental and earth science concepts effectively",
    "Evaluate the impact of human activities on the environment and propose sustainable solutions"
  ],
  "similarPrograms": [
    {
      "title": "Earth and Planetary Science (B.A./B.S.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/earth-planetary-science"
    },
    {
      "title": "Environmental Economics and Policy (B.A.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/environmental-economic-policy"
    },
    {
      "title": "Environmental Sciences (B.S.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/environmental-sciences"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/environmental-earth-science",
    "https://eps.berkeley.edu/",
    "https://www.berkeley.edu/catalog/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits (approx. 180 units total, including major requirements, breadth, and electives)",
  "additionalInformation": "The major requires a set of foundational courses, followed by upper division coursework that includes laboratory and field components. Students are encouraged to gain research or field experience through internships, research projects, or field camps."
}