{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "French (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The French major at UC Berkeley is designed to give students a thorough grounding in the language, literature, and culture of France. The program includes a range of courses in French language, literature, and culture, as well as electives in related fields. Students develop their language skills through coursework and conversation sections, and explore the rich cultural heritage of France through literary and cultural studies. The major prepares students for careers in fields such as education, government, and international business, as well as for graduate study in French or related fields.",
  "shortProgramDescription": "The French major at UC Berkeley provides students with a deep understanding of the French language, literature, and culture, preparing them for diverse careers or further study.",
  "classHighlights": [
    "Language Courses: Students take a sequence of language courses (French 1A-1B, 3, 100A-100B) to develop their language skills, with conversation sections to improve speaking and listening abilities.",
    "Literary and Cultural Studies: The major includes a range of courses on French literature and culture, from the Middle Ages to the present, including courses on specific authors, periods, and genres.",
    "Electives: Students choose from a variety of electives, including courses on French cinema, culture, and history, as well as courses on related topics such as Francophone studies.",
    "Advanced Language and Culture: Upper-division courses focus on advanced language skills, literary analysis, and cultural studies, preparing students for graduate study or careers that require sophisticated language and cultural knowledge."
  ],
  "learningOutcomes": [
    "Demonstrate advanced proficiency in reading, writing, and speaking French.",
    "Analyze and interpret French literary and cultural texts.",
    "Understand the cultural and historical contexts of France and the Francophone world.",
    "Communicate effectively in French on a range of topics, including literature, culture, and current events.",
    "Apply their knowledge of French language and culture to diverse careers or further study."
  ],
  "similarPrograms": [
    {
      "title": "Italian Studies",
      "link": "https://italianstudies.berkeley.edu"
    },
    {
      "title": "Spanish and Portuguese",
      "link": "https://spanishport.berkeley.edu"
    },
    {
      "title": "Comparative Literature",
      "link": "https://complit.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/french",
    "https://french.berkeley.edu/undergraduate-studies",
    "https://www.berkeley.edu/catalog/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of 120 units required for the major, including language, literature, and culture courses; semester system",
  "additionalInformation": "Students are encouraged to study abroad in a French-speaking country to enhance their language skills and cultural knowledge. The major is flexible and can be tailored to individual interests and career goals."
}