{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Geology (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Bachelor of Arts degree in Geology is designed to provide a broad understanding of the Earth sciences, including the study of the Earth's physical structure, composition, and processes. The program includes coursework in geology, Earth systems, and the natural sciences, as well as opportunities for fieldwork and research.",
  "shortProgramDescription": "The Geology B.A. program at UC Berkeley provides a comprehensive education in Earth sciences, preparing students for careers or graduate study in fields such as environmental science, natural resources, and geosciences.",
  "classHighlights": [
    "Foundational courses in Geology introduce students to the Earth's physical structure, composition, and processes, including the study of minerals, rocks, and landforms.",
    "Earth Systems and Processes coursework explores the Earth's internal and external processes, including plate tectonics, earthquakes, and volcanic activity.",
    "Field and Laboratory Methods courses provide hands-on experience with geologic mapping, sampling, and laboratory analysis, including the use of specialized equipment and techniques.",
    "Geology Electives allow students to explore specialized topics, such as paleontology, geochemistry, and environmental geology, and to develop a deeper understanding of the Earth's systems and processes."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of geology, including the Earth's physical structure, composition, and processes.",
    "Apply geologic knowledge to real-world problems, including environmental and natural resource issues.",
    "Develop skills in geologic fieldwork, laboratory analysis, and data interpretation.",
    "Communicate geologic information effectively through written and oral presentations.",
    "Think critically and analytically about geologic data and processes."
  ],
  "similarPrograms": [
    {
      "title": "Geophysics",
      "link": "https://eps.berkeley.edu/undergrad/majors/geophysics"
    },
    {
      "title": "Earth and Planetary Science",
      "link": "https://eps.berkeley.edu/undergrad/majors/earth-planetary-science"
    },
    {
      "title": "Environmental Earth Science",
      "link": "https://eps.berkeley.edu/undergrad/majors/environmental-earth-science"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/geology",
    "https://eps.berkeley.edu/undergrad/majors/geology-ba",
    "https://www.berkeley.edu/catalog/departments/EPS.html"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The Geology B.A. program requires a minimum GPA of 2.0 in major coursework. Students are encouraged to participate in fieldwork and research opportunities, and to develop a strong foundation in the natural sciences."
}