{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "German (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of German offers a comprehensive program in German language, literature, and culture leading to a Bachelor of Arts degree. The program is designed to foster a deep understanding of German-speaking cultures, literary and cultural traditions, and to develop advanced language skills. Students explore a broad range of topics, including literary history, cultural studies, and linguistics, preparing them for careers in education, research, international business, law, and government, or for graduate study.",
  "shortProgramDescription": "The German B.A. program at UC Berkeley provides a rigorous education in German language, literature, and culture, preparing students for diverse careers or further study.",
  "classHighlights": [
    "The program begins with foundational courses in German language (German 1A-1B or 1A-1B-1C for beginners, and German 100A-100B for heritage speakers) and introduction to Germanic studies, providing a solid grounding in language and culture.",
    "Intermediate language courses (German 101A-101B) focus on developing advanced language skills through reading, writing, and conversation, complemented by courses on literature and culture.",
    "Upper-division courses cover a wide range of topics, including major literary periods and movements, cultural studies, and linguistics, allowing students to explore their interests and develop a deeper understanding of German-speaking cultures.",
    "Courses in literary history and cultural studies examine the historical and cultural contexts of German literature, from the Enlightenment to the present day, and explore the intersections between literature, culture, and society.",
    "The program also emphasizes the development of advanced language skills through courses that focus on composition, conversation, and translation, ensuring students achieve a high level of linguistic proficiency."
  ],
  "learningOutcomes": [
    "Demonstrate advanced proficiency in German language skills, including reading, writing, speaking, and listening.",
    "Analyze and interpret a wide range of German literary and cultural texts within their historical and cultural contexts.",
    "Understand the major literary and cultural movements and periods in German-speaking countries.",
    "Apply critical thinking and research skills to explore topics in German studies.",
    "Communicate effectively in German on a variety of cultural and literary topics.",
    "Develop a nuanced understanding of the cultural, historical, and social contexts of German-speaking cultures."
  ],
  "similarPrograms": [
    {
      "title": "Dutch Studies Minor",
      "link": "https://dutch.berkeley.edu/undergraduate-programs/dutch-studies-minor"
    },
    {
      "title": "Scandinavian Studies",
      "link": "https://scandinavian.berkeley.edu/undergraduate/degree-programs"
    },
    {
      "title": "Comparative Literature",
      "link": "https://complit.berkeley.edu/undergraduate/degree-programs"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/german",
    "https://german.berkeley.edu/undergraduate-program",
    "https://www.berkeley.edu/catalog/current/german-department"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits (total), including major requirements",
  "additionalInformation": "Students must declare the major through the College of Letters & Science. The program has specific GPA and course requirements. Study abroad opportunities are available and encouraged."
}