{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Industrial Engineering & Operations Research & Business Administration (B.S. MET)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Industrial Engineering & Operations Research & Business Administration program provides a broad-based education in engineering, operations research, and business administration to prepare students for leadership roles. The program combines coursework from the College of Engineering and the Haas School of Business to equip students with a strong foundation in engineering principles, analytical methods, and business practices.",
  "shortProgramDescription": "The B.S. MET program at UC Berkeley integrates industrial engineering, operations research, and business administration to prepare students for careers in management and leadership.",
  "classHighlights": [
    "The program requires foundational courses in Industrial Engineering & Operations Research, including IEOR 160 (Engineering Economics) and IEOR 162 (Operations Research), which cover engineering economics and operations research techniques.",
    "Students take core business courses from the Haas School of Business, including Business Administration 101 (Introduction to Financial and Managerial Accounting) and Business Administration 102 (Financial Management), focusing on accounting and financial management principles.",
    "Engineering coursework includes classes on probability and statistics, such as IEOR 161 (Introduction to Probability and Statistics for Engineers), and optimization methods, such as IEOR 162 (Operations Research).",
    "Additional business and management courses cover topics like marketing, organizational behavior, and leadership, providing a well-rounded business education.",
    "Electives allow students to explore specialized areas, including data analytics, supply chain management, and technology management."
  ],
  "learningOutcomes": [
    "Apply engineering and operations research principles to solve complex problems.",
    "Understand and apply business administration principles, including financial management and marketing.",
    "Analyze and interpret data to inform business decisions.",
    "Communicate effectively with technical and non-technical stakeholders.",
    "Demonstrate leadership and teamwork skills in a business or engineering context."
  ],
  "similarPrograms": [
    {
      "title": "Industrial Engineering & Operations Research",
      "link": "https://ieor.berkeley.edu"
    },
    {
      "title": "Business Administration",
      "link": "https://haas.berkeley.edu/undergraduate-program"
    },
    {
      "title": "Engineering Management",
      "link": "https://funginstitute.berkeley.edu/programs/engineering-management"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/industrial-engineering-operations-research-business-administration",
    "https://ieor.berkeley.edu",
    "https://haas.berkeley.edu/undergraduate-program"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120-125 semester units",
  "additionalInformation": "The program is highly selective and requires a supplemental application. Students must maintain a minimum GPA and complete specific coursework requirements."
}