{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Italian Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Italian Studies major at UC Berkeley is an interdisciplinary program that encompasses the study of Italian language, literature, culture, and history. Students explore the rich cultural heritage of Italy, from the medieval period to the present day, and develop a deep understanding of the Italian language and its nuances. The major is designed to foster critical thinking, analytical skills, and effective communication.",
  "shortProgramDescription": "The Italian Studies B.A. at UC Berkeley offers students a comprehensive understanding of Italian language, literature, and culture, preparing them for careers in fields such as education, diplomacy, and cultural management.",
  "classHighlights": [
    "Language Courses: Students develop proficiency in Italian through a sequence of language courses (Italian 1A, 1B, 100A, 100B, 100C) that focus on grammar, vocabulary, and conversation skills.",
    "Literature and Culture Courses: Students explore Italian literature and culture through courses (Italian 101, 102, 103, 104, 105) that cover topics such as Dante, Renaissance literature, and modern Italian literature.",
    "History and Cinema Courses: Students examine Italian history and cinema through courses (Italian 106, 107, 108) that cover topics such as Italian history, film studies, and cultural studies.",
    "Electives and Special Topics: Students choose from a range of electives and special topics courses (Italian 110, 111, 112, 113, 114) that allow them to explore specific areas of interest, such as Italian-American studies or Italian culture and society."
  ],
  "learningOutcomes": [
    "Demonstrate advanced proficiency in Italian language skills",
    "Analyze and interpret Italian literary and cultural texts",
    "Understand the historical and cultural context of Italy",
    "Communicate effectively in Italian, both written and spoken",
    "Apply critical thinking and analytical skills to Italian studies"
  ],
  "similarPrograms": [
    {
      "title": "French Studies",
      "link": "https://french.berkeley.edu/undergraduate"
    },
    {
      "title": "Spanish and Portuguese",
      "link": "https://spanish-portuguese.berkeley.edu/undergraduate"
    },
    {
      "title": "Classics",
      "link": "https://classics.berkeley.edu/undergraduate"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/italian-studies",
    "https://italian.berkeley.edu/undergraduate",
    "https://registrar.berkeley.edu/enrollment/class_schedule"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students are encouraged to study abroad in Italy to enhance their language skills and cultural understanding. The major is designed to be flexible, allowing students to pursue their interests and career goals."
}