{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Linguistics (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Linguistics major at UC Berkeley provides a comprehensive education in the scientific study of language, covering phonetics, phonology, morphology, syntax, semantics, and pragmatics. Students gain a deep understanding of the structure, acquisition, and use of language, as well as its role in society.",
  "shortProgramDescription": "The Linguistics B.A. at UC Berkeley covers the scientific study of language structure, acquisition, and use, preparing students for careers or further study in linguistics and related fields.",
  "classHighlights": [
    "The Linguistics Department requires students to take a set of core courses, including Introduction to Linguistics (LING R1A), Introduction to Linguistic Analysis (LING 100), Phonetics and Phonology (LING 101A-B), Morphology (LING 102), and Syntax (LING 103).",
    "Students also take courses in linguistic subfields, such as Phonetics (LING 110), Phonological Analysis (LING 111), Morphological Analysis (LING 112), and Syntactic Analysis (LING 113).",
    "Additional courses cover areas like Semantics (LING 120), Pragmatics (LING 130), Sociolinguistics (LING 140), and Language Acquisition (LING 150), allowing students to explore diverse aspects of linguistics.",
    "Electives enable students to delve into specialized topics, such as Historical Linguistics (LING 160), Linguistic Typology (LING 170), and Computational Linguistics (LING 180)."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of linguistic theory and analysis.",
    "Analyze and describe the sound systems, grammatical structures, and meaning of languages.",
    "Recognize the role of language in social context and its variation across cultures.",
    "Apply linguistic knowledge to understand language acquisition, language change, and language use.",
    "Evaluate linguistic data and arguments critically."
  ],
  "similarPrograms": [
    {
      "title": "Cognitive Science",
      "link": "https://cogsci.berkeley.edu"
    },
    {
      "title": "Philosophy",
      "link": "https://philosophy.berkeley.edu"
    },
    {
      "title": "Anthropology",
      "link": "https://anthropology.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/linguistics",
    "https://linguistics.berkeley.edu",
    "https://www.berkeley.edu/catalog"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students must fulfill the University's general education requirements and complete a minimum of 120 units to graduate. The Linguistics major requires a minimum of 32 units in Linguistics courses."
}