{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Materials Science & Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The undergraduate program in Materials Science & Engineering provides students with a fundamental understanding of the structure, properties, and performance of materials. The program covers the full spectrum of materials, from metals and ceramics to polymers and biomaterials, and prepares students for careers in a wide range of industries, including aerospace, biotechnology, energy, and electronics. The curriculum includes coursework in mathematics, physics, and chemistry, as well as materials-specific courses in thermodynamics, kinetics, and materials characterization.",
  "shortProgramDescription": "The Materials Science & Engineering B.S. program at UC Berkeley provides a comprehensive education in the principles and applications of materials science, preparing students for careers in diverse industries.",
  "classHighlights": [
    "The program begins with foundational courses in mathematics, physics, and chemistry, including Calculus (MATH 1A-1B), Physics (PHYSICS 7A-7B), and Chemistry (CHEM 1A-1B).",
    "Core materials science and engineering courses cover topics such as thermodynamics, kinetics, and materials structure and properties, including Materials Science & Engineering (MAT SCI 45, 106, 108, 115).",
    "Students also take laboratory courses, including Materials Science & Engineering (MAT SCI 111, 112, 113), to gain hands-on experience with materials characterization and testing.",
    "Upper-division courses provide advanced knowledge in areas such as biomaterials, electronic materials, and nanostructured materials, including Materials Science & Engineering (MAT SCI 120, 131, 143).",
    "The program also includes elective courses that allow students to explore specialized topics and deepen their understanding of materials science and engineering."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles governing the structure, properties, and performance of materials.",
    "Apply knowledge of materials science and engineering to solve problems in a wide range of industries.",
    "Design and develop materials with specific properties and performance characteristics.",
    "Characterize and test materials using various techniques, including microscopy and spectroscopy.",
    "Communicate complex technical information effectively to diverse audiences."
  ],
  "similarPrograms": [
    {
      "title": "Chemical Engineering",
      "link": "https://ce.berkeley.edu/undergraduate/chemical-engineering"
    },
    {
      "title": "Mechanical Engineering",
      "link": "https://me.berkeley.edu/undergraduate"
    },
    {
      "title": "Nuclear Engineering",
      "link": "https://nuceng.berkeley.edu/undergraduate"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/materials-science-engineering",
    "https://materials.berkeley.edu/undergraduate",
    "https://www.berkeley.edu/catalog/current/major/mat_sci.html"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120-125 semester units",
  "additionalInformation": "The program is accredited by the Engineering Accreditation Commission of ABET. Students are encouraged to participate in research and internship opportunities to gain practical experience."
}