{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Molecular Environmental Biology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Molecular Environmental Biology major is an interdisciplinary program that combines the study of environmental science and molecular biology. Students in this major explore the interactions between organisms and their environment at the molecular level, with a focus on understanding and addressing environmental problems. The program is designed to provide a strong foundation in the biological, chemical, and physical sciences, as well as training in the molecular and cellular techniques used to study environmental systems.",
  "shortProgramDescription": "The Molecular Environmental Biology major prepares students to understand and address environmental problems at the molecular level, with a strong foundation in biology, chemistry, and physics.",
  "classHighlights": [
    "The Molecular Environmental Biology major requires a series of foundational courses in biology, chemistry, physics, and mathematics, including Biology 1A, 1B, Chemistry 1A, 1B, Physics 7A or 8A, and Math 1A and 1B. These courses provide a broad base of knowledge in the sciences and prepare students for more advanced coursework.",
    "Students take a series of upper-division courses that focus on the molecular and cellular aspects of environmental biology, including Molecular Environmental Biology 102, 103, and 110. These courses cover topics such as the molecular mechanisms underlying environmental responses, the use of molecular techniques in environmental research, and the impact of environmental factors on gene expression and organismal function.",
    "The major also includes a range of elective courses that allow students to explore specific areas of interest in more depth, such as ecology, evolution, conservation biology, and environmental policy. Students can choose from a variety of courses in departments such as Molecular and Cell Biology, Environmental Science, Policy, and Management, and Integrative Biology."
  ],
  "learningOutcomes": [
    "Understand the molecular and cellular mechanisms underlying environmental responses and interactions",
    "Apply molecular and cellular techniques to study environmental systems and problems",
    "Analyze the impact of environmental factors on gene expression and organismal function",
    "Evaluate the role of molecular and cellular processes in shaping ecosystem function and response to environmental change",
    "Communicate complex scientific information effectively to diverse audiences"
  ],
  "similarPrograms": [
    {
      "title": "Molecular and Cell Biology (B.S.)",
      "link": "https://mcb.berkeley.edu/undergraduate/our-programs/ugrad-mcb-major"
    },
    {
      "title": "Environmental Science, Policy, and Management (B.S.)",
      "link": "https://esp.berkeley.edu/undergraduate/our-programs/esp-bachelors"
    },
    {
      "title": "Conservation Biology (Minor)",
      "link": "https://our.environmentalprograms.berkeley.edu/programs/conservation-biology-minor"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/molecular-environmental-biology",
    "https://molecular-environmental-biology.berkeley.edu/",
    "https://mcb.berkeley.edu/undergraduate/our-programs/ugrad-mcb-major"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The Molecular Environmental Biology major is a highly interdisciplinary program that draws on coursework and faculty from a range of departments, including Molecular and Cell Biology, Environmental Science, Policy, and Management, and Integrative Biology. Students are encouraged to engage in research and internships to gain hands-on experience in the field."
}