{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Slavic Languages and Literatures (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Slavic Languages and Literatures offers a major in Slavic Languages and Literatures leading to a Bachelor of Arts degree. The major is designed to provide students with a comprehensive understanding of the literature, culture, and languages of Slavic countries, including Russia, Poland, and other countries in the region. The program includes coursework in language, literature, and culture, as well as electives in related fields.",
  "shortProgramDescription": "The Slavic Languages and Literatures major provides students with a deep understanding of Slavic cultures, languages, and literatures, preparing them for careers in fields such as academia, diplomacy, and international relations.",
  "classHighlights": [
    "Language courses: Students take language courses in Slavic languages, such as Russian, Polish, and Czech, to develop their language skills and gain a deeper understanding of the cultures they are studying.",
    "Literature and culture courses: The major includes coursework in Slavic literature and culture, covering topics such as 19th- and 20th-century Russian literature, Polish literature, and Slavic folklore.",
    "Electives: Students have the opportunity to take electives in related fields, such as history, linguistics, and cultural studies, to broaden their knowledge and gain a more nuanced understanding of the Slavic world."
  ],
  "learningOutcomes": [
    "Demonstrate proficiency in a Slavic language",
    "Analyze and interpret Slavic literary and cultural texts",
    "Understand the historical and cultural contexts of Slavic cultures",
    "Apply knowledge of Slavic cultures and languages to real-world problems",
    "Think critically and creatively about complex cultural and literary issues"
  ],
  "similarPrograms": [
    {
      "title": "Russian Language and Literature",
      "link": "https://slavic.berkeley.edu/undergraduate/russian-language-and-literature"
    },
    {
      "title": "Slavic Languages and Cultures Minor",
      "link": "https://slavic.berkeley.edu/undergraduate/slavic-languages-and-cultures-minor"
    },
    {
      "title": "Comparative Literature",
      "link": "https://comparative-literature.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/slavic-languages-literatures",
    "https://slavic.berkeley.edu/undergraduate/slavic-languages-and-literatures-major",
    "https://slavic.berkeley.edu/undergraduate/slavic-languages-and-cultures-minor"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students are encouraged to study abroad in a Slavic country to improve their language skills and gain a deeper understanding of the culture."
}