{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Urban Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Urban Studies major is an interdisciplinary program that examines the social, economic, and political processes shaping urban environments. It draws on a range of disciplines, including sociology, economics, geography, and political science, to understand the complex issues facing urban areas. Students in the major develop a critical understanding of the historical and contemporary forces that have shaped urban development and learn to analyze the impact of urban policies and programs. The major prepares students for careers in fields such as urban planning, policy analysis, community development, and research.",
  "shortProgramDescription": "The Urban Studies major provides students with a comprehensive understanding of the social, economic, and political dynamics of urban areas, preparing them for careers in urban planning, policy, and community development.",
  "classHighlights": [
    "Urban Studies Core: The major requires a set of core courses, including Introduction to Urban Studies (URBST 100), Urban Sociology (SOC 138), and Urban Politics (POL SCI 138), which provide a foundation in the key concepts and theories of urban studies.",
    "Urban Policy and Planning: Courses such as Urban Planning (URBST 141), Housing and Homelessness (SOC 146), and Urban Economic Development (URBST 143) examine the policies and programs that shape urban development and the impact of these policies on different communities.",
    "Urban Geography and Demography: Classes like Urban Geography (GEOG 138) and Urban Demography (DEMOG 172) explore the spatial patterns and demographic trends that shape urban areas, including issues of segregation, inequality, and environmental justice.",
    "Research Methods: Students learn research methods and data analysis techniques through courses like Research Methods in Urban Studies (URBST 191) and Quantitative Methods in Social Science (SOC 139), which enable them to critically evaluate and conduct research on urban issues."
  ],
  "learningOutcomes": [
    "Understand the historical and contemporary forces shaping urban development",
    "Analyze the social, economic, and political processes that shape urban environments",
    "Evaluate the impact of urban policies and programs on different communities",
    "Apply research methods and data analysis techniques to study urban issues",
    "Develop critical thinking and problem-solving skills to address complex urban challenges"
  ],
  "similarPrograms": [
    {
      "title": "City and Regional Planning",
      "link": "https://ced.berkeley.edu/academics/city-regional-planning/"
    },
    {
      "title": "Geography",
      "link": "https://geography.berkeley.edu"
    },
    {
      "title": "Sociology",
      "link": "https://sociology.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/urban-studies",
    "https://urbanstudies.berkeley.edu",
    "https://vcresearch.berkeley.edu/faculty-resources/urban-studies-major"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The Urban Studies major is an interdisciplinary program that draws on a range of departments, including sociology, economics, geography, and political science. Students are encouraged to pursue internships, research opportunities, and study abroad programs to enhance their understanding of urban issues and prepare for careers in the field."
}