{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Architecture (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Bachelor of Science in Architecture at MIT provides a comprehensive education in the field, focusing on the intersection of design, technology, and culture. The program emphasizes the development of skills in design, visualization, and communication, as well as an understanding of the social, cultural, and environmental contexts of architecture. Students engage with a range of subjects, including design studios, building technology, history and theory, and visual studies.",
  "shortProgramDescription": "MIT's Architecture B.S. program offers a rigorous education in architectural design, theory, and technology, preparing students for careers in architecture and related fields.",
  "classHighlights": [
    "The first-year design sequence introduces students to fundamental design principles and methods, with courses such as 4.101 Introduction to Design and 4.102 Architecture Studio. Students learn to think creatively and develop their skills in visual representation and communication.",
    "Building Technology courses, such as 4.440 Building Technology and 4.441 Building Systems, provide students with a deep understanding of the technical aspects of building design, including structures, materials, and environmental systems.",
    "History and Theory courses, including 4.601 History of Architecture I and 4.602 History of Architecture II, offer a comprehensive survey of architectural history and theory, exploring the social, cultural, and historical contexts of architecture.",
    "Visual Studies courses, such as 4.111 Visual Representation and 4.112 Visual Studies, focus on the development of skills in visual representation, including drawing, modeling, and digital media.",
    "Students also engage with elective courses in areas such as design, technology, and theory, allowing them to pursue their interests and develop their expertise."
  ],
  "learningOutcomes": [
    "Develop skills in architectural design, visualization, and communication.",
    "Understand the social, cultural, and environmental contexts of architecture.",
    "Apply knowledge of building technology, including structures, materials, and environmental systems.",
    "Analyze and interpret architectural history and theory.",
    "Develop skills in visual representation, including drawing, modeling, and digital media.",
    "Integrate knowledge from various subjects to produce well-rounded architectural designs."
  ],
  "similarPrograms": [
    {
      "title": "Major in Art and Design",
      "link": "https://catalog.mit.edu/schools/humanities-arts-social-sciences/art-design/"
    },
    {
      "title": "Minor in Art, Culture, and Technology",
      "link": "https://catalog.mit.edu/schools/humanities-arts-social-sciences/art-culture-technology-minor/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/architecture-course-4/",
    "https://architecture.mit.edu/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-192 units (MIT's unit system; typically requires 4-5 years to complete due to the program's intensity and requirements)",
  "additionalInformation": "The program is highly selective and requires a portfolio review for admission. Students must complete a series of required courses in design, technology, and theory, and are encouraged to engage with electives and other opportunities to broaden their education."
}