{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Artificial Intelligence and Decision Making (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Artificial Intelligence and Decision-Making major at MIT focuses on developing computational models, algorithms, and systems that enable machines to perceive, reason, and act intelligently. The program integrates coursework in artificial intelligence, decision theory, machine learning, and data science, preparing students to tackle complex problems and make informed decisions. Students explore the foundational principles and methodologies in AI, learn to apply AI techniques to real-world challenges, and develop a nuanced understanding of the societal implications of AI and decision-making systems.",
  "shortProgramDescription": "This major equips students with a deep understanding of AI principles, decision-making methodologies, and hands-on skills to develop intelligent systems that impact society.",
  "classHighlights": [
    "Core AI and Decision-Making Courses: Students take foundational courses like Introduction to Artificial Intelligence (6.034), Decision Theory (6.436), and Machine Learning (6.390), which provide a solid grounding in AI theory, probabilistic reasoning, and algorithmic learning methods.",
    "Mathematics and Computation Foundations: Subjects such as Calculus (18.01), Linear Algebra (18.06), and Probability and Statistics (6.041) supply the necessary mathematical underpinnings, while courses like Computation Structures (6.004) ensure a robust understanding of computational infrastructure.",
    "Data Science and Programming: Through subjects such as Introduction to Data Science (6.0002) and Programming with Python (6.0001), students acquire essential skills in data analysis, visualization, and programming, complemented by more advanced courses like Deep Learning (6.3902).",
    "Human-Centered AI and Ethics: Electives that explore human-centered AI, fairness, and ethics, allow students to investigate the broader societal implications of AI and decision-making systems, fostering a responsible approach to technology development.",
    "Advanced Electives: The curriculum offers a variety of advanced electives in specialized AI and decision-making areas, including AI for Robotics, Multi-Agent Systems, and AI for Healthcare, enabling students to dive deeper into their areas of interest."
  ],
  "learningOutcomes": [
    "Design, implement, and evaluate AI systems and decision-making models.",
    "Apply probabilistic reasoning, machine learning, and optimization techniques.",
    "Understand and critique the societal and ethical impacts of AI systems.",
    "Communicate complex AI concepts to both technical and non-technical audiences.",
    "Work effectively on multidisciplinary teams involving AI and decision-making challenges."
  ],
  "similarPrograms": [
    {
      "title": "Computer Science",
      "link": "https://catalog.mit.edu/departments/electrical-engineering-and-computer-science/computer-science/"
    },
    {
      "title": "Electrical Engineering and Computer Science",
      "link": "https://catalog.mit.edu/departments/electrical-engineering-and-computer-science/"
    },
    {
      "title": "Data Science and Systems",
      "link": "https://catalog.mit.edu/departments/electrical-engineering-and-computer-science/data-science-systems/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/artifical-intelligence-decision-making-course-6-4/",
    "https://www.eecs.mit.edu/",
    "https://www.csail.mit.edu/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of  180-192 units (MIT's unit system; 1 unit is roughly equivalent to 1 hour of work per week)",
  "additionalInformation": "This major requires a strong foundation in mathematics, programming, and data analysis, and involves both theoretical and project-based learning. It prepares students for diverse career paths, from AI and machine learning engineering to data science, policy-making, and research roles."
}