{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Chemistry and Biology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Chemistry and Biology major is designed for students who are interested in the overlap between the disciplines of Chemistry and Biology. This major provides a foundation in the core principles of both fields, with an emphasis on the chemical aspects of biological systems. Students take courses in inorganic and organic chemistry, biochemistry, and biology, as well as physics and mathematics.",
  "shortProgramDescription": "The Chemistry and Biology major at MIT provides a comprehensive education in both chemistry and biology, preparing students for careers in research, industry, or further study.",
  "classHighlights": [
    "Chemistry Core: Students complete a series of core chemistry courses, including Principles of Chemical Science I-II (5.111-112), Organic Chemistry I-II (5.12-13), and Biochemistry (5.07 or 7.05). These courses provide a foundation in the principles of chemistry, including bonding, reactivity, and thermodynamics.",
    "Biology Core: Students take a series of core biology courses, including Introduction to Biology I-II (7.012-013 or 7.014-015), Genetics and Molecular Biology (7.03), and Biochemistry (5.07 or 7.05). These courses provide a broad introduction to the principles of biology, including genetics, molecular biology, and biochemistry.",
    "Laboratory Courses: Students complete a series of laboratory courses, including Experimental Chemistry (5.311 or 5.310) and Laboratory in Molecular Biology and Biochemistry (7.08 or 5.08). These courses provide hands-on experience in laboratory techniques and experimental design.",
    "Mathematics and Physics: Students complete a series of mathematics and physics courses, including Calculus I-III (18.01-03) and Physics I-II (8.01-02). These courses provide a foundation in the mathematical and physical principles underlying chemistry and biology."
  ],
  "learningOutcomes": [
    "Apply the principles of chemistry and biology to understand complex biological systems",
    "Demonstrate a broad knowledge of the core principles of chemistry and biology",
    "Use laboratory techniques and experimental design to investigate biological systems",
    "Communicate scientific information effectively in written and oral form",
    "Analyze and interpret scientific data"
  ],
  "similarPrograms": [
    {
      "title": "Chemistry (B.S.)",
      "link": "https://catalog.mit.edu/degree-charts/chemistry-course-5-1/"
    },
    {
      "title": "Biology (B.S.)",
      "link": "https://catalog.mit.edu/degree-charts/biology-course-7/"
    },
    {
      "title": "Biological Engineering (B.S.)",
      "link": "https://catalog.mit.edu/degree-charts/biological-engineering-course-20/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/chemistry-biology-course-5-7/",
    "https://chemistry.mit.edu/undergraduate-program/",
    "https://biology.mit.edu/undergraduate-program/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of 180-186 units, with at least 66-72 units in chemistry and biology courses",
  "additionalInformation": "Students must complete a minimum of 14 units of laboratory work, and must satisfy the Institute's General Institute Requirements (GIRs)."
}