{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Computer Science, Economics, and Data Science (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "This program combines the fundamentals of computer science, economics, and data science to provide a comprehensive understanding of the field. Students learn to analyze complex systems, develop algorithms, and apply data-driven insights to real-world problems. The curriculum includes coursework in programming, data structures, algorithms, microeconomics, macroeconomics, and statistical modeling.",
  "shortProgramDescription": "The Computer Science, Economics, and Data Science B.S. program at MIT integrates core concepts from computer science, economics, and data science to equip students with analytical and technical skills.",
  "classHighlights": [
    "Core Computer Science: Students complete foundational courses in programming (6.0001, 6.0002), data structures (6.006), algorithms (6.006), and computer systems (6.004, 6.033), building a strong technical foundation.",
    "Economics Fundamentals: The program includes microeconomics (14.01, 14.121), macroeconomics (14.02, 14.122), and econometrics (14.32, 14.33), providing a thorough understanding of economic principles and methods.",
    "Data Science Foundations: Students learn statistical modeling (18.6501, 18.6502), probability (18.600, 6.436), and data analysis techniques, preparing them for careers in data-driven fields.",
    "Mathematics and Statistics: Required mathematics courses include calculus (18.01, 18.02, 18.03), linear algebra (18.06), and differential equations (18.03), while statistics coursework covers inference, regression, and machine learning models.",
    "Computational and Economic Theory: Advanced courses in algorithms (6.046, 6.854), computational theory (6.045, 6.840), and economic theory (14.126, 14.128) enable students to explore complex systems and models.",
    "Electives and Specializations: Students choose from a range of electives in computer science, economics, and data science, allowing them to tailor their education to their interests and career goals."
  ],
  "learningOutcomes": [
    "Analyze and solve complex problems using computational and economic models.",
    "Design and implement efficient algorithms and data structures.",
    "Apply statistical and machine learning techniques to data analysis.",
    "Understand microeconomic and macroeconomic principles and their applications.",
    "Communicate complex technical and economic concepts effectively.",
    "Evaluate the societal and ethical implications of data-driven technologies."
  ],
  "similarPrograms": [
    {
      "title": "Computer Science and Engineering (B.S.)",
      "link": "https://catalog.mit.edu/programs-courses/majors/computer-science-engineering/"
    },
    {
      "title": "Economics (B.S.)",
      "link": "https://catalog.mit.edu/programs-courses/majors/economics/"
    },
    {
      "title": "Data Science and Statistics (Minor)",
      "link": "https://catalog.mit.edu/programs-courses/minors/data-science-statistics/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/computer-science-economics-data-science-course-6-14/",
    "https://www.eecs.mit.edu/",
    "https://economics.mit.edu/undergraduate"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "At least 180-192 units (MIT unit system, roughly equivalent to credits in other institutions)",
  "additionalInformation": "Students must fulfill GIR requirements, complete departmental requirements, and maintain a satisfactory GPA. The program is highly interdisciplinary, combining coursework from multiple departments."
}