{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Electrical Engineering with Computing (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDegreeDescription": "This major is designed to provide a broad foundation in electrical engineering and computer science. Students take courses in circuits, electronics, signals and systems, and computing. The program emphasizes the development of problem-solving skills, both theoretical and practical.",
  "fullProgramDescription": "The Electrical Engineering with Computing major at MIT is designed to provide a broad foundation in electrical engineering and computer science. The program includes core courses in circuits, electronics, signals and systems, and computing, as well as a range of electives and advanced courses. Students develop problem-solving skills, both theoretical and practical, and are prepared for a wide range of careers in industry, research, and academia.",
  "shortProgramDescription": "The Electrical Engineering with Computing major provides a broad foundation in EE and CS, preparing students for diverse careers.",
  "classHighlights": [
    "Core electrical engineering courses include Circuits & Electronics (6.002), Signals & Systems (6.003), and Electromagnetism (8.02), providing a foundation in circuit analysis, signal processing, and electromagnetic principles.",
    "Computing courses include Introduction to Programming (6.0001), Data Structures (6.0002), and Computer System Architecture (6.823), covering programming fundamentals, data structures, and computer architecture.",
    "Mathematics and science requirements include Calculus I–III (18.01–03), Differential Equations (18.03), and Physics I–II (8.01–02), supporting the theoretical and analytical aspects of the major.",
    "Electives and advanced courses allow students to explore specialized areas, such as digital circuits, microprocessors, and machine learning, and to develop depth in their chosen field.",
    "Laboratory and project-based courses, such as Design and Fabrication of Microelectromechanical Devices (6.777J) and Circuits and Electronics Lab (6.002 Lab), provide hands-on experience and practical skills."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of electrical engineering and computer science to solve complex problems.",
    "Design, analyze, and implement electronic circuits and systems.",
    "Understand and apply concepts of signal processing, systems, and control.",
    "Develop software and algorithms for a range of applications.",
    "Work effectively in teams and communicate technical ideas clearly.",
    "Analyze and solve problems using mathematical and computational techniques."
  ],
  "similarPrograms": [
    {
      "title": "Electrical Engineering and Computer Science (B.S.)",
      "link": "https://catalog.mit.edu/degree-charts/electrical-engineering-computer-science-6-2/"
    },
    {
      "title": "Computer Science and Engineering (B.S.)",
      "link": "https://catalog.mit.edu/degree-charts/computer-science-engineering-6-7/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/electrical-engineering-computing-6-5/",
    "https://www.eecs.mit.edu/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of 180–186 units, with a minimum of 48 units in electrical engineering and computer science courses, as well as General Institute Requirements",
  "additionalInformation": "Students are expected to maintain a minimum GPA and complete specific GIR requirements. The major is administered by the Department of Electrical Engineering and Computer Science."
}