{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Aeronautics and Astronautics Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Department of Aeronautics and Astronautics (Course 16) offers a Bachelor of Science degree in Aeronautics and Astronautics. The program is designed to prepare students for a range of careers in the aerospace industry, government, and academia. The curriculum includes a strong foundation in mathematics, physics, and engineering principles, as well as specialized courses in aeronautics and astronautics. Students learn about aircraft and spacecraft design, aerodynamics, propulsion systems, and orbital mechanics, among other topics.",
  "shortProgramDescription": "MIT's Aeronautics and Astronautics B.S. program provides a comprehensive education in the principles and practices of aerospace engineering, preparing students for careers in industry, government, and research.",
  "classHighlights": [
    "Mathematics and Physics: Students take a sequence of calculus (18.01-18.03), differential equations (18.03), and physics (8.01-8.03) courses to build a strong foundation in mathematical and physical principles.",
    "Aerospace Fundamentals: Core courses in aeronautics and astronautics, such as Introduction to Aerospace Engineering (16.01), Aerodynamics (16.100), and Astronautics (16.02), introduce students to key concepts in aerospace engineering.",
    "Engineering and Design: Students learn about aircraft and spacecraft design, including structures, materials, and systems, through courses such as Aerospace Structures (16.20) and Aerospace Systems (16.04).",
    "Specialized Electives: Students choose from a range of specialized electives, including courses on propulsion systems, orbital mechanics, and aerospace systems engineering.",
    "Laboratory and Computational Courses: Students participate in laboratory and computational courses, such as Aerospace Measurements (16.682) and Computational Aerospace Engineering (16.910), to gain hands-on experience with aerospace systems and computational tools."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of mathematics, physics, and engineering to solve aerospace engineering problems",
    "Design and analyze aircraft and spacecraft systems, including structures, propulsion, and controls",
    "Understand and apply key concepts in aerodynamics, astrodynamics, and aerospace systems engineering",
    "Communicate complex ideas and results effectively through written and oral presentations",
    "Work effectively in teams to design and develop aerospace systems and solutions"
  ],
  "similarPrograms": [
    {
      "title": "Aerospace Engineering Minor",
      "link": "https://catalog.mit.edu/degree-charts/aerospace-minor/"
    },
    {
      "title": "Mechanical Engineering (B.S.)",
      "link": "https://catalog.mit.edu/degree-charts/mechanical-engineering-course-2/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/engineering-aeronautics-astronautics-course-16-eng",
    "https://aeroastro.mit.edu/undergraduate",
    "https://aeroastro.mit.edu/undergraduate/curriculum"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-186 units (semester credits)",
  "additionalInformation": "Students must complete a range of General Institute Requirements, including mathematics, physics, and humanities courses, in addition to the departmental requirements. The program is accredited by the Engineering Accreditation Commission of ABET."
}