{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Finance (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Finance major is designed to provide students with a comprehensive understanding of the financial system, financial markets, and financial instruments. The program covers the theoretical foundations of finance, as well as practical applications in areas such as investments, corporate finance, and financial institutions. Students learn to analyze financial data, manage risk, and make informed investment decisions.",
  "shortProgramDescription": "The Finance B.S. at MIT provides a rigorous education in financial theory, markets, and instruments, preparing students for careers in finance and related fields.",
  "classHighlights": [
    "Financial Theory and Markets: Students take core courses in financial theory, including Investments (15.401), Corporate Finance (15.402), and Financial Markets (15.415), which cover the principles of finance, investment analysis, and financial market structures.",
    "Mathematical and Computational Finance: Courses such as Financial Mathematics (15.433) and Computational Finance (15.451) provide a strong foundation in mathematical and computational techniques used in finance, including stochastic processes, derivatives pricing, and risk management.",
    "Financial Institutions and Policy: Electives like Financial Institutions (15.414) and Financial Policy (15.416) examine the role of financial institutions and regulatory policies in the financial system, covering topics such as banking, financial regulation, and monetary policy.",
    "Data Analysis and Research: Students learn to analyze financial data and conduct research using statistical and econometric techniques, as covered in courses like Financial Econometrics (15.445) and Financial Data Analysis (15.446).",
    "Electives and Specializations: The program allows students to choose from a range of electives, including topics like derivatives, fixed income securities, and international finance, enabling them to tailor their education to their interests and career goals."
  ],
  "learningOutcomes": [
    "Understand the theoretical foundations of finance and financial markets.",
    "Analyze financial data and make informed investment decisions.",
    "Apply mathematical and computational techniques to solve financial problems.",
    "Evaluate the role of financial institutions and regulatory policies in the financial system.",
    "Conduct research and analyze financial data using statistical and econometric techniques."
  ],
  "similarPrograms": [
    {
      "title": "Management",
      "link": "https://catalog.mit.edu/degree-charts/management-course-15-0/"
    },
    {
      "title": "Economics",
      "link": "https://catalog.mit.edu/degree-charts/economics-course-14/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/finance-course-15-3",
    "https://finance.mit.edu/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total units required for degree:  180-189 units ( varies depending on course choices)",
  "additionalInformation": "The Finance major is a limited enrollment program. Students must apply to the major and meet specific GPA and course requirements. Internships and research opportunities are available to provide practical experience."
}