{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "History (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The History Section at MIT offers a rigorous program that enables students to understand the past in all its complexity. Majors acquire skills in critical reading, argumentation, and historical interpretation, and develop a nuanced understanding of the ways in which historical narratives shape our understanding of the present and future.",
  "shortProgramDescription": "The History major at MIT provides students with a deep understanding of historical contexts and develops critical thinking, research, and writing skills.",
  "classHighlights": [
    "Students complete a minimum of 11 subjects (55-66 units) in History, including foundational subjects (21H. 100, 21H.161, 21H.162) that introduce the major themes and methods of historical study, and advanced subjects that allow students to explore specific historical periods, regions, and themes in depth.",
    "Electives in History include subjects on diverse topics such as the history of science and technology, global histories, and the history of specific regions, including Europe, Asia, and the Americas.",
    "Students also have the option to take subjects that integrate History with other disciplines, such as Literature, Anthropology, or Science, Technology, and Society.",
    "The major requires students to take at least one subject that focuses on historical methods and theories, helping them develop a sophisticated understanding of the discipline.",
    "Students are encouraged to explore subjects that reflect their interests and to develop a coherent course of study in consultation with their advisors."
  ],
  "learningOutcomes": [
    "Demonstrate a broad understanding of historical periods, themes, and regions.",
    "Analyze historical sources and interpret their significance.",
    "Develop and articulate historical arguments in written and oral form.",
    "Understand the complex ways in which historical narratives shape contemporary issues.",
    "Engage with diverse historical perspectives and methodologies."
  ],
  "similarPrograms": [
    {
      "title": "Anthropology",
      "link": "https://anthropology.mit.edu/undergraduate-program"
    },
    {
      "title": "Science, Technology, and Society",
      "link": "https://sts.mit.edu"
    },
    {
      "title": "Literature",
      "link": "https://lit.mit.edu"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/history-course-21h",
    "https://history.mit.edu/undergraduate/major"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "At least 11 subjects (55-66 units) in History, with flexibility in choosing electives and advanced subjects; total approximately 128-134 units for the degree",
  "additionalInformation": "Students are advised to declare the major by the end of the sophomore year and to work closely with advisors to plan their course of study."
}