{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Humanities and Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The program in Humanities and Engineering is designed for students who wish to combine the study of engineering with study in the humanities. The program leads to a Bachelor of Science degree. Students in this program develop a strong foundation in engineering, as well as a deep understanding of the humanities. The program is designed to be completed in four years.",
  "shortProgramDescription": "The Humanities and Engineering program at MIT prepares students for careers at the intersection of technology and society.",
  "classHighlights": [
    "Students take a set of foundational courses in engineering, including 18.01 Calculus, 8.01 Physics, and 6.0001 Introduction to Computer Science and Programming.",
    "In the humanities, students complete a minimum of seven subjects, including a minimum of two subjects in a single language other than English, one subject in literature or the arts, and one subject with a primary focus on history or social sciences.",
    "The engineering component includes a set of core subjects in the chosen department, such as Electrical Engineering and Computer Science, Mechanical Engineering, or Aeronautics and Astronautics.",
    "Students also complete a set of restricted electives in the humanities, which may include subjects such as literature, history, philosophy, or foreign languages.",
    "The program also includes a set of laboratory subjects, which provide hands-on experience with engineering principles and practices.",
    "Students have the flexibility to choose from a range of subjects to fulfill the program requirements, allowing them to tailor their education to their interests and career goals."
  ],
  "learningOutcomes": [
    "Demonstrate a strong foundation in engineering principles and practices.",
    "Develop a deep understanding of the humanities, including literature, history, philosophy, and foreign languages.",
    "Analyze complex issues at the intersection of technology and society.",
    "Communicate effectively in written and oral form.",
    "Apply engineering principles to real-world problems.",
    "Think critically and creatively about the social and cultural implications of technological advancements."
  ],
  "similarPrograms": [
    {
      "title": "Science, Technology, and Society",
      "link": "https://catalog.mit.edu/interdisciplinary/special-programs/science-technology-society/"
    },
    {
      "title": "Anthropology",
      "link": "https://anthropology.mit.edu/"
    },
    {
      "title": "History",
      "link": "https://history.mit.edu/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/humanities-engineering-course-21e",
    "https://shass.mit.edu/undergraduate/humanities-and-engineering"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "A minimum of 180 units, including at least 66 units in the humanities and at least 54 units in engineering.",
  "additionalInformation": "Students must declare a major in one of the participating engineering departments and complete the requirements for that department. The program is administered by the MIT School of Humanities, Arts, and Social Sciences."
}