{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Management (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramCourseDescription": "The Management major at MIT focuses on the study of organizations, management, and the global economy, with a strong foundation in analytical and quantitative methods. Students explore the complexities of organizational behavior and the dynamics of global business environments, preparing for leadership roles across industries.",
  "fullProgramDescription": "The undergraduate major in Management at MIT is designed to equip students with a deep understanding of how organizations function, the principles of management, and the dynamics of global economies. The program emphasizes analytical and quantitative approaches to management, including the study of organizational behavior, economic principles, and decision-making processes. Through a combination of core courses and electives, students gain the knowledge and skills necessary to navigate complex business environments and lead effectively in a rapidly changing world.",
  "shortProgramDescription": "MIT's Management B.S. provides a comprehensive education in organizational behavior, global economies, and analytical management, preparing students for diverse leadership roles.",
  "classHighlights": [
    "The major begins with foundational courses such as Principles of Microeconomics (14.01), Principles of Macroeconomics (14.02), and Introduction to Accounting (15.501/15.512), which provide a broad understanding of economic principles and financial reporting.",
    "Students then progress to core management courses including Organizational Processes (15.312/15.314), Strategic Management (15.904/15.906), and Operations Management (15.761/15.762), which cover organizational behavior, strategic decision-making, and operations management.",
    "Quantitative methods are emphasized through courses like Quantitative Methods for Management (15.066/15.068) and Statistics for Management (15.071/15.072), equipping students with analytical skills.",
    "The major also includes electives that allow students to explore specialized areas such as innovation, entrepreneurship, and global management, enabling them to tailor their education to their interests and career goals.",
    "Throughout the program, students are exposed to a range of teaching methods, including case studies, simulations, and team projects, which develop their problem-solving, leadership, and collaboration skills."
  ],
  "learningOutcomes": [
    "Analyze organizational behavior and dynamics within global business environments.",
    "Apply economic principles and quantitative methods to management decisions.",
    "Understand the fundamentals of financial reporting and accounting.",
    "Develop strategic management and leadership skills.",
    "Evaluate global market trends and their impact on businesses.",
    "Use data and analytics to inform management practices.",
    "Demonstrate an understanding of organizational processes and operations management."
  ],
  "similarPrograms": [
    {
      "title": "Economics",
      "link": "https://economics.mit.edu"
    },
    {
      "title": "Finance",
      "link": "https://finance.mitsloan.mit.edu"
    },
    {
      "title": "Sloan Fellows",
      "link": "https://mitsloan.mit.edu/graduate/fellows"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/management-course-15-1",
    "https://management.mit.edu/undergraduate",
    "https://mitsloan.mit.edu/undergraduate"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "At least 192 total units; includes General Institute Requirements, Major Requirements, and Electives.",
  "additionalInformation": "The Management major is highly interdisciplinary, drawing on economics, finance, and organizational studies. Students are encouraged to explore various electives to complement their core coursework."
}