{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Physics (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Physics Department offers a program leading to a Bachelor of Science degree in Physics. The program includes a core curriculum in classical mechanics, electromagnetism, quantum mechanics, and statistical mechanics, as well as advanced courses in specialized areas. Students are encouraged to participate in research projects and engage with the department's faculty.",
  "shortProgramDescription": "The Physics B.S. program at MIT provides a rigorous foundation in the principles of physics, preparing students for careers in research, academia, and industry.",
  "classHighlights": [
    "The physics core includes Classical Mechanics (8.01), Electricity and Magnetism (8.02), and Quantum Physics I-III (8.03, 8.04, 8.05), providing a thorough grounding in fundamental physics principles.",
    "Students take advanced courses in areas such as Statistical Mechanics (8.08 or 8.333), Computational Physics (8.223 or 8.333), and Experimental Physics (8.13-8.14 or 8.322).",
    "Electives allow students to explore specialized topics, including Condensed Matter Physics, Particle Physics, and Astrophysics, through courses like 8.321, 8.322, and 8.811-8.814.",
    "Mathematics requirements include Differential Equations (18.03 or 18.034), and Linear Algebra and Applications (18.06 or 18.700), supporting the theoretical aspects of physics.",
    "Additional requirements include Computational Methods (1-2 courses) and Laboratory work (e.g., Junior Lab: 8.13-8.14 or 8.20).",
    "Students are also required to fulfill General Institute Requirements, which include courses in mathematics, chemistry, biology, and humanities."
  ],
  "learningOutcomes": [
    "Demonstrate a thorough understanding of the fundamental principles of physics, including classical mechanics, electromagnetism, quantum mechanics, and statistical mechanics.",
    "Apply mathematical and computational techniques to solve complex physics problems.",
    "Design and conduct experiments to test hypotheses and measure physical phenomena.",
    "Analyze and interpret data from experiments and simulations.",
    "Communicate complex physics concepts effectively in written and oral forms."
  ],
  "similarPrograms": [
    {
      "title": "Mathematics",
      "link": "https://catalog.mit.edu/degree-charts/mathematics-course-18/"
    },
    {
      "title": "Aerospace Engineering",
      "link": "https://catalog.mit.edu/degree-charts/aeronautics-astronautics-course-16/"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/physics-course-8/",
    "https://physics.mit.edu/undergraduate-program/",
    "https://physics.mit.edu/undergraduate-program/course-information/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total units required for degree: 180-192 units (includes GIRs and physics core/electives)",
  "additionalInformation": "Students are encouraged to engage in research projects, participate in internals, and explore the wide range of physics-related courses offered across departments. The department provides advising support to help students tailor their coursework and research experiences to their interests and career goals."
}