{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Urban Studies and Planning (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Department of Urban Studies and Planning offers an undergraduate major in Planning. This program provides a broad education in the theory, methods, and practice of urban planning, preparing students for careers in urban and regional planning, public policy, and related fields.",
  "shortProgramDescription": "The Planning major at MIT provides students with a comprehensive understanding of urban planning, equipping them for careers in planning, policy, and related fields.",
  "classHighlights": [
    "The program includes foundational courses in urban planning, such as 11.001 Introduction to Urban Planning and 11.002J Cities in the 21st Century, which introduce students to the field and its contemporary challenges.",
    "Students take courses in planning theory, methods, and analysis, including 11.203 Microeconomics for Planning and 11.220 Quantitative Methods for Planners, which provide a strong foundation in the analytical skills required for planning practice.",
    "Electives allow students to explore specialized areas such as urban design, transportation planning, housing, and community development, with courses like 11.304J Housing and Community Development and 11.309J Urban Design.",
    "Students also engage with the social, economic, and environmental contexts of planning through courses like 11.201J Environmental Justice and 11.243J Economics of Housing and Housing Policy.",
    "The program emphasizes experiential learning, with opportunities for students to work on real-world projects through courses like 11.380J Community Development Projects and 11.401J Urban Planning Practicum."
  ],
  "learningOutcomes": [
    "Understand the historical and contemporary contexts of urban planning and its relationship to social, economic, and environmental issues.",
    "Apply theoretical and analytical skills to planning problems, including data analysis and interpretation.",
    "Demonstrate knowledge of planning methods, including urban design, policy analysis, and community engagement.",
    "Communicate effectively with diverse stakeholders, including community members, policymakers, and professionals.",
    "Analyze the ethical and social justice implications of planning decisions."
  ],
  "similarPrograms": [
    {
      "title": "Urban Studies and Planning Minor",
      "link": "https://dusp.mit.edu/undergraduate/minor"
    },
    {
      "title": "Civil and Environmental Engineering",
      "link": "https://cee.mit.edu"
    },
    {
      "title": "Architecture",
      "link": "https://architecture.mit.edu"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/planning-course-11",
    "https://dusp.mit.edu/undergraduate/bachelor-science",
    "https://dusp.mit.edu"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-192 units (MIT's unit system; typically around 36-40 courses)",
  "additionalInformation": "Students must declare the major through the Department of Urban Studies and Planning. The program is highly interdisciplinary and encourages students to explore courses across MIT's departments and schools."
}