{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Political Science (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Political Science major at MIT is designed to provide students with a comprehensive understanding of the discipline, covering topics such as political theory, international relations, comparative politics, and American politics. The program emphasizes theoretical and empirical approaches, preparing students for a range of careers in government, law, academia, and other fields.",
  "shortProgramDescription": "The Political Science major at MIT provides a rigorous education in the field, emphasizing both theoretical foundations and empirical analysis.",
  "classHighlights": [
    "The core courses, including 17.20 Introduction to Political Science Research Methods and 17.21 Comparative Politics or 17.22 International Relations, provide a foundation in the discipline.",
    "Students choose from a range of elective courses, such as 17.30 Public Policy, 17.31 American Politics, and 17.50 Political Theory, to explore specific areas of interest.",
    "Upper-level courses, including 17.801 Quantitative Research Methods and 17.802 Advanced Research Methods, develop advanced research skills and theoretical knowledge."
  ],
  "learningOutcomes": [
    "Demonstrate a comprehensive understanding of the major subfields within political science.",
    "Apply theoretical and empirical approaches to analyze political phenomena.",
    "Conduct original research using appropriate methodologies.",
    "Evaluate and synthesize complex information from a variety of sources.",
    "Communicate effectively in written and oral forms."
  ],
  "similarPrograms": [
    {
      "title": "Economics",
      "link": "https://economics.mit.edu/undergraduate-program"
    },
    {
      "title": "Anthropology",
      "link": "https://anthropology.mit.edu/undergraduate"
    },
    {
      "title": "Sociology",
      "link": "https://shass.mit.edu/undergraduate/sociology"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/political-science-course-17",
    "https://shass.mit.edu/undergraduate/political-science"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "180-192 units (typically 4-5 courses per semester, semester system)",
  "additionalInformation": "Students must fulfill the General Institute Requirements and complete a minimum of 12 subjects in the Political Science major, with at least 9 at the 17.30 level or above."
}