{
  "collegeName": "Massachusetts Institute of Technology",
  "programType": "Major",
  "programName": "Theater Arts (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Theater Arts program at MIT is an interdisciplinary course of study that combines the study of theater and performance with the rigorous analysis and critical thinking of the liberal arts. Students explore the history, theory, and practice of theater, developing skills in performance, directing, playwriting, and design. The program emphasizes the connections between theater and other disciplines, including literature, history, and culture.",
  "shortProgramDescription": "MIT's Theater Arts B.S. program provides a comprehensive education in theater and performance, preparing students for careers in the arts and beyond.",
  "classHighlights": [
    "Theater and Performance History: Courses such as 21M.601 Introduction to Theater Arts and 21M.603 History of Theater examine the development of theater and performance practices across historical periods and cultures.",
    "Performance and Production: Students engage in hands-on performance and production experiences through subjects like 21M.600 Drama! and various performance-based subjects, developing skills in acting, directing, and stage management.",
    "Playwriting and Dramaturgy: Subjects like 21M.604 Playwriting and 21M.605 Dramaturgy introduce students to the craft of playwriting and the role of the dramaturg in the theatrical process.",
    "Theater Theory and Criticism: Courses such as 21M.606 Theater Theory and Criticism and 21M.607 Performance and Cultural Politics explore the theoretical and critical frameworks that underpin the study of theater and performance.",
    "Theater and Other Disciplines: The program encourages students to explore the connections between theater and other fields, such as literature, history, and culture, through subjects like 21M.608 Theater and Literature and 21M.609 Theater and Culture."
  ],
  "learningOutcomes": [
    "Analyze and interpret theatrical texts and performances",
    "Develop skills in performance, directing, playwriting, and design",
    "Understand the historical and cultural contexts of theater and performance",
    "Apply theoretical and critical frameworks to the study of theater and performance",
    "Communicate effectively about theater and performance through written and oral critique"
  ],
  "similarPrograms": [
    {
      "title": "Music (B.S.)",
      "link": "https://catalog.mit.edu/music/"
    },
    {
      "title": "Comparative Media Studies",
      "link": "https://comparativemedia.mit.edu"
    }
  ],
  "sources": [
    "https://catalog.mit.edu/degree-charts/theater-arts-course-21m-2/",
    "https://shass.mit.edu/undergraduate/theater-arts"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of  180-186 units (MIT unit system)",
  "additionalInformation": "The Theater Arts program is administered by the Music and Theater Arts Section within the MIT School of Humanities, Arts, and Social Sciences. Students are encouraged to explore the intersections between theater and other disciplines, and to take advantage of the Institute's resources and opportunities for performance and production."
}