{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Aerospace Engineering with a Specialization in Astrodynamics and Space Applications (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Aerospace Engineering with a Specialization in Astrodynamics and Space Applications major is designed to provide students with a strong foundation in aerospace engineering principles, with a focus on astrodynamics and space applications. The program includes coursework in mathematics, physics, and engineering, as well as specialized courses in astrodynamics, spacecraft design, and space systems engineering. Students will learn to apply mathematical and scientific principles to solve complex engineering problems, and will develop skills in design, analysis, and experimentation.",
  "shortProgramDescription": "The Aerospace Engineering with a Specialization in Astrodynamics and Space Applications major prepares students for careers in the aerospace industry, with a focus on astrodynamics and space applications.",
  "classHighlights": [
    "The program begins with foundational coursework in mathematics, including Calculus (MATH20A-B-C-D) and Differential Equations (MATH20D, MAE101A), as well as physics, including Mechanics (PHYS2A-B) and Electricity & Magnetism (PHYS2C-D).",
    "Students take core engineering courses, including Introduction to Aerospace Engineering (MAE1), Aerospace Engineering Fundamentals (MAE101C), Aerodynamics (MAE131A), and Aerospace Structures (MAE156A).",
    "The Astrodynamics and Space Applications specialization includes coursework in Orbital Mechanics (MAE180A), Spacecraft Design (MAE180B), and Space Systems Engineering (MAE180C), as well as electives in topics such as space mission design and astrodynamics.",
    "Students also complete laboratory courses, including Aerospace Engineering Laboratory (MAE106L) and Aerospace Systems Laboratory (MAE180L).",
    "The program includes a range of technical electives, allowing students to tailor their education to their interests and career goals."
  ],
  "learningOutcomes": [
    "Apply mathematical and scientific principles to solve complex aerospace engineering problems",
    "Design, analyze, and test aerospace systems, including spacecraft and launch vehicles",
    "Understand the principles of astrodynamics and space systems engineering",
    "Communicate technical information effectively, both orally and in writing",
    "Work effectively in teams to solve complex engineering problems"
  ],
  "similarPrograms": [
    {
      "title": "Aerospace Engineering (B.S.)",
      "link": "https://catalog.ucsd.edu/college-and-schools/engineering/department-of-mechanical-and-aerospace-engineering/undergraduate/aerospace-engineering-bs/"
    },
    {
      "title": "Mechanical Engineering (B.S.)",
      "link": "https://catalog.ucsd.edu/college-and-schools/engineering/department-of-mechanical-and-aerospace-engineering/undergraduate/mechanical-engineering-bs/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/MAE-ug.html",
    "https://mae.ucsd.edu/",
    "https://catalog.ucsd.edu/"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180-200 quarter units",
  "additionalInformation": "The program is accredited by the Engineering Accreditation Commission of ABET. Students are encouraged to participate in research and internship opportunities to gain practical experience."
}