{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Biochemistry (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Biochemistry major is designed to provide students with a broad and rigorous foundation in the fundamental principles underlying biochemistry, as well as to foster an understanding of the scientific process and the integration of knowledge from different scientific disciplines. The program includes a comprehensive curriculum that encompasses the study of the structure and function of biological macromolecules, metabolic pathways, and the biochemical basis of various physiological processes.",
  "shortProgramDescription": "The Biochemistry B.S. program provides a comprehensive education in the biochemical principles underlying biological processes, preparing students for careers or graduate study in biochemistry, molecular biology, or related fields.",
  "classHighlights": [
    "The Biochemistry major includes foundational courses in chemistry (CHEM6A-B-C), organic chemistry (CHEM41A-B-C), biochemistry (BIPN100 or CHEM114A-B), and molecular biology (BICD100). These courses provide a comprehensive understanding of the principles of biochemistry and the biochemical basis of various physiological processes.",
    "Students also take laboratory courses, such as CHEM43A-B and BIPN108 or CHEM114L, which provide hands-on experience in biochemical techniques and experimentation.",
    "The program also includes elective courses that allow students to explore advanced topics in biochemistry, such as biochemical pathways, molecular biology, and structural biology.",
    "Additional coursework in biology (BILD1-3), physics (PHYS1A-B-C or2A-B-C), and mathematics (MATH10A-B-C or20A-B-C) provides a well-rounded education in the sciences and prepares students for a variety of career paths or graduate study."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of biochemistry, including the structure and function of biological macromolecules and metabolic pathways.",
    "Apply biochemical principles to understand the biochemical basis of various physiological processes.",
    "Demonstrate laboratory skills in biochemical techniques and experimentation.",
    "Analyze and interpret data from biochemical experiments.",
    "Communicate complex biochemical concepts effectively in written and oral form."
  ],
  "similarPrograms": [
    {
      "title": "Chemistry (B.S.)",
      "link": "https://catalog.ucsd.edu/front/courses/chem-bs/"
    },
    {
      "title": "Biology (B.S.)",
      "link": "https://catalog.ucsd.edu/front/courses/biol-bs/"
    },
    {
      "title": "Molecular Biology (B.S.)",
      "link": "https://catalog.ucsd.edu/front/courses/molbi-bs/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/CHEM-ug.html",
    "https://catalog.ucsd.edu/front/courses/chem-biochem-bs/",
    "https://chemistry.ucsd.edu/undergraduate-program/majors/biochemistry-bs.html"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "total approx.180-200 quarter units; the major requires a minimum of65 upper-division units",
  "additionalInformation": "The Biochemistry major is offered by the Department of Chemistry and Biochemistry. Students must satisfy major requirements, including specific coursework and GPA thresholds. The major prepares students for careers or graduate study in biochemistry, molecular biology, or related fields."
}