{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Biological Anthropology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Biological Anthropology major at UC San Diego focuses on the study of human evolution, genetics, and biology. The program is designed to provide students with a comprehensive understanding of the biological and genetic aspects of human evolution, as well as the cultural and environmental factors that shape human biology. Students learn about the evolution of the human species, the biology of fossil humans, and the principles of genetics and genomics.",
  "shortProgramDescription": "The Biological Anthropology B.S. program at UC San Diego explores the biological, genetic, and evolutionary aspects of the human species.",
  "classHighlights": [
    "The core courses for the Biological Anthropology major include Introduction to Biological Anthropology (ANTHRO 1), Human Evolution (ANTHRO 102), and Genetics (BILD 3 or equivalent). These courses provide a foundation in the principles of biological anthropology and prepare students for more advanced coursework.",
    "Students also take courses in human osteology, primate behavior, and molecular anthropology, which provide a deeper understanding of human biology and evolution. These courses include Human Osteology (ANTHRO 104), Primate Behavior (ANTHRO 106), and Molecular Anthropology (ANTHRO 108).",
    "In addition to required courses, students choose from a range of electives that allow them to explore specific interests in biological anthropology, such as human genetics, forensic anthropology, and paleoanthropology. These electives include courses such as Human Genetics (BILD 120), Forensic Anthropology (ANTHRO 114), and Paleoanthropology (ANTHRO 116)."
  ],
  "learningOutcomes": [
    "Understand the principles of human evolution and the biology of the human species.",
    "Apply knowledge of genetics and genomics to understand human biology and evolution.",
    "Analyze and interpret data related to human evolution and biology.",
    "Demonstrate an understanding of the cultural and environmental factors that shape human biology.",
    "Communicate complex ideas related to biological anthropology effectively."
  ],
  "similarPrograms": [
    {
      "title": "Anthropology (B.A.)",
      "link": "https://catalog.ucsd.edu/anthro-ba"
    },
    {
      "title": "Biology (B.S.)",
      "link": "https://catalog.ucsd.edu/biology-bs"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/courses/ANTHRO.html",
    "https://catalog.ucsd.edu/undergraduate/arts-humanities/division-social-sciences/department-anthropology/biological-anthropology-bs"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "Students are advised to consult with the department advisor to plan their course schedule and ensure they meet the major requirements."
}