{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Critical Gender Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Critical Gender Studies major provides students with a comprehensive understanding of the complex ways in which gender intersects with other forms of identity and power. The program is interdisciplinary, drawing on fields such as sociology, anthropology, literature, and history. Students examine the social and cultural constructions of gender and the ways in which they shape individual and collective experiences. The major prepares students for a range of careers in fields such as education, social justice, and public policy, as well as for graduate study in related fields.",
  "shortProgramDescription": "The Critical Gender Studies major provides students with a comprehensive understanding of the complex ways in which gender intersects with other forms of identity and power.",
  "classHighlights": [
    "Core Courses: The major requires foundational courses such as Introduction to Critical Gender Studies (CGS 10), Theories of Gender and Sexuality (CGS 120), and Research Methods in Critical Gender Studies (CGS 101). These courses introduce students to key concepts, theories, and methodologies in the field.",
    "Electives: Students choose from a range of electives that explore topics such as intersectionality, queer theory, and global feminisms. Courses may include Gender and Sexuality in Anthropology (CGS/ANTH 130), Feminist Theory and Method (CGS/SOC 140), and Representation and Media (CGS/LIT 150).",
    "Upper-Division Courses: Students take upper-division courses that build on the foundational knowledge gained in the core courses. These courses may include Advanced Topics in Critical Gender Studies (CGS 190), Senior Seminar in Critical Gender Studies (CGS 195), and Special Topics in CGS (CGS 198).",
    "Thematic Clusters: The major is organized around thematic clusters, including: Gender and Sexuality; Intersectionality and Power; and Global Feminisms. Courses are distributed across these clusters, allowing students to explore different areas of interest."
  ],
  "learningOutcomes": [
    "Understand the social and cultural constructions of gender and their intersections with other forms of identity and power",
    "Apply key concepts, theories, and methodologies in Critical Gender Studies to analyze complex issues",
    "Evaluate the ways in which gender shapes individual and collective experiences",
    "Develop critical thinking and research skills in the field of Critical Gender Studies",
    "Communicate complex ideas and arguments effectively in written and oral forms"
  ],
  "similarPrograms": [
    {
      "title": "Sociology",
      "link": "https://catalog.ucsd.edu/courses/SOCI/"
    },
    {
      "title": "Ethnic Studies",
      "link": "https://catalog.ucsd.edu/courses/ETHN/"
    },
    {
      "title": "Comparative Literature",
      "link": "https://catalog.ucsd.edu/courses/LIT/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/programs/CGS/",
    "https://cgs.ucsd.edu/undergraduate/major/"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "48 upper-division units in Critical Gender Studies, plus additional major and general education requirements; total approx. 180 quarter units",
  "additionalInformation": "Students must meet with a department advisor to declare the major. The major requires a minimum GPA of 2.0 in major coursework. Students are encouraged to participate in internships, research projects, and other experiential learning opportunities."
}