{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Education Sciences (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Education Sciences major provides students with a broad understanding of the complex issues in education, including the social, cognitive, and cultural factors that influence teaching and learning. Students explore the interdisciplinary foundations of education, including the psychological, sociological, and historical contexts of educational institutions and practices. The major prepares students for a range of careers in education, research, policy, and related fields.",
  "shortProgramDescription": "The Education Sciences major at UC San Diego provides a comprehensive understanding of educational issues, preparing students for careers in education, research, and policy.",
  "classHighlights": [
    "The Education Sciences major requires foundational courses in education, including EDUC101: Introduction to Education Sciences, EDUC102: Research Methods in Education, and EDUC103: Statistical Analysis in Education. These courses provide a grounding in the theories, methods, and practices of education research.",
    "Students also complete a series of core courses that explore the social, cultural, and cognitive factors that influence teaching and learning, including EDUC104: Learning and Development, EDUC105: The Social Context of Education, and EDUC106: Education Policy.",
    "In addition to the core courses, students choose from a range of electives that allow them to explore specialized topics in education, such as special education, language acquisition, and educational technology.",
    "The major also includes a range of upper-division courses that provide advanced training in education research, theory, and practice, including EDUC110: Educational Research Design, EDUC120: Seminar in Education Sciences, and EDUC130: Capstone in Education Sciences is not included as per the prompt."
  ],
  "learningOutcomes": [
    "Understand the complex issues in education, including the social, cognitive, and cultural factors that influence teaching and learning.",
    "Apply research methods and statistical analysis to educational problems.",
    "Analyze the social, cultural, and historical contexts of educational institutions and practices.",
    "Evaluate education policies and programs.",
    "Design and implement education research studies."
  ],
  "similarPrograms": [
    {
      "title": "Psychology",
      "link": "https://catalog.ucsd.edu/front/courses-index/psychology/"
    },
    {
      "title": "Sociology",
      "link": "https://catalog.ucsd.edu/front/courses-index/sociology/"
    },
    {
      "title": "Cognitive Science",
      "link": "https://catalog.ucsd.edu/front/courses-index/cogsci/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/EDS-ug.html",
    "https://educationstudies.ucsd.edu/undergraduate-programs/education-sciences-bs.html"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "The Education Sciences major is offered through the Department of Education Studies. Students are advised to consult with department advisors to ensure timely completion of major requirements."
}