{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Environmental Systems (Earth Sciences) (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Environmental Systems Program is an interdisciplinary major that focuses on the interactions between human societies and the natural environment. Students in this major gain a broad understanding of environmental systems, including the Earth's physical and biological processes, and the impact of human activities on these systems. The program emphasizes the development of skills in data analysis, critical thinking, and problem-solving, preparing students for careers in fields such as environmental conservation, sustainability, and research.",
  "shortProgramDescription": "The Environmental Systems major at UC San Diego provides a comprehensive education in the Earth's physical and biological systems, emphasizing the impact of human activities and preparing students for careers in environmental fields.",
  "classHighlights": [
    "The major requires a foundation in natural sciences, including courses such as Introduction to Environmental Systems (ESP1), Earth's Systems (ESP30), and Environmental Chemistry (CHEM11/111).",
    "Students also complete coursework in Earth sciences, including Physical Geology (ESC1), Earth's Climate System (ESP104), and Geobiology (ESP108).",
    "Additional required courses cover topics such as ecology, conservation biology, and environmental policy, ensuring a well-rounded understanding of environmental systems and their management.",
    "Electives allow students to explore specialized topics, including climate change, sustainability, and environmental policy, enabling them to tailor their education to their interests and career goals.",
    "The major also includes a focus on quantitative skills, with courses in statistics, data analysis, and mathematical modeling, preparing students to analyze and address environmental issues.",
    "Upper-division courses provide advanced knowledge in areas such as environmental modeling, ecological restoration, and environmental governance.",
    "The program culminates in advanced coursework that integrates knowledge from across the major, preparing students for professional or graduate work."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of environmental systems, including the Earth's physical and biological processes.",
    "Analyze the impact of human activities on environmental systems.",
    "Apply quantitative skills, including data analysis and mathematical modeling, to environmental problems.",
    "Evaluate environmental issues from a multidisciplinary perspective, incorporating insights from natural and social sciences.",
    "Communicate effectively about environmental issues and solutions.",
    "Develop a comprehensive understanding of environmental policy and management practices."
  ],
  "similarPrograms": [
    {
      "title": "Environmental Science (B.S.)",
      "link": "https://catalog.ucsd.edu/main/programs/ENVIRONMENTAL-SCIENCE-PROGRAM/"
    },
    {
      "title": "Earth Sciences (B.S.)",
      "link": "https://catalog.ucsd.edu/main/programs/EARTH-SCIENCES-PROGRAM/"
    },
    {
      "title": "Ecology, Behavior, and Evolution (B.S.)",
      "link": "https://catalog.ucsd.edu/main/programs/ECOLOGY-BEHAVIOR-EVOLUTION-PROGRAM/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/ESP-ug.html",
    "https://envstudies.ucsd.edu/undergraduate/index.html"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180-190 quarter units",
  "additionalInformation": "The Environmental Systems major is offered by the Environmental Systems Program. Students are advised to consult with program advisors to plan their course sequence and ensure they meet major requirements. The major prepares students for a range of careers in environmental fields, including research, conservation, sustainability, and policy."
}