{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Environmental Anthropology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Environmental Anthropology major is an interdisciplinary program that examines the complex relationships between human societies and their environments. Students explore the cultural, social, and political dimensions of environmental issues, gaining a nuanced understanding of the ways in which human activities impact the natural world. The program emphasizes the importance of anthropological perspectives in addressing environmental challenges and promotes a holistic approach to understanding the intersections between human and environmental well-being.",
  "shortProgramDescription": "The Environmental Anthropology B.S. program at UC San Diego provides students with a comprehensive understanding of the cultural and social dimensions of environmental issues, preparing them for careers in sustainability, conservation, and environmental management.",
  "classHighlights": [
    "Core Courses: Students take foundational courses in anthropology, including ANTH101 (Introduction to Anthropology), ANTH102 (Cultural Anthropology), and ANTH104 (Environmental Anthropology). These courses introduce students to key concepts and theories in anthropology, setting the stage for more advanced study.",
    "Environmental Focus: Courses such as ANTH120 (Environmental Anthropology: Theory and Method) and ANTH121 (Environmental Justice) explore the cultural and social dimensions of environmental issues, examining the ways in which human activities impact the environment and the responses of different societies to environmental challenges.",
    "Research Methods: Students learn research methods and techniques through courses like ANTH104L (Environmental Anthropology Lab) and ANTH194 (Research Methods in Anthropology), gaining hands-on experience in designing and implementing research projects related to environmental anthropology.",
    "Electives and Specializations: The program offers a range of electives that allow students to tailor their studies to their interests, including courses on topics such as climate change, conservation, and sustainable development. Students can also pursue specializations in areas like environmental policy, ecological anthropology, or climate change adaptation."
  ],
  "learningOutcomes": [
    "Understand the complex relationships between human societies and their environments.",
    "Apply anthropological theories and methods to the study of environmental issues.",
    "Analyze the cultural, social, and political dimensions of environmental challenges.",
    "Develop research skills and techniques relevant to environmental anthropology.",
    "Communicate effectively about environmental issues and anthropological insights."
  ],
  "similarPrograms": [
    {
      "title": "Anthropology (B.A.)",
      "link": "https://catalog.ucsd.edu/programs/ANTH-BA/"
    },
    {
      "title": "Environmental Studies Minor",
      "link": "https://catalog.ucsd.edu/minors/ENV-minor/"
    },
    {
      "title": "Sustainability Minor",
      "link": "https://catalog.ucsd.edu/minors/SUST-minor/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/ANTH-ug.html",
    "https://anthropology.ucsd.edu/undergraduate/majors/env-anthro-bs.html"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "The Environmental Anthropology major is offered by the Department of Anthropology. Students are advised to consult with departmental advisors to plan their course of study and ensure they meet all major requirements."
}