{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Environmental Systems (Ecology, Behavior, & Evolution) (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Environmental Systems Program is an interdisciplinary major that focuses on the interactions between human and natural systems. The Ecology, Behavior, and Evolution track emphasizes the study of ecological principles, evolutionary processes, and the behavior of organisms. Students in this major gain a comprehensive understanding of environmental systems and develop skills in data analysis, critical thinking, and problem-solving.",
  "shortProgramDescription": "The Environmental Systems (Ecology, Behavior, & Evolution) B.S. provides a comprehensive education in ecological principles, evolutionary processes, and organismal behavior, preparing students for careers in research, conservation, and environmental management.",
  "classHighlights": [
    "Core courses in environmental systems, including ESPM 101, ESPM 102, and ESPM 103, provide a foundation in ecological principles, environmental policy, and conservation biology.",
    "Upper-division courses in ecology, evolution, and behavior, such as BILD 62, BILD 65, and ESPM 120, cover topics including population dynamics, community ecology, and evolutionary processes.",
    "Electives in specialized areas, such as ESPM 123, ESPM 134, and ESPM 161, allow students to explore topics like conservation biology, ecological modeling, and environmental policy.",
    "Methodology and quantitative skills are developed through courses like ESPM 104, ESPM 108, and ESPM 120, which cover data analysis, statistical modeling, and research design.",
    "The major also includes coursework in related fields, such as biology, chemistry, and earth sciences, to provide a broad understanding of environmental systems."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of ecology, evolution, and behavior.",
    "Analyze complex environmental systems and identify key factors influencing ecosystem dynamics.",
    "Apply quantitative methods and data analysis techniques to environmental problems.",
    "Communicate effectively about environmental issues and research findings.",
    "Develop a comprehensive understanding of the interactions between human and natural systems.",
    "Critically evaluate environmental policies and management strategies."
  ],
  "similarPrograms": [
    {
      "title": "Environmental Systems (Environmental Policy and Management) (B.A.)",
      "link": "https://catalog.ucsd.edu/ENV.html"
    },
    {
      "title": "Biology (B.S.)",
      "link": "https://catalog.ucsd.edu/SciBio.html"
    },
    {
      "title": "Earth Sciences (B.S.)",
      "link": "https://catalog.ucsd.edu/EarthSci.html"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/ENV.html",
    "https://envprog.ucsd.edu/"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "Students must complete a set of required courses in environmental systems, biology, and earth sciences, as well as upper-division coursework in ecology, evolution, and behavior. The major also includes electives and a capstone experience is not required but research opportunities are available."
}