{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Ethnic Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Ethnic Studies Department at UC San Diego offers an undergraduate major that provides students with a critical understanding of the histories, cultures, and experiences of communities of color in the United States. The major examines the intersections of race, ethnicity, class, gender, and sexuality, and their role in shaping social, cultural, and political institutions. Through a combination of core and elective courses, students develop critical thinking, research, and analytical skills, preparing them for a range of careers and graduate study.",
  "shortProgramDescription": "The Ethnic Studies major at UC San Diego provides students with a nuanced understanding of the experiences of communities of color and prepares them for careers and graduate study.",
  "classHighlights": [
    "Core courses introduce students to the foundational concepts and theories of Ethnic Studies, including the histories and cultures of African American, Asian American, Chicana/o/x, and Native American communities.",
    "Elective courses allow students to explore specific topics, such as identity, social justice, and cultural production, in greater depth, with courses like ETHN 100: Introduction to Ethnic Studies, ETHN 151: African American History, and ETHN 162: Asian American Communities.",
    "Upper-division courses, such as ETHN 163: Chicana/o/x History and ETHN 170: Native American Studies, provide advanced training in research and analysis, preparing students for senior-level work.",
    "Courses in the major emphasize critical thinking, writing, and research skills, with a focus on community engagement and social justice.",
    "The major includes a range of courses that explore the intersections of Ethnic Studies with other fields, such as history, sociology, literature, and cultural studies."
  ],
  "learningOutcomes": [
    "Analyze the complex histories and cultures of communities of color in the United States",
    "Understand the intersections of race, ethnicity, class, gender, and sexuality",
    "Apply critical thinking and research skills to understand social, cultural, and political institutions",
    "Develop effective writing and communication skills",
    "Engage in critical analysis of the role of power and inequality in shaping social and cultural institutions"
  ],
  "similarPrograms": [
    {
      "title": "Critical Gender Studies",
      "link": "https://criticalgenderstudies.ucsd.edu/"
    },
    {
      "title": "Sociology",
      "link": "https://sociology.ucsd.edu/"
    },
    {
      "title": "History",
      "link": "https://history.ucsd.edu/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu//front/courses-and-programs/undergraduate-programs/ethnic-studies-ba/",
    "https://ethnicstudies.ucsd.edu/"
  ],
  "programDuration": "4 years (quarter system, typically 12 quarters)",
  "creditRequirements": "180 quarter units (total), with at least 60 upper-division units, including major requirements",
  "additionalInformation": "Students must satisfy the UC San Diego major preparation requirements and complete the required courses for the major. The major is flexible, allowing students to pursue their interests through elective courses."
}