{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "German Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The German Studies major at UC San Diego is designed to provide students with a comprehensive understanding of the German language, literature, culture, and history. The program aims to develop students' language proficiency, analytical skills, and cultural competence, preparing them for careers in fields such as education, government, business, and international relations.",
  "shortProgramDescription": "The German Studies B.A. program at UC San Diego focuses on language, literature, and cultural studies, preparing students for diverse careers or further study.",
  "classHighlights": [
    "The major requires students to complete a series of language courses (GERM101-104) to develop their language skills.",
    "Students take core courses in German literature and culture, including GERM130 (Introduction to German Literature), GERM140 (German Culture and Civilization), and GERM150 (German Language and Culture).",
    "Upper-division courses cover a range of topics, including literary periods and movements, cultural history, and contemporary issues, such as GERM161-162 (Survey of German Literature) and GERM170 (Topics in German Culture).",
    "Electives allow students to explore specialized areas, including linguistics, film studies, and cultural studies, through courses like GERM180 (German Linguistics) and GERM190 (German Film).",
    "Students are also encouraged to take courses in related fields, such as history, philosophy, and comparative literature, to broaden their understanding of the German-speaking world."
  ],
  "learningOutcomes": [
    "Develop advanced language proficiency in reading, writing, speaking, and listening.",
    "Analyze and interpret German literary and cultural texts.",
    "Understand the historical and cultural contexts of the German-speaking world.",
    "Demonstrate knowledge of cultural and literary theories and apply them to the study of German culture.",
    "Communicate effectively in German and English about German language, literature, and culture."
  ],
  "similarPrograms": [
    {
      "title": "Dutch Studies Minor",
      "link": "https://catalog.ucsd.edu/linguistics-literature-culture/dutch-studies/minor/"
    },
    {
      "title": "Comparative Literature Major",
      "link": "https://catalog.ucsd.edu/linguistics-literature-culture/comparative-literature/major/"
    },
    {
      "title": "European Studies Minor",
      "link": "https://catalog.ucsd.edu/international-studies/european-studies/minor/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/LIT-g.html",
    "https://german.ucsd.edu/undergraduate/major.html"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system,4 years)",
  "creditRequirements": "48 upper-division units in German Studies, with a total of approximately180-200 quarter units required for graduation",
  "additionalInformation": "Students are encouraged to study abroad in a German-speaking country and participate in internships or research projects to enhance their language skills and cultural understanding."
}