{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Global Health (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Global Health major focuses on the health of populations in an increasingly interconnected world. The program is designed to provide a comprehensive grounding in the factors that affect global health, including social determinants, health systems, and global health governance. Students will gain an understanding of the complex relationships between health, development, and human rights, as well as the skills to analyze and address global health problems.",
  "shortProgramDescription": "The Global Health B.S. provides students with a comprehensive understanding of global health issues and the skills to address them.",
  "classHighlights": [
    "The Global Health major requires a foundation in the biological and social sciences, including courses in biology, chemistry, and social sciences. Students take introductory courses such as Global Health: Concepts and Perspectives (GLBH 20) and Epidemiology for Global Health (GLBH 141) to establish a solid understanding of global health principles.",
    "Students explore the social determinants of health and health systems through coursework in sociology, anthropology, and global health. Courses like Social Determinants of Health (GLBH 181) and Health Systems in Low- and Middle-Income Countries (GLBH 181B) enable students to analyze the complex factors affecting global health.",
    "Advanced courses in global health allow students to delve deeper into specific topics such as global health governance, human rights, and health equity. Students take upper-division courses like Global Health Governance (GLBH 184) and Culture, Health, and Illness (GLBH 162) to develop their knowledge and critical thinking skills.",
    "Electives in the major permit students to explore areas such as infectious diseases, non-communicable diseases, and health policy. Students may also engage in research or internship experiences to apply theoretical knowledge in practical settings.",
    "Throughout the major, students gain skills in critical thinking, problem-solving, and cultural competency, preparing them for careers in global health or further study."
  ],
  "learningOutcomes": [
    "Understand the complex factors affecting global health, including social determinants and health systems.",
    "Analyze global health problems from multiple perspectives, including biological, social, and economic.",
    "Apply knowledge of global health principles to real-world problems and develop effective solutions.",
    "Demonstrate cultural competency and an understanding of the social and cultural contexts of global health.",
    "Communicate effectively about global health issues and develop skills in critical thinking, problem-solving, and collaboration."
  ],
  "similarPrograms": [
    {
      "title": "Public Health",
      "link": "https://catalog.ucsd.edu/front/courses-and-programs/public-health-b-s-/"
    },
    {
      "title": "Health Sciences",
      "link": "https://jacobsschool.ucsd.edu/programs/health-sciences-bs"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/front/courses-and-programs/global-health-b-s-/",
    "https://globhealth.ucsd.edu/undergrad/major/Pages/default.aspx"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180-200 quarter units",
  "additionalInformation": "The Global Health major is a competitive program. Students must complete specific prerequisite courses and maintain a minimum GPA to be eligible for the major. Internship and research opportunities are available to provide practical experience in global health."
}