{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Linguistics (Specialization in Language and Society) (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Linguistics major with a Specialization in Language and Society is designed for students interested in the study of language as it relates to society. The program focuses on the structure, use, and social context of language, drawing on linguistics, anthropology, sociology, and other related disciplines. Students explore how language varies across cultures and social contexts, how it is used to construct identity and power dynamics, and how it is shaped by and shapes societal norms and institutions.",
  "shortProgramDescription": "The Linguistics (Specialization in Language and Society) B.A. program examines the complex relationships between language, culture, and society, preparing students for careers in fields such as education, social justice, and cultural critique.",
  "classHighlights": [
    "Students begin with foundational courses in linguistics, including Introduction to Linguistics (LING 100) and Phonetics and Phonology (LING 101), which introduce the scientific study of language structure and sound systems.",
    "The Language and Society specialization includes courses such as Sociolinguistics (LING 150), Language and Culture (LING 160), and Discourse Analysis (LING 170), which explore the social and cultural contexts of language use, variation, and change.",
    "Students also take courses in linguistic theory, including Syntax (LING 102) and Semantics (LING 103), which provide a deeper understanding of language structure and meaning.",
    "Electives allow students to explore related topics, such as language acquisition, language teaching, and language documentation, providing a comprehensive understanding of language in its social and cultural contexts.",
    "The program emphasizes the development of critical thinking, research, and analytical skills, preparing students for a range of careers or further study in linguistics or related fields."
  ],
  "learningOutcomes": [
    "Analyze language structures and use in social contexts.",
    "Understand the relationships between language, culture, and power.",
    "Apply linguistic theories and methods to real-world problems.",
    "Critically evaluate language use and language policies.",
    "Demonstrate proficiency in linguistic research and analysis.",
    "Communicate complex linguistic concepts effectively."
  ],
  "similarPrograms": [
    {
      "title": "Linguistics (B.A.)",
      "link": "https://catalog.ucsd.edu/courses/LING.html"
    },
    {
      "title": "Anthropology (B.A.)",
      "link": "https://catalog.ucsd.edu/courses/ANTH.html"
    },
    {
      "title": "Sociology (B.A.)",
      "link": "https://catalog.ucsd.edu/courses/SOCI.html"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/courses/LING.html",
    "https://linguistics.ucsd.edu/"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "Students must complete the major requirements as outlined in the departmental guidelines and maintain a satisfactory GPA. The program is designed to be completed within four years, with flexibility for transfer students and those with prior coursework in linguistics or related fields."
}