[
  {
    "name": "Astronomy & Astrophysics (B.A.)",
    "id": "astronomy-astrophysics-ba",
    "college": "Astronomy & Astrophysics",
    "description": "The Astronomy and Astrophysics major is designed to provide a broad and deep understanding of the field, including the underlying physics and mathematics that govern the behavior of celestial objects and the universe as a whole. Students in this major will gain a strong foundation in astronomy, physics, and mathematics, as well as computational skills and data analysis techniques."
  },
  {
    "name": "Astronomy & Astrophysics (B.S.)",
    "id": "astronomy-astrophysics-bs",
    "college": "Astronomy & Astrophysics",
    "description": "The Bachelor of Science degree in Astronomy and Astrophysics is designed to provide a broad background in physics and astronomy, as well as a more specialized understanding of modern astrophysics. The program includes required upper-division courses in classical mechanics, electricity and magnetism, quantum mechanics, and statistical mechanics, in addition to astronomy and astrophysics courses. Students learn about the formation and evolution of stars, galaxies, and the universe, as well as the observational and theoretical tools used in the field."
  },
  {
    "name": "Anthropology (Archaeology) (B.A.)",
    "id": "anthropology-archaeology-ba",
    "college": "Anthropology",
    "description": "The Anthropology major with a focus on Archaeology is designed to provide students with a comprehensive understanding of human culture and behavior through the study of material remains. The program emphasizes the development of critical thinking, research, and analytical skills. Students explore the cultural, social, and historical contexts of past societies, and learn about the theoretical and methodological approaches used in archaeological research."
  },
  {
    "name": "Anthropology (Biological Anthropology) (B.A.)",
    "id": "anthropology-biological-anthropology-ba",
    "college": "Anthropology",
    "description": "The Anthropology (Biological Anthropology) major provides a broad education in the field of anthropology, with a focus on the biological and biocultural aspects of human evolution, adaptation, and variation. The program emphasizes the integration of biological and cultural perspectives to understand human diversity and the human condition. Students learn about human evolution, genetics, and adaptation, as well as the cultural and social contexts of human biology."
  },
  {
    "name": "Anthropology (Sociocultural Anthropology) (B.A.)",
    "id": "anthropology-sociocultural-anthropology-ba",
    "college": "Anthropology",
    "description": "The Anthropology major with a focus on Sociocultural Anthropology provides students with a comprehensive understanding of human cultures and societies, past and present. Students explore the diversity of human experiences through ethnographic research, theoretical analysis, and critical thinking. The program emphasizes the development of skills in cultural analysis, research methods, and theoretical perspectives, preparing students for a wide range of careers or further study."
  },
  {
    "name": "Anthropology with a Concentration in Climate Change and Human Solutions (B.A.)",
    "id": "anthropology-with-a-concentration-in-climate-change-and-human-solutions-ba",
    "college": "Anthropology",
    "description": "The Anthropology Department at UC San Diego offers a Bachelor of Arts degree with a Concentration in Climate Change and Human Solutions. This program is designed to provide students with a comprehensive understanding of the complex relationships between human societies, cultures, and the environment, particularly in the context of climate change. Students explore the anthropological dimensions of climate change, including its impacts on human communities, cultures, and the environment, as well as the ways in which human societies have responded and adapted to environmental changes throughout history."
  },
  {
    "name": "Biological Anthropology (B.S.)",
    "id": "biological-anthropology-bs",
    "college": "Anthropology",
    "description": "The Biological Anthropology major at UC San Diego focuses on the study of human evolution, genetics, and biology. The program is designed to provide students with a comprehensive understanding of the biological and genetic aspects of human evolution, as well as the cultural and environmental factors that shape human biology. Students learn about the evolution of the human species, the biology of fossil humans, and the principles of genetics and genomics."
  },
  {
    "name": "Environmental Anthropology (B.S.)",
    "id": "environmental-anthropology-bs",
    "college": "Anthropology",
    "description": "The Environmental Anthropology major is an interdisciplinary program that examines the complex relationships between human societies and their environments. Students explore the cultural, social, and political dimensions of environmental issues, gaining a nuanced understanding of the ways in which human activities impact the natural world. The program emphasizes the importance of anthropological perspectives in addressing environmental challenges and promotes a holistic approach to understanding the intersections between human and environmental well-being."
  },
  {
    "name": "Bioengineering (B.S.)",
    "id": "bioengineering-bs",
    "college": "Bioengineering (BE)",
    "description": "The Bioengineering program at UC San Diego is an interdisciplinary major that combines engineering principles with biological sciences to develop innovative solutions for health and medicine. The program provides a foundation in engineering, mathematics, and physical sciences, as well as a deep understanding of biological systems. Students learn to apply engineering principles to medical and biological problems, preparing them for careers in industry, research, or graduate study."
  },
  {
    "name": "Bioengineering (Biotechnology) (B.S.)",
    "id": "bioengineering-biotechnology-bs",
    "college": "Bioengineering (BE)",
    "description": "The Bioengineering: Biotechnology major is designed to provide students with a comprehensive education in the application of engineering principles to the field of biotechnology. The program is highly interdisciplinary, combining coursework in biology, chemistry, physics, mathematics, and engineering to prepare students for careers in biotechnology and related fields."
  },
  {
    "name": "Bioengineering (Bioinformatics) (B.S.)",
    "id": "bioengineering-bioinformatics-bs",
    "college": "Bioengineering (BE)",
    "description": "The Bioengineering: Bioinformatics Program at UC San Diego is an interdisciplinary program that combines engineering, biology, and computer science to analyze and interpret biological data. The program is designed to provide students with a strong foundation in bioengineering, bioinformatics, and computational biology, as well as a broad-based education in the biological sciences, mathematics, and computer science."
  },
  {
    "name": "Bioengineering: BioSystems (B.S.)",
    "id": "bioengineering-biosystems-bs",
    "college": "Bioengineering (BE)",
    "description": "The Bioengineering: BioSystems program is designed to provide students with a comprehensive education in the principles of bioengineering, with a focus on the application of engineering principles to understand and manipulate complex biological systems. Students learn about the design, development, and implementation of biomedical devices, systems, and technologies, as well as the underlying biology and physiology. The program prepares students for careers in industry, academia, and research, as well as for graduate study in bioengineering or related fields."
  },
  {
    "name": "Black Diaspora and African American Studies (B.A.)",
    "id": "black-diaspora-and-african-american-studies-ba",
    "college": "Black Diaspora and African American Studies",
    "description": "The major in Black Diaspora and African American Studies is an interdisciplinary program that examines the experiences, histories, cultures, and social realities of Black people in the United States and throughout the Diaspora. The program is designed to provide students with a nuanced understanding of the complex and multifaceted nature of Black identities, cultures, and histories. Students in the program explore a range of topics, including the African Diaspora, African American history and culture, and the social, economic, and political contexts that shape the lives of Black people."
  },
  {
    "name": "Biochemistry (B.S.)",
    "id": "biochemistry-bs",
    "college": "Chemistry and Biochemistry",
    "description": "The Biochemistry major is designed to provide students with a broad and rigorous foundation in the fundamental principles underlying biochemistry, as well as to foster an understanding of the scientific process and the integration of knowledge from different scientific disciplines. The program includes a comprehensive curriculum that encompasses the study of the structure and function of biological macromolecules, metabolic pathways, and the biochemical basis of various physiological processes."
  },
  {
    "name": "Chemistry (B.S.)",
    "id": "chemistry-bs",
    "college": "Chemistry and Biochemistry",
    "description": "The Bachelor of Science in Chemistry is designed to provide a comprehensive understanding of the fundamental principles of chemistry. The program includes coursework in inorganic, organic, physical, and analytical chemistry, as well as laboratory research experiences. Students develop skills in data analysis, problem-solving, and scientific communication. The program prepares students for careers in research, industry, and education, as well as for graduate study in chemistry or related fields."
  },
  {
    "name": "Environmental Chemistry (B.S.)",
    "id": "environmental-chemistry-bs",
    "college": "Chemistry and Biochemistry",
    "description": "The Environmental Chemistry major is designed to provide students with a strong foundation in the chemical principles underlying environmental processes and the skills to analyze and address environmental issues. The program combines coursework in chemistry, biology, earth sciences, and environmental science to prepare students for careers in research, industry, government, and education."
  },
  {
    "name": "Molecular Synthesis (B.S.)",
    "id": "molecular-synthesis-bs",
    "college": "Chemistry and Biochemistry",
    "description": "The Molecular Synthesis major is designed to provide students with a comprehensive understanding of the principles of molecular synthesis, including the synthesis of complex molecules and the development of new synthetic methods. The program is designed to prepare students for careers in the pharmaceutical, biotechnology, and chemical industries, as well as for graduate study in chemistry or related fields."
  },
  {
    "name": "Pharmacological Chemistry (B.S.)",
    "id": "pharmacological-chemistry-bs",
    "college": "Chemistry and Biochemistry",
    "description": "The Pharmacological Chemistry major is designed for students who wish to pursue a career in the pharmaceutical industry or a related field. The program provides a strong foundation in chemistry, biochemistry, and pharmacology, as well as a comprehensive understanding of the principles and practices of pharmacological chemistry."
  },
  {
    "name": "Chinese Studies (B.A.)",
    "id": "chinese-studies-ba",
    "college": "Chinese Studies",
    "description": "The Chinese Studies major is designed to provide students with a comprehensive understanding of the Chinese language, culture, history, and society. The program includes coursework in Chinese language, literature, history, and culture, as well as electives in related fields such as Asian Studies and Comparative Literature."
  },
  {
    "name": "Cinematic Arts (B.A.)",
    "id": "cinematic-arts-ba",
    "college": "Cinematic Arts",
    "description": "The Cinematic Arts major provides students with a comprehensive understanding of the history, theory, and aesthetics of film and digital media. Students explore the creative, cultural, and industrial contexts of cinematic production, and develop critical thinking, writing, and research skills. The program emphasizes the analysis and interpretation of cinematic texts, as well as the social, cultural, and historical contexts in which they are produced and consumed."
  },
  {
    "name": "Classical Studies (B.A.)",
    "id": "classical-studies-ba",
    "college": "Classical Studies",
    "description": "The Classical Studies major at UC San Diego is an interdisciplinary program that focuses on the study of ancient Greek and Roman civilizations. The program encompasses a broad range of subjects, including language, literature, history, art, and archaeology. Students develop a deep understanding of the cultures of ancient Greece and Rome, exploring their contributions to modern Western society. The major is designed to cultivate critical thinking, analytical skills, and a nuanced understanding of the classical world."
  },
  {
    "name": "Cognitive Science (B.A.)",
    "id": "cognitive-science-ba",
    "college": "Cognitive Science",
    "description": "The Cognitive Science Department at UC San Diego offers an interdisciplinary undergraduate major that focuses on the study of the mind and intelligence. The major encompasses a broad range of topics including perception, cognition, and action, drawing from fields such as psychology, computer science, linguistics, philosophy, and neuroscience. Students explore the theoretical foundations and empirical methods used to understand human cognition and related processes."
  },
  {
    "name": "Cognitive Science (B.S.)",
    "id": "cognitive-science-bs",
    "college": "Cognitive Science",
    "description": "The Cognitive Science Department at UC San Diego offers an interdisciplinary program that focuses on the study of mind and intelligence. The undergraduate major provides a comprehensive education in the core areas of cognitive science, including perception, attention, memory, language, problem-solving, and reasoning. Students can choose from various elective courses to explore their interests in cognitive science."
  },
  {
    "name": "Cognitive Science with Specialization in Clinical Aspects of Cognition (B.S.)",
    "id": "cognitive-science-with-specialization-in-clinical-aspects-of-cognition-bs",
    "college": "Cognitive Science",
    "description": "The Cognitive Science with Specialization in Clinical Aspects of Cognition major is designed for students who are interested in the scientific study of cognition and its clinical applications. The program covers the cognitive processes underlying human behavior and the methods used to study these processes, with a focus on the clinical aspects of cognition. Students learn about the neural basis of cognition, cognitive development, and the cognitive processes involved in various neurological and psychiatric disorders."
  },
  {
    "name": "Cognitive Science with Specialization in Design and Interaction (B.S.)",
    "id": "cognitive-science-with-specialization-in-design-and-interaction-bs",
    "college": "Cognitive Science",
    "description": "The Cognitive Science with Specialization in Design and Interaction B.S. program is an interdisciplinary major that focuses on the design and evaluation of complex interactive systems, emphasizing human-centered design principles, user experience, and the cognitive science underlying human-technology interaction. Students learn about design principles, human-computer interaction, user research methods, and the cognitive and social factors that influence the design and use of interactive systems."
  },
  {
    "name": "Cognitive Science with Specialization in Language and Culture (B.S.)",
    "id": "cognitive-science-with-specialization-in-language-and-culture-bs",
    "college": "Cognitive Science",
    "description": "The Cognitive Science with Specialization in Language and Culture major is designed to provide students with a comprehensive understanding of the cognitive processes underlying human language and culture. The program is grounded in the cognitive science department's interdisciplinary approach, drawing from psychology, linguistics, anthropology, philosophy, and computer science. Students explore the complex interactions between language, culture, and cognition, and develop a nuanced understanding of the ways in which humans process and generate meaning."
  },
  {
    "name": "Cognitive Science with Specialization in Machine Learning and Neural Computation (B.S.)",
    "id": "cognitive-science-with-specialization-in-machine-learning-and-neural-computation-bs",
    "college": "Cognitive Science",
    "description": "The Cognitive Science with Specialization in Machine Learning and Neural Computation is an interdisciplinary major that focuses on the study of cognition, intelligence, and complex systems. Students learn about the computational models of cognition, neural networks, and machine learning. The program is designed to provide students with a strong foundation in cognitive science, computer science, and mathematics, preparing them for careers in research, industry, or graduate study."
  },
  {
    "name": "Cognitive Science with Specialization in Neuroscience (B.S.)",
    "id": "cognitive-science-with-specialization-in-neuroscience-bs",
    "college": "Cognitive Science",
    "description": "The Cognitive Science with Specialization in Neuroscience major is designed to provide students with a comprehensive understanding of the cognitive processes and their neural basis. The program combines coursework in cognitive science, neuroscience, and related fields to provide a foundation for a variety of careers or further study."
  },
  {
    "name": "Cognitive and Behavioral Neuroscience (B.S.)",
    "id": "cognitive-and-behavioral-neuroscience-bs",
    "college": "Cognitive Science",
    "description": "The Cognitive and Behavioral Neuroscience major is designed to provide students with a comprehensive understanding of the biological basis of behavior and cognition. The program combines coursework in cognitive science, neuroscience, and psychology to provide a strong foundation in the principles of cognition, perception, and behavioral neuroscience."
  },
  {
    "name": "Communication (B.A.)",
    "id": "communication-ba",
    "college": "Communication",
    "description": "The Communication major provides students with a broad understanding of communication theory and research methods, and allows them to specialize in one of the department's emphases. Students completing this major will be prepared for careers in fields related to human communication, including research, public relations, advertising, broadcasting, journalism, and human resources. The major provides broad training in the study of human communication, preparing students for graduate study or for careers in which an understanding of human communication is essential."
  },
  {
    "name": "Media Industries and Communication (B.A.)",
    "id": "media-industries-and-communication-ba",
    "college": "Communication",
    "description": "The Media Industries and Communication major is designed to provide students with a comprehensive understanding of the media industries, including the production, distribution, and reception of media content. The program focuses on the cultural, economic, and technological factors that shape the media landscape, and prepares students for careers in media and related fields."
  },
  {
    "name": "Computer Engineering (B.S.)",
    "id": "computer-engineering-bs",
    "college": "Computer Science and Engineering (CSE)",
    "description": "The Computer Engineering program at UC San Diego is offered by the Department of Computer Science and Engineering (CSE). The program provides a comprehensive education in the design, development, and testing of computer systems, including both hardware and software components. Students learn about the fundamentals of computer architecture, digital systems, and software engineering, as well as the integration of these components into complex systems."
  },
  {
    "name": "Computer Science (B.S.)",
    "id": "computer-science-bs",
    "college": "Computer Science and Engineering (CSE)",
    "description": "The Bachelor of Science in Computer Science is designed to provide students with a comprehensive education in the field of computer science, including the theory, design, and implementation of computer systems. The program prepares students for careers in industry, government, and academia, as well as for graduate study."
  },
  {
    "name": "Computer Science with Specialization in Bioinformatics (B.S.)",
    "id": "computer-science-with-specialization-in-bioinformatics-bs",
    "college": "Computer Science and Engineering (CSE)",
    "description": "The Computer Science with Specialization in Bioinformatics major is designed for students who wish to have a strong computer science foundation and understanding of bioinformatics. The program includes a comprehensive curriculum in computer science, mathematics, and bioinformatics, as well as a deep understanding of the application of computational techniques to biological problems."
  },
  {
    "name": "Critical Gender Studies (B.A.)",
    "id": "critical-gender-studies-ba",
    "college": "Critical Gender Studies",
    "description": "The Critical Gender Studies major provides students with a comprehensive understanding of the complex ways in which gender intersects with other forms of identity and power. The program is interdisciplinary, drawing on fields such as sociology, anthropology, literature, and history. Students examine the social and cultural constructions of gender and the ways in which they shape individual and collective experiences. The major prepares students for a range of careers in fields such as education, social justice, and public policy, as well as for graduate study in related fields."
  },
  {
    "name": "Data Science (B.S.)",
    "id": "data-science-bs",
    "college": "Data Science",
    "description": "The Data Science major provides a rigorous curriculum that prepares students for a career in data science. The program emphasizes the development of skills in data analysis, machine learning, and statistical modeling, as well as the ability to communicate complex data insights effectively. Students learn to work with large datasets, develop predictive models, and apply data science techniques to real-world problems."
  },
  {
    "name": "Business Economics (B.S.)",
    "id": "business-economics-bs",
    "college": "Economics",
    "description": "The Bachelor of Science in Business Economics is an interdisciplinary program that combines the rigor of an economics major with relevant business coursework to prepare students for careers in management, finance, marketing, and other business-related fields. The program emphasizes analytical, quantitative, and problem-solving skills, providing a comprehensive understanding of economic theory, business practices, and data analysis. Students learn to apply economic principles to business decision-making and gain a strong foundation in statistical methods, econometrics, and business applications."
  },
  {
    "name": "Economics (B.A.)",
    "id": "economics-ba",
    "college": "Economics",
    "description": "The Department of Economics offers a comprehensive undergraduate major leading to a Bachelor of Arts degree in Economics. The program is designed to provide students with a thorough understanding of economic theory, econometrics, and applied economics, as well as the opportunity to explore a range of specialized fields within the discipline. The major prepares students for a variety of careers in fields such as finance, government, and research, as well as for graduate study in economics and related fields."
  },
  {
    "name": "Economics (B.S.)",
    "id": "economics-bs",
    "college": "Economics",
    "description": "The Bachelor of Science in Economics provides students with a comprehensive understanding of economic theory, econometrics, and applied economics. The program emphasizes both theoretical foundations and empirical analysis, preparing students for careers in government, private sector, and graduate study."
  },
  {
    "name": "Economics and Mathematics - Joint Major (B.S.)",
    "id": "economics-and-mathematics-joint-major-bs",
    "college": "Economics",
    "description": "The Economics and Mathematics Joint Major program is designed for students who want to combine the analytical and problem-solving skills of mathematics with the economic theory and applications. The program provides a strong foundation in both fields, preparing students for careers in research, finance, government, and academia."
  },
  {
    "name": "Economics-Public Policy (B.A./MPP only)",
    "id": "economics-public-policy-ba-mpp-only",
    "college": "Economics",
    "description": "The Economics-Public Policy B.A./M.P.P. program is an accelerated, combined degree program that allows students to earn both a B.A. in Economics and an M.P.P. in five years. The program is designed for students who are interested in pursuing a career in public policy, economics, or a related field. Students in the program take a rigorous sequence of courses in economics, statistics, and public policy, and have the opportunity to specialize in a particular area of interest."
  },
  {
    "name": "Education Sciences (B.S.)",
    "id": "education-sciences-bs",
    "college": "Education Studies",
    "description": "The Education Sciences major provides students with a broad understanding of the complex issues in education, including the social, cognitive, and cultural factors that influence teaching and learning. Students explore the interdisciplinary foundations of education, including the psychological, sociological, and historical contexts of educational institutions and practices. The major prepares students for a range of careers in education, research, policy, and related fields."
  },
  {
    "name": "Computer Engineering (B.S.)",
    "id": "computer-engineering-bs",
    "college": "Electrical and Computer Engineering (ECE)",
    "description": "The Computer Engineering program at UC San Diego is offered by the Department of Computer Science and Engineering (CSE). The program provides a comprehensive education in the design, development, and testing of computer systems, including both hardware and software components. Students learn about the fundamentals of computer architecture, digital systems, and software engineering, as well as the integration of these components into complex systems."
  },
  {
    "name": "Electrical Engineering (B.S.)",
    "id": "electrical-engineering-bs",
    "college": "Electrical and Computer Engineering (ECE)",
    "description": "The Bachelor of Science degree in Electrical Engineering is offered by the Department of Electrical and Computer Engineering. The program provides a comprehensive foundation in electrical engineering, including circuit analysis, electronics, digital systems, computer architecture, signals and systems, and electromagnetic fields. Students gain hands-on experience through laboratory courses and electives, preparing them for a wide range of careers or graduate study."
  },
  {
    "name": "Electrical Engineering and Society (B.A.)",
    "id": "electrical-engineering-and-society-ba",
    "college": "Electrical and Computer Engineering (ECE)",
    "description": "The Electrical Engineering and Society major provides a broad education in electrical engineering and emphasizes the social context and implications of technology. The program is designed for students who want to combine a strong foundation in electrical engineering with a broader understanding of the social, economic, and cultural factors that shape technological development and use."
  },
  {
    "name": "Engineering Physics (B.S.)",
    "id": "engineering-physics-bs",
    "college": "Electrical and Computer Engineering (ECE)",
    "description": "The Bachelor of Science in Engineering Physics is offered by the Department of Electrical and Computer Engineering. The program is designed to provide a broad foundation in physics and engineering principles, as well as a strong background in mathematics and computational methods. The curriculum includes coursework in mechanics, electromagnetism, thermodynamics, and quantum mechanics, as well as courses in electrical and computer engineering."
  },
  {
    "name": "Environmental Systems (Earth Sciences) (B.S.)",
    "id": "environmental-systems-earth-sciences-bs",
    "college": "Environmental Systems Program",
    "description": "The Environmental Systems Program is an interdisciplinary major that focuses on the interactions between human societies and the natural environment. Students in this major gain a broad understanding of environmental systems, including the Earth's physical and biological processes, and the impact of human activities on these systems. The program emphasizes the development of skills in data analysis, critical thinking, and problem-solving, preparing students for careers in fields such as environmental conservation, sustainability, and research."
  },
  {
    "name": "Environmental Systems (Ecology, Behavior, & Evolution) (B.S.)",
    "id": "environmental-systems-ecology,-behavior,-evolution-bs",
    "college": "Environmental Systems Program",
    "description": "The Environmental Systems Program is an interdisciplinary major that focuses on the interactions between human and natural systems. The Ecology, Behavior, and Evolution track emphasizes the study of ecological principles, evolutionary processes, and the behavior of organisms. Students in this major gain a comprehensive understanding of environmental systems and develop skills in data analysis, critical thinking, and problem-solving."
  },
  {
    "name": "Environmental Systems (Environmental Chemistry) (B.S.)",
    "id": "environmental-systems-environmental-chemistry-bs",
    "college": "Environmental Systems Program",
    "description": "The Environmental Systems major is an interdisciplinary program that focuses on the natural sciences, social sciences, and humanities to understand the complex interactions within the environment and between human societies and the environment. The Environmental Chemistry subplan emphasizes the chemical aspects of environmental systems, including the impact of human activities on the environment and the application of chemical principles to understand and mitigate environmental problems."
  },
  {
    "name": "Environmental Systems (Environmental Policy) (B.A.)",
    "id": "environmental-systems-environmental-policy-ba",
    "college": "Environmental Systems Program",
    "description": "The Environmental Systems major is an interdisciplinary program that examines the complex interactions between human and natural systems. The Environmental Policy concentration focuses on the development, implementation, and impact of environmental policies. Students in this program gain a comprehensive understanding of the social, economic, and environmental dimensions of environmental issues."
  },
  {
    "name": "Ethnic Studies (B.A.)",
    "id": "ethnic-studies-ba",
    "college": "Ethnic Studies",
    "description": "The Ethnic Studies Department at UC San Diego offers an undergraduate major that provides students with a critical understanding of the histories, cultures, and experiences of communities of color in the United States. The major examines the intersections of race, ethnicity, class, gender, and sexuality, and their role in shaping social, cultural, and political institutions. Through a combination of core and elective courses, students develop critical thinking, research, and analytical skills, preparing them for a range of careers and graduate study."
  },
  {
    "name": "German Studies (B.A.)",
    "id": "german-studies-ba",
    "college": "German Studies",
    "description": "The German Studies major at UC San Diego is designed to provide students with a comprehensive understanding of the German language, literature, culture, and history. The program aims to develop students' language proficiency, analytical skills, and cultural competence, preparing them for careers in fields such as education, government, business, and international relations."
  },
  {
    "name": "Global Health (B.A.)",
    "id": "global-health-ba",
    "college": "Global Health",
    "description": "The Bachelor of Arts degree in Global Health provides a comprehensive education in the complex factors affecting health outcomes worldwide. Students explore the social, economic, and cultural determinants of health, as well as the policies and interventions designed to improve health equity. The program integrates coursework from multiple disciplines, preparing students for careers or further study in global health and related fields."
  },
  {
    "name": "Global Health (B.S.)",
    "id": "global-health-bs",
    "college": "Global Health",
    "description": "The Global Health major focuses on the health of populations in an increasingly interconnected world. The program is designed to provide a comprehensive grounding in the factors that affect global health, including social determinants, health systems, and global health governance. Students will gain an understanding of the complex relationships between health, development, and human rights, as well as the skills to analyze and address global health problems."
  },
  {
    "name": "Global South Studies (B.A.)",
    "id": "global-south-studies-ba",
    "college": "Global South Studies",
    "description": "The Global South Studies major is an interdisciplinary program that focuses on the cultures, histories, and societies of the Global South. The program provides students with a critical understanding of the complex processes that have shaped the modern world, including colonialism, imperialism, and globalization. Students examine the diverse experiences and perspectives of societies in Africa, Asia, Latin America, and the Middle East, and explore the ways in which these societies have been interconnected and shaped by global forces."
  },
  {
    "name": "Public Health (B.S.)",
    "id": "public-health-bs",
    "college": "Herbert Wertheim School of Public Health and Human Longevity Science",
    "description": "The Bachelor of Science in Public Health program at UC San Diego is designed to provide students with a comprehensive understanding of the factors that influence health outcomes and the skills to develop effective solutions to public health problems. The program is interdisciplinary, drawing on coursework from the Herbert Wertheim School of Public Health and Human Longevity Science, as well as other departments across the campus."
  },
  {
    "name": "Public Health with Concentration in Biostatistics (B.S.)",
    "id": "public-health-with-concentration-in-biostatistics-bs",
    "college": "Herbert Wertheim School of Public Health and Human Longevity Science",
    "description": "The B.S. in Public Health with a concentration in Biostatistics is an interdisciplinary program that provides students with a foundation in public health principles and biostatistical methods. The program prepares students for careers in health research, policy, and practice, with a strong emphasis on data analysis and statistical reasoning."
  },
  {
    "name": "Public Health with Concentration in Climate and Environmental Sciences (B.S.)",
    "id": "public-health-with-concentration-in-climate-and-environmental-sciences-bs",
    "college": "Herbert Wertheim School of Public Health and Human Longevity Science",
    "description": "The Bachelor of Science in Public Health with a concentration in Climate and Environmental Sciences is an interdisciplinary program that focuses on the impact of climate and environmental factors on public health. Students in this program will gain a comprehensive understanding of the complex relationships between environmental factors, climate change, and human health. The program is designed to prepare students for careers in research, policy, and practice, with a focus on addressing the health impacts of climate change and environmental degradation."
  },
  {
    "name": "Public Health with Concentration in Community Health Sciences (B.S.)",
    "id": "public-health-with-concentration-in-community-health-sciences-bs",
    "college": "Herbert Wertheim School of Public Health and Human Longevity Science",
    "description": "The Bachelor of Science in Public Health with a concentration in Community Health Sciences is designed to prepare students for careers in public health practice, research, or further education. The program focuses on the application of public health principles to community-based settings, emphasizing the understanding of health disparities, social determinants of health, and the development of interventions to promote health equity. Students learn about the social, environmental, and behavioral factors that influence health outcomes and develop skills in program planning, implementation, and evaluation."
  },
  {
    "name": "Public Health with Concentration in Epidemiology (B.S.)",
    "id": "public-health-with-concentration-in-epidemiology-bs",
    "college": "Herbert Wertheim School of Public Health and Human Longevity Science",
    "description": "The Bachelor of Science in Public Health with a concentration in Epidemiology is designed to provide students with a comprehensive understanding of the distribution and determinants of health-related events, diseases, or health-related characteristics among populations. The program focuses on the application of epidemiological principles to understand and address public health issues. Students learn to design, conduct, and analyze studies, as well as to interpret and apply research findings to inform public health practice and policy."
  },
  {
    "name": "Public Health with Concentration in Health Policy and Management Sciences (B.S.)",
    "id": "public-health-with-concentration-in-health-policy-and-management-sciences-bs",
    "college": "Herbert Wertheim School of Public Health and Human Longevity Science",
    "description": "The Bachelor of Science in Public Health with a concentration in Health Policy and Management Sciences is designed to prepare students for careers in health policy, health services management, and health care administration. The program focuses on understanding the organization, financing, and delivery of health services, as well as the social, economic, and political factors that influence health outcomes."
  },
  {
    "name": "Public Health with Concentration in Medicine Sciences (B.S.)",
    "id": "public-health-with-concentration-in-medicine-sciences-bs",
    "college": "Herbert Wertheim School of Public Health and Human Longevity Science",
    "description": "The Bachelor of Science in Public Health with a concentration in Medicine Sciences is designed to prepare students for careers in the healthcare industry, research, or graduate study. The program focuses on the application of public health principles to medical sciences, including the study of disease prevention, health promotion, and healthcare systems. Students gain a strong foundation in the biological and physical sciences, as well as coursework in public health, including epidemiology, health policy, and environmental health."
  },
  {
    "name": "History (B.A.)",
    "id": "history-ba",
    "college": "History",
    "description": "The History major at UC San Diego is designed to provide students with a broad understanding of the past, from the ancient world to the present day. Students develop critical thinking, research, and writing skills as they explore diverse historical topics and themes. The major emphasizes the importance of historical context, comparative analysis, and the development of historical narratives."
  },
  {
    "name": "Italian Studies (B.A.)",
    "id": "italian-studies-ba",
    "college": "Italian Studies",
    "description": "The Italian Studies major at UC San Diego is designed to provide students with a comprehensive understanding of the Italian language, literature, and culture. The program includes coursework in Italian language, literature, history, and culture, as well as electives that allow students to explore specific areas of interest. Students develop language proficiency, critical thinking, and analytical skills through a combination of language courses, literary and cultural studies, and historical context."
  },
  {
    "name": "Japanese Studies (B.A.)",
    "id": "japanese-studies-ba",
    "college": "Japanese Studies",
    "description": "The major in Japanese Studies is designed to provide students with a broad knowledge of Japanese language, culture, history, and society. The program includes a range of courses in the humanities and social sciences, as well as language training. Students develop a deep understanding of Japan's cultural heritage, its contemporary society, and its place in the world."
  },
  {
    "name": "Jewish Studies (B.A.)",
    "id": "jewish-studies-ba",
    "college": "Jewish Studies",
    "description": "The Jewish Studies Program is an interdisciplinary major that explores Jewish history, culture, and society from a variety of perspectives, including history, literature, religion, and sociology. Students examine the complexities of Jewish identity and experience, both in Israel and in the diaspora, and develop a nuanced understanding of the role of Jewish culture in the broader context of the Middle East and the world."
  },
  {
    "name": "Latin American Studies (B.A.)",
    "id": "latin-american-studies-ba",
    "college": "Latin American Studies",
    "description": "The Latin American Studies major is an interdisciplinary program that focuses on the cultures, histories, and societies of Latin America. The program provides students with a comprehensive understanding of the region, its languages, and its peoples. Students can choose from a variety of courses in departments such as Literature, History, Anthropology, and Political Science, among others."
  },
  {
    "name": "Latin American Studies with a Concentration in Mexico (B.A.)",
    "id": "latin-american-studies-with-a-concentration-in-mexico-ba",
    "college": "Latin American Studies",
    "description": "The Latin American Studies major with a concentration in Mexico is an interdisciplinary program that focuses on the history, culture, politics, and economies of Latin America, with a specific emphasis on Mexico. The program is designed to provide students with a comprehensive understanding of the region and its complexities, as well as the skills to analyze and interpret the social, cultural, and economic phenomena that shape the lives of individuals and communities in Latin America, particularly in Mexico."
  },
  {
    "name": "Latin American Studies with a Concentration in Migration and Border Studies (B.A.)",
    "id": "latin-american-studies-with-a-concentration-in-migration-and-border-studies-ba",
    "college": "Latin American Studies",
    "description": "The Latin American Studies major is an interdisciplinary program that focuses on the cultures, societies, and histories of Latin America and the Caribbean. The concentration in Migration and Border Studies examines the complex dynamics of human migration and the impact of borders on communities. Students explore the region through a variety of disciplinary lenses, including anthropology, history, literature, and sociology. The program prepares students for careers in fields related to Latin America and for graduate study."
  },
  {
    "name": "Linguistics (B.A.)",
    "id": "linguistics-ba",
    "college": "Linguistics",
    "description": "The Linguistics major at UC San Diego is designed to provide students with a comprehensive understanding of the fundamental principles of language structure, language use, and language acquisition. The program covers various subfields of linguistics, including phonetics, phonology, morphology, syntax, semantics, and pragmatics, as well as the social and psychological aspects of language. Students are trained in the scientific study of language, including data collection, analysis, and theoretical modeling."
  },
  {
    "name": "Linguistics (Specialization in Cognition and Language) (B.A.)",
    "id": "linguistics-specialization-in-cognition-and-language-ba",
    "college": "Linguistics",
    "description": "The Linguistics major with a Specialization in Cognition and Language is designed for students interested in the study of language as it relates to the mind. The program covers the core areas of linguistics, including phonetics, phonology, morphology, syntax, semantics, and pragmatics, as well as the cognitive aspects of language processing and acquisition."
  },
  {
    "name": "Linguistics (Specialization in Language and Society) (B.A.)",
    "id": "linguistics-specialization-in-language-and-society-ba",
    "college": "Linguistics",
    "description": "The Linguistics major with a Specialization in Language and Society is designed for students interested in the study of language as it relates to society. The program focuses on the structure, use, and social context of language, drawing on linguistics, anthropology, sociology, and other related disciplines. Students explore how language varies across cultures and social contexts, how it is used to construct identity and power dynamics, and how it is shaped by and shapes societal norms and institutions."
  },
  {
    "name": "Linguistics: Language Studies (Specialization in Individual Language) (B.A.)",
    "id": "linguistics-language-studies-specialization-in-individual-language-ba",
    "college": "Linguistics",
    "description": "The Linguistics major with a specialization in Individual Language is designed for students who wish to focus on the in-depth study of a specific language. The program covers the structure, syntax, and semantics of the chosen language, as well as its historical and cultural context. Students gain a deep understanding of linguistic theory and its application to the language of their choice."
  },
  {
    "name": "Linguistics (Specialization in Speech and Language Sciences) (B.A.)",
    "id": "linguistics-specialization-in-speech-and-language-sciences-ba",
    "college": "Linguistics",
    "description": "The Linguistics Department at UC San Diego offers a Bachelor of Arts degree in Linguistics with a specialization in Speech and Language Sciences. This program provides students with a comprehensive understanding of the scientific study of language, focusing on the sound structure, grammar, meaning, and use of language. Students explore the psychological and neurological aspects of language processing, language acquisition, and the physical properties of speech."
  },
  {
    "name": "Literary Arts (B.A.)",
    "id": "literary-arts-ba",
    "college": "Literature",
    "description": "The Literary Arts major is designed for students who are passionate about literature and want to explore the many facets of literary study. The program allows students to examine literary works from a variety of historical periods, cultures, and genres, and to develop their critical thinking, writing, and analytical skills."
  },
  {
    "name": "Literatures in English (B.A.)",
    "id": "literatures-in-english-ba",
    "college": "Literature",
    "description": "The Literatures in English major offers students a broad understanding of literary traditions in English, spanning multiple periods, genres, and cultural contexts. The program emphasizes critical analysis, close reading, and effective writing. Students explore a diverse range of texts, including works by authors from various backgrounds and historical periods. The major prepares students for a variety of careers, including education, writing, publishing, and law, as well as graduate study in English literature."
  },
  {
    "name": "Spanish Literature (B.A.)",
    "id": "spanish-literature-ba",
    "college": "Literature",
    "description": "The Spanish Literature major is designed to provide students with a comprehensive understanding of Spanish literature and culture from the Middle Ages to the present. The program emphasizes the development of critical thinking, writing, and analytical skills, as well as a nuanced understanding of the cultural and historical contexts that have shaped Spanish literature."
  },
  {
    "name": "World Literature and Culture (B.A.)",
    "id": "world-literature-and-culture-ba",
    "college": "Literature",
    "description": "The World Literature and Culture major is an interdisciplinary program that explores the literary and cultural production of diverse societies around the world. Students examine the historical, social, and cultural contexts that shape literary works and cultural practices, developing a nuanced understanding of the complex interactions between cultures and societies. The major prepares students for a wide range of careers in fields such education, publishing, international relations, and cultural management."
  },
  {
    "name": "Mathematical Biology (B.S.)",
    "id": "mathematical-biology-bs",
    "college": "Mathematics",
    "description": "The Mathematical Biology major is an interdisciplinary program that provides a foundation in the mathematical and biological sciences, as well as a broad understanding of the application of mathematics to problems in biology and the life sciences. Students learn to analyze complex biological systems, develop mathematical models, and apply computational techniques to understand biological phenomena."
  },
  {
    "name": "Mathematics (Applied) (B.S.)",
    "id": "mathematics-applied-bs",
    "college": "Mathematics",
    "description": "The Bachelor of Science in Mathematics (Applied) is designed to provide students with a strong foundation in mathematical techniques, modeling, and computational methods, preparing them for careers in industry, government, or research. The program includes a broad range of courses in mathematics, including core topics such as differential equations, linear algebra, and probability, as well as specialized courses in applied mathematics. Students are also required to complete a minor or a secondary field of study. The program emphasizes the development of problem-solving skills, mathematical modeling, and computational techniques."
  },
  {
    "name": "Mathematics (B.S.)",
    "id": "mathematics-bs",
    "college": "Mathematics",
    "description": "The Mathematics B.S. program provides a rigorous foundation in mathematics, preparing students for graduate study or careers in industry, government, or education. The program includes coursework in calculus, linear algebra, differential equations, and real analysis, as well as elective courses in areas such as algebra, geometry, and topology."
  },
  {
    "name": "Mathematics and Economics - Joint Major (B.S.)",
    "id": "mathematics-and-economics-joint-major-bs",
    "college": "Mathematics",
    "description": "The Mathematics and Economics - Joint Major (B.S.) program is an interdisciplinary program offered by the Department of Mathematics. This program combines the study of mathematical theories and methods with the study of economic principles and practices. Students in this program develop a strong foundation in mathematical techniques, statistical analysis, and economic theory, preparing them for careers in fields such as finance, data analysis, and research."
  },
  {
    "name": "Mathematics - Applied Science (B.S.)",
    "id": "mathematics-applied-science-bs",
    "college": "Mathematics",
    "description": "The Bachelor of Science in Mathematics - Applied Science is designed to provide a strong foundation in mathematical techniques and scientific computing. Students learn to apply mathematical methods to solve problems in science, engineering, and other fields. The program emphasizes the development of problem-solving skills, mathematical modeling, and computational techniques."
  },
  {
    "name": "Mathematics - Computer Science (B.S.)",
    "id": "mathematics-computer-science-bs",
    "college": "Mathematics",
    "description": "The Mathematics-Computer Science program is designed for students who are interested in the overlap between mathematics and computer science, including algorithm design, computational complexity, and scientific computing. The program provides a strong foundation in both mathematics and computer science, preparing students for a variety of careers in industry, government, and academia, as well as for graduate study in either field."
  },
  {
    "name": "Mathematics - Secondary Education (B.A.)",
    "id": "mathematics-secondary-education-ba",
    "college": "Mathematics",
    "description": "The Mathematics - Secondary Education major is designed for students who wish to teach secondary mathematics. The program provides a comprehensive education in mathematics and prepares students for a teaching career. Students learn about mathematical concepts, problem-solving, and communication. The major includes coursework in mathematics, education, and preparation for the California teaching credential."
  },
  {
    "name": "Probability and Statistics (B.S.)",
    "id": "probability-and-statistics-bs",
    "college": "Mathematics",
    "description": "The Probability and Statistics major provides a foundation in mathematical and statistical theory, with training in data analysis, statistical modeling, and computational methods. Students develop skills in probability, statistical inference, and data science, preparing for careers in research, industry, government, or academia. The program is designed to provide a strong foundation for graduate study or a career in statistics and data science."
  },
  {
    "name": "Aerospace Engineering (B.S.)",
    "id": "aerospace-engineering-bs",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Aerospace Engineering program at UC San Diego is designed to provide students with a comprehensive education in the principles and practices of aerospace engineering. The curriculum encompasses a broad range of topics including aerodynamics, structural analysis, propulsion systems, and systems engineering. Students gain a strong foundation in mathematics, physics, and engineering sciences, as well as hands-on experience with design and testing. The program prepares graduates for careers in the aerospace industry, government agencies, and research institutions, as well as for further study at the graduate level."
  },
  {
    "name": "Aerospace Engineering (Aerothermodynamics) (B.S.)",
    "id": "aerospace-engineering-aerothermodynamics-bs",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Aerospace Engineering with a Specialization in Aerothermodynamics program at UC San Diego is designed to provide students with a comprehensive understanding of the principles and practices of aerospace engineering, with a focus on aerothermodynamics. The program covers the application of fundamental principles to the design and analysis of aerospace systems, including the behavior of gases at high temperatures and the interactions between aerospace vehicles and their surroundings."
  },
  {
    "name": "Aerospace Engineering (Astrodynamics and Space Applications) (B.S.)",
    "id": "aerospace-engineering-astrodynamics-and-space-applications-bs",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Aerospace Engineering with a Specialization in Astrodynamics and Space Applications major is designed to provide students with a strong foundation in aerospace engineering principles, with a focus on astrodynamics and space applications. The program includes coursework in mathematics, physics, and engineering, as well as specialized courses in astrodynamics, spacecraft design, and space systems engineering. Students will learn to apply mathematical and scientific principles to solve complex engineering problems, and will develop skills in design, analysis, and experimentation."
  },
  {
    "name": "Aerospace Engineering (Flight Dynamics and Controls) (B.S.)",
    "id": "aerospace-engineering-flight-dynamics-and-controls-bs",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Aerospace Engineering with a Specialization in Flight Dynamics and Controls program is designed to provide students with a comprehensive understanding of the principles and practices of aerospace engineering, with a focus on the dynamics and control of flight vehicles. The program includes coursework in mathematics, physics, and engineering, as well as specialized courses in aerospace engineering, flight dynamics, and controls."
  },
  {
    "name": "Mechanical Engineering (B.S.)",
    "id": "mechanical-engineering-bs",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Mechanical Engineering program is designed to provide students with a broad foundation in the principles of mechanical engineering, including the mechanics of solids and fluids, thermodynamics, heat transfer, and mechanical design. The program includes a strong emphasis on laboratory work, computational methods, and design, as well as a range of technical electives that allow students to pursue their individual interests."
  },
  {
    "name": "Mechanical Engineering with a Specialization in Controls and Robotics (B.S.)",
    "id": "mechanical-engineering-with-a-specialization-in-controls-and-robotics-bs",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Mechanical Engineering with a Specialization in Controls and Robotics program is designed to provide students with a comprehensive understanding of mechanical engineering principles, with a focus on control systems and robotics. The program includes coursework in mechanics, thermodynamics, materials science, and electrical engineering, as well as specialized courses in controls, robotics, and mechatronics. Students learn to analyze and design complex systems, and develop skills in programming, problem-solving, and collaboration."
  },
  {
    "name": "Mechanical Engineering with a Specialization in Fluid Mechanics and Thermal Systems (B.S.)",
    "id": "mechanical-engineering-with-a-specialization-in-fluid-mechanics-and-thermal-systems-bs",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Mechanical Engineering with a Specialization in Fluid Mechanics and Thermal Systems program at UC San Diego is designed to provide students with a comprehensive education in mechanical engineering, with a focus on fluid mechanics and thermal systems. The program covers topics such as thermodynamics, fluid mechanics, heat transfer, and mechanical systems, preparing students for careers in industries related to energy, aerospace, and more."
  },
  {
    "name": "Mechanical Engineering with a Specialization in Materials Science and Engineering (B.S.)",
    "id": "mechanical-engineering-with-a-specialization-in-materials-science-and-engineering-bs",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Mechanical Engineering with a Specialization in Materials Science and Engineering major is designed to provide students with a comprehensive education in mechanical engineering with a focus on the properties, applications, and processing of materials. The program includes coursework in mechanics, thermodynamics, materials science, and engineering design, as well as laboratory and computational experiences."
  },
  {
    "name": "Mechanical Engineering with a Specialization in Mechanics of Materials (B.S.)",
    "id": "mechanical-engineering-with-a-specialization-in-mechanics-of-materials-bs",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Mechanical Engineering with a Specialization in Mechanics of Materials program provides students with a foundation in the fundamental principles of mechanical engineering, with a focus on the behavior of materials under various types of loading. The program covers topics such as mechanics, thermodynamics, materials science, and mechanical design, with an emphasis on the mechanics of materials."
  },
  {
    "name": "Mechanical Engineering with a Specialization in Renewable Energy and Environmental Flows (B.S.)",
    "id": "mechanical-engineering-with-a-specialization-in-renewable-energy-and-environmental-flows-bs",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "This program is designed to provide students with a comprehensive understanding of mechanical engineering principles and their application to renewable energy and environmental flows. The curriculum includes coursework in fluid mechanics, thermodynamics, and mechanical systems, as well as specialized courses in renewable energy and environmental flows."
  },
  {
    "name": "Music",
    "id": "music",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Department of Mechanical and Aerospace Engineering offers a comprehensive undergraduate program leading to a Bachelor of Science in Mechanical Engineering. The program includes coursework in mechanical systems, thermodynamics, fluid mechanics, materials science, and mathematics, as well as laboratory and design experiences."
  },
  {
    "name": "Music (B.A.)",
    "id": "music-ba",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Bachelor of Arts in Music at UC San Diego is designed to provide students with a comprehensive education in music theory, history, and performance practices, as well as the opportunity to explore various musical traditions and styles. The program emphasizes the development of critical thinking, creativity, and technical skills, preparing students for a wide range of careers in music and related fields."
  },
  {
    "name": "Interdisciplinary Computing and the Arts (B.A.)",
    "id": "interdisciplinary-computing-and-the-arts-ba",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Interdisciplinary Computing and the Arts major is designed for students who are interested in the intersection of computing and the arts. The program is interdisciplinary, drawing on courses from the Departments of Computer Science and Engineering, Music, Visual Arts, and others. Students in this major gain a strong foundation in computing, as well as a deep understanding of the arts and humanities."
  },
  {
    "name": "Music Humanities (B.A.)",
    "id": "music-humanities-ba",
    "college": "Mechanical and Aerospace Engineering (MAE)",
    "description": "The Music Humanities major at UC San Diego is an interdisciplinary program offered through the Department of Mechanical and Aerospace Engineering is not correct, as Music Humanities is not a MAE department major; however, according to the official catalog, the Music Humanities major is housed under the Department of Music. The major explores the historical and cultural contexts of music, integrating analysis of musical structures, cultural history, and critical theory. Coursework spans various historical periods, genres, and theoretical approaches, preparing students for diverse careers in music-related fields or graduate study."
  },
  {
    "name": "Chemical Engineering (B.S.)",
    "id": "chemical-engineering-bs",
    "college": "NanoEngineering",
    "description": "The Department of NanoEngineering offers a Bachelor of Science degree in Chemical Engineering. The program provides a comprehensive education in chemical engineering principles, including thermodynamics, transport phenomena, and reaction kinetics. Students learn to apply these principles to design and optimize chemical processes and systems. The curriculum includes coursework in mathematics, physics, chemistry, and biology, as well as core courses in chemical engineering."
  },
  {
    "name": "NanoEngineering (B.S.)",
    "id": "nanoengineering-bs",
    "college": "NanoEngineering",
    "description": "The NanoEngineering major provides a foundation in nanoscale science and engineering, preparing students for careers or graduate study in fields related to nanotechnology, materials science, and related engineering disciplines. The curriculum includes coursework in mathematics, physics, chemistry, and engineering, as well as specialized courses in nanoengineering."
  },
  {
    "name": "Philosophy (B.A.)",
    "id": "philosophy-ba",
    "college": "Philosophy",
    "description": "The Department of Philosophy offers a broad range of courses covering the main areas of philosophy, including metaphysics, epistemology, ethics, logic, and the history of philosophy. The undergraduate major in Philosophy is designed to provide students with a solid foundation in the subject, preparing them for a variety of careers or for graduate study in philosophy or related fields."
  },
  {
    "name": "Physics (B.A.)",
    "id": "physics-ba",
    "college": "Physics",
    "description": "The Bachelor of Arts degree in Physics is designed to provide students with a broad background in physics and related fields. The program allows for more flexibility in course selection compared to the B.S. program, enabling students to pursue a double major or to satisfy pre-med or other pre-professional requirements. Students gain a solid foundation in the principles of physics and are prepared for a variety of career paths or further study."
  },
  {
    "name": "Physics (B.S.)",
    "id": "physics-bs",
    "college": "Physics",
    "description": "The Bachelor of Science in Physics is designed to provide a comprehensive education in the fundamental principles of physics. The program includes coursework in classical mechanics, electromagnetism, thermodynamics, quantum mechanics, and statistical mechanics, as well as laboratory and computational physics. Students are also required to complete a set of mathematics courses and have the opportunity to choose from a range of elective courses in physics and related fields."
  },
  {
    "name": "Political Science",
    "id": "political-science",
    "college": "Physics",
    "description": "The Political Science major at UC San Diego is designed to provide students with a comprehensive understanding of politics, government, and political processes. The major encompasses various fields, including American politics, comparative politics, international relations, and political theory. Students are required to complete a set of core courses and choose from a range of electives to fulfill the major requirements."
  },
  {
    "name": "Political Science (B.A.)",
    "id": "political-science-ba",
    "college": "Physics",
    "description": "The Department of Political Science offers a broad and comprehensive undergraduate curriculum that encompasses the major subfields of the discipline: American politics, comparative politics, international relations, and political theory. The curriculum is designed to provide students with a solid foundation in the discipline, as well as the opportunity to pursue specialized interests. Students are encouraged to explore the various subfields and to develop a deeper understanding of the complex relationships between politics, society, and the economy."
  },
  {
    "name": "Political Science/American Politics (B.A.)",
    "id": "political-science-american-politics-ba",
    "college": "Physics",
    "description": "The Political Science/American Politics major provides students with a comprehensive understanding of American political institutions, processes, and behavior. The program includes coursework in political theory, methodology, and specialized courses in American politics, as well as electives that allow students to explore topics in greater depth. Students develop critical thinking, research, and analytical skills, preparing them for careers in government, law, politics, and related fields."
  },
  {
    "name": "Political Science/Comparative Politics (B.A.)",
    "id": "political-science-comparative-politics-ba",
    "college": "Physics",
    "description": "The Political Science/Comparative Politics major focuses on the comparative study of political systems, institutions, and processes. Students examine the similarities and differences between various countries and political systems, preparing them for careers in fields such as government, international relations, law, and academia. The major is offered through the Department of Political Science."
  },
  {
    "name": "Political Science/Data Analytics (B.S.)",
    "id": "political-science-data-analytics-bs",
    "college": "Physics",
    "description": "The Bachelor of Science in Political Science/Data Analytics is an interdisciplinary program offered by the Department of Physics. It combines coursework in political science, data analysis, and computational methods to equip students with the skills to analyze and interpret complex data in the context of political phenomena. Students learn to apply data analytics techniques to understand political processes, institutions, and behaviors."
  },
  {
    "name": "Political Science/International Affairs (B.A./MIA only)",
    "id": "political-science-international-affairs-ba-mia-only",
    "college": "Physics",
    "description": "The Political Science/International Affairs major is designed for students who are interested in pursuing a career in international affairs, global politics, or related fields. The major combines coursework in political science, international relations, and other relevant disciplines to provide students with a comprehensive understanding of global issues and the skills needed to address them. Students in this major complete a series of core courses in political science and international relations, as well as electives in areas such as comparative politics, international political economy, and global governance. The major also includes a graduate component, where students can earn a Master's in International Affairs (MIA) in conjunction with their undergraduate degree."
  },
  {
    "name": "Political Science/International Relations (B.A.)",
    "id": "political-science-international-relations-ba",
    "college": "Physics",
    "description": "The Political Science/International Relations major provides students with a broad understanding of the discipline of political science, including the subfields of international relations, comparative politics, political theory, and American politics. The major emphasizes the development of critical thinking, writing, and research skills. Students choose from a range of courses that cover various aspects of politics and international relations."
  },
  {
    "name": "Political Science/Political Theory (B.A.)",
    "id": "political-science-political-theory-ba",
    "college": "Physics",
    "description": "The Political Science major is designed to provide students with a broad understanding of the discipline, as well as the opportunity to focus on specific areas of interest. The Political Theory subfield focuses on the study of political thought and its application to contemporary issues."
  },
  {
    "name": "Political Science/Public Law (B.A.)",
    "id": "political-science-public-law-ba",
    "college": "Physics",
    "description": "The Political Science/Public Law major at UC San Diego is offered by the Department of Political Science. It is designed to provide students with a comprehensive understanding of the role of law and the courts in the American political system. The program includes coursework in constitutional law, civil liberties, and the judicial process, as well as elective courses in related fields."
  },
  {
    "name": "Political Science/Public Policy (B.A.)",
    "id": "political-science-public-policy-ba",
    "college": "Physics",
    "description": "The Political Science/Public Policy major is an interdisciplinary program that combines coursework in political science and public policy to provide students with a comprehensive understanding of the political and policy-making processes. The major is designed to prepare students for careers in government, non-profit organizations, and private sector companies, as well as for graduate study in political science, public policy, or related fields."
  },
  {
    "name": "Political Science/Race, Ethnicity, and Politics (B.A.)",
    "id": "political-science-race,-ethnicity,-and-politics-ba",
    "college": "Physics",
    "description": "The Political Science/Race, Ethnicity, and Politics major is an interdisciplinary program that examines the complex relationships between politics, race, ethnicity, and social inequality. Students explore the experiences of diverse racial and ethnic groups in the United States and globally, analyzing the ways in which politics shapes and is shaped by social identities. The program is designed to provide students with a nuanced understanding of the intersections between politics, culture, and identity, preparing them for careers in fields such as law, government, education, and social justice."
  },
  {
    "name": "Psychology (B.A.)",
    "id": "psychology-ba",
    "college": "Psychology",
    "description": "The Psychology major at UC San Diego offers a broad introduction to the scientific study of behavior and mental processes. Students learn about the major areas of psychology, including cognition, social psychology, developmental psychology, and biological psychology. The program emphasizes the development of critical thinking, research methods, and statistical analysis skills. Students are prepared for a variety of careers in fields such as research, education, healthcare, and social services, as well as for graduate study in psychology."
  },
  {
    "name": "Psychology (B.S.)",
    "id": "psychology-bs",
    "college": "Psychology",
    "description": "The Bachelor of Science in Psychology provides a comprehensive education in the scientific study of behavior and mental processes. The program covers a broad range of topics, including research methods, statistics, cognitive psychology, social psychology, developmental psychology, and biological psychology. Students gain a deep understanding of the principles and methods of psychology, preparing them for careers in research, clinical psychology, education, and other fields."
  },
  {
    "name": "Psychology with a Specialization in Clinical Psychology (B.S.)",
    "id": "psychology-with-a-specialization-in-clinical-psychology-bs",
    "college": "Psychology",
    "description": "The B.S. in Psychology with a Specialization in Clinical Psychology is designed to provide a comprehensive understanding of psychological principles, research methods, and their application to clinical psychology. The program includes coursework in statistics, research methods, abnormal psychology, and clinical psychology, as well as electives in areas such as developmental psychopathology and psychological assessment. Students are prepared for careers in research, healthcare, and social services, or for further study in graduate programs."
  },
  {
    "name": "Psychology with a Specialization in Cognitive Psychology (B.S.)",
    "id": "psychology-with-a-specialization-in-cognitive-psychology-bs",
    "college": "Psychology",
    "description": "The B.S. in Psychology with a Specialization in Cognitive Psychology provides students with a foundation in the principles of psychology and a deeper understanding of cognitive processes, including perception, attention, memory, language, and decision-making. The program includes coursework in research methods, statistics, and experimental design, as well as elective courses in cognitive psychology and related areas."
  },
  {
    "name": "Psychology with a Specialization in Developmental Psychology (B.S.)",
    "id": "psychology-with-a-specialization-in-developmental-psychology-bs",
    "college": "Psychology",
    "description": "The B.S. in Psychology with a Specialization in Developmental Psychology provides a comprehensive understanding of human development across the lifespan, focusing on cognitive, social, and emotional growth. Students explore the biological, environmental, and cultural factors influencing development through coursework and research experience. The program prepares students for careers in education, research, healthcare, and social services or for graduate study in psychology and related fields."
  },
  {
    "name": "Psychology with a Specialization in Human Health (B.S.)",
    "id": "psychology-with-a-specialization-in-human-health-bs",
    "college": "Psychology",
    "description": "The Bachelor of Science in Psychology with a Specialization in Human Health is designed to provide students with a comprehensive understanding of psychological principles and their application to human health. The program covers various aspects of psychology, including research methods, statistical analysis, and the biological and social factors that influence human behavior and health. Students learn about the psychological, social, and biological processes that underlie human health and illness, and are prepared for careers in healthcare, research, or further study."
  },
  {
    "name": "Psychology with a Specialization in Sensation and Perception (B.S.)",
    "id": "psychology-with-a-specialization-in-sensation-and-perception-bs",
    "college": "Psychology",
    "description": "The Psychology with a Specialization in Sensation and Perception major is designed to provide students with a comprehensive understanding of the psychological principles underlying human perception and sensation. The program includes coursework in research methods, statistics, and core areas of psychology, as well as specialized courses in sensation and perception. Students are trained in the scientific study of behavior and mental processes, with an emphasis on empirical research and critical thinking."
  },
  {
    "name": "Psychology with a Specialization in Social Psychology (B.S.)",
    "id": "psychology-with-a-specialization-in-social-psychology-bs",
    "college": "Psychology",
    "description": "The Bachelor of Science in Psychology with a Specialization in Social Psychology is designed to provide students with a comprehensive understanding of psychological principles, with a focus on social psychology. The program covers a wide range of topics, including research methods, statistical analysis, and the biological and cognitive aspects of psychology, as well as the social and cultural factors that influence human behavior. Students learn about the theories, principles, and research methods used in social psychology, and develop skills in critical thinking, problem-solving, and research design."
  },
  {
    "name": "Cognitive and Behavioral Neuroscience (B.S.)",
    "id": "cognitive-and-behavioral-neuroscience-bs",
    "college": "Psychology",
    "description": "The Cognitive and Behavioral Neuroscience major is designed to provide students with a comprehensive understanding of the biological basis of behavior and cognition. The program combines coursework in cognitive science, neuroscience, and psychology to provide a strong foundation in the principles of cognition, perception, and behavioral neuroscience."
  },
  {
    "name": "Business Psychology (B.S.)",
    "id": "business-psychology-bs",
    "college": "Psychology",
    "description": "The Business Psychology major is an interdisciplinary program that focuses on the application of psychological principles to the business world. The program emphasizes the understanding of human behavior in organizational settings and prepares students for careers in management, human resources, marketing, and other related fields. The curriculum includes coursework in psychology, business, and statistics, providing students with a solid foundation in the principles of business and the skills to apply psychological theory to real-world problems."
  },
  {
    "name": "Geosciences (B.S.)",
    "id": "geosciences-bs",
    "college": "Scripps Institution of Oceanography",
    "description": "The Geosciences program at UC San Diego, administered by the Scripps Institution of Oceanography, provides a comprehensive education in the Earth sciences. Students gain a broad understanding of the Earth's physical systems, including the atmosphere, oceans, and solid Earth, as well as the interactions between these systems. The program emphasizes the application of scientific principles to understand and address complex Earth science problems."
  },
  {
    "name": "Marine Biology (B.S.)",
    "id": "marine-biology-bs",
    "college": "Scripps Institution of Oceanography",
    "description": "The Marine Biology major is designed to provide students with a broad understanding of the marine environment, including the organisms that live in it, the physical and chemical factors that influence them, and the interactions between organisms and their environment. The program is designed to prepare students for a variety of careers in fields such as research, conservation, education, and policy, as well as for graduate study in marine biology or related fields."
  },
  {
    "name": "Oceanic and Atmospheric Sciences (B.S.)",
    "id": "oceanic-and-atmospheric-sciences-bs",
    "college": "Scripps Institution of Oceanography",
    "description": "The Bachelor of Science in Oceanic and Atmospheric Sciences is an interdisciplinary program that provides students with a comprehensive understanding of the Earth's ocean and atmosphere systems. The program is designed to prepare students for careers in research, education, government, and industry. Students in this program gain a strong foundation in the physical sciences, including mathematics, physics, and chemistry, as well as specialized knowledge in oceanic and atmospheric sciences."
  },
  {
    "name": "Oceanic and Atmospheric Sciences (B.S./MPP only)",
    "id": "oceanic-and-atmospheric-sciences-bs-mpp-only",
    "college": "Scripps Institution of Oceanography",
    "description": "The B.S./MPP program in Oceanic and Atmospheric Sciences is an interdisciplinary major that combines the natural sciences, mathematics, and policy. Students in this program gain a strong foundation in the sciences, with a focus on oceanic and atmospheric processes, as well as training in public policy to address the complex environmental challenges facing society."
  },
  {
    "name": "Sociology (B.A.)",
    "id": "sociology-ba",
    "college": "Sociology",
    "description": "The Department of Sociology at UC San Diego offers a comprehensive undergraduate program leading to a Bachelor of Arts degree in Sociology. The program is designed to provide students with a thorough understanding of sociological theories, methods, and substantive areas of inquiry. Students are trained in the analysis of social structures, institutions, and relationships, and are prepared for a wide range of careers in fields such as research, policy, education, and social services."
  },
  {
    "name": "Sociology - International Studies (B.A.)",
    "id": "sociology-international-studies-ba",
    "college": "Sociology",
    "description": "The Sociology - International Studies major is an interdisciplinary program that combines the study of sociology with international studies. Students examine global issues, social structures, and institutions from a sociological perspective, gaining a deeper understanding of the complex relationships between societies and cultures."
  },
  {
    "name": "Sociology - American Studies (B.A.)",
    "id": "sociology-american-studies-ba",
    "college": "Sociology",
    "description": "The Sociology - American Studies major is an interdisciplinary program that combines the study of American society and culture with sociological theory and methods. Students examine the social, cultural, and political structures that shape American identity and experience. The program prepares students for careers in fields such as education, research, policy, and social services."
  },
  {
    "name": "Sociology - Science and Medicine (B.A.)",
    "id": "sociology-science-and-medicine-ba",
    "college": "Sociology",
    "description": "The Sociology - Science and Medicine major provides students with a comprehensive understanding of the social aspects of science, medicine, and health. It examines the social structures, institutions, and relationships that shape the practice of science and medicine, as well as the social consequences of scientific and medical advancements. Students in this major explore the intersections of sociology, science, and medicine, preparing them for careers in healthcare, research, policy, and education."
  },
  {
    "name": "Sociology - Economy and Society (B.A.)",
    "id": "sociology-economy-and-society-ba",
    "college": "Sociology",
    "description": "The Sociology - Economy and Society major focuses on the sociological study of the economy, examining how economic processes are shaped by social structures, institutions, and relationships. Students analyze the social and cultural contexts of economic activity, exploring topics such as globalization, inequality, and the role of the state in economic affairs."
  },
  {
    "name": "Sociology - Culture and Communication (B.A.)",
    "id": "sociology-culture-and-communication-ba",
    "college": "Sociology",
    "description": "The Sociology - Culture and Communication major at UC San Diego provides students with a comprehensive understanding of the social and cultural contexts of communication. The program focuses on the ways in which culture is produced, disseminated, and consumed, and how these processes shape and are shaped by social structures and institutions. Students examine the social and cultural factors that influence communication, including the role of technology, media, and social inequality."
  },
  {
    "name": "Sociology - Social Inequality (B.A.)",
    "id": "sociology-social-inequality-ba",
    "college": "Sociology",
    "description": "The Sociology - Social Inequality major at UC San Diego focuses on the study of social inequality, examining the ways in which social structures, institutions, and interactions shape individual and group outcomes. Students explore topics such as race, class, gender, and sexuality, and develop a critical understanding of the complex relationships between social inequality and social change."
  },
  {
    "name": "Sociology - Law and Society (B.A.)",
    "id": "sociology-law-and-society-ba",
    "college": "Sociology",
    "description": "The Sociology - Law and Society major provides students with a systematic understanding of the relationship between law and society. It examines the social context and impact of law, exploring how law shapes and is shaped by social structures, institutions, and relationships. The program draws on sociological theories and methods to analyze the role of law in society, covering topics such as legal institutions, legal professions, and the social implications of legal decisions."
  },
  {
    "name": "Structural Engineering (B.S.)",
    "id": "structural-engineering-bs",
    "college": "Structural Engineering (SE)",
    "description": "The Structural Engineering program at UC San Diego is designed to provide students with a comprehensive understanding of the principles and practices of structural engineering. The program focuses on the theoretical foundations, analysis, design, and construction of various types of structures, preparing students for careers in the field or for further study. Students learn about the behavior of structures under different loads, the properties of materials, and the application of engineering principles to solve real-world problems."
  },
  {
    "name": "Structural Engineering with a Specialization in Aerospace Structures (B.S.)",
    "id": "structural-engineering-with-a-specialization-in-aerospace-structures-bs",
    "college": "Structural Engineering (SE)",
    "description": "The Structural Engineering with a Specialization in Aerospace Structures program is designed to provide students with a comprehensive understanding of the principles and practices of structural engineering, with a focus on the unique demands of aerospace structures. The program covers topics such as mechanics of solids and fluids, structural analysis and design, and materials science, with an emphasis on the application of these principles to the design and analysis of aerospace structures."
  },
  {
    "name": "Structural Engineering with a Specialization in Civil Structures (B.S.)",
    "id": "structural-engineering-with-a-specialization-in-civil-structures-bs",
    "college": "Structural Engineering (SE)",
    "description": "The Structural Engineering with a Specialization in Civil Structures program at UC San Diego is designed to provide students with a comprehensive education in the principles and practices of structural engineering, with a focus on civil structures. The program covers the analysis, design, and construction of structures, including the application of engineering mechanics, materials science, and mathematics. Students learn about the behavior of structures under various loads, including seismic, wind, and gravity loads, and develop skills in the use of computer-aided design tools and software."
  },
  {
    "name": "Structural Engineering with a Specialization in Geotechnical Engineering (B.S.)",
    "id": "structural-engineering-with-a-specialization-in-geotechnical-engineering-bs",
    "college": "Structural Engineering (SE)",
    "description": "The Structural Engineering program with a Specialization in Geotechnical Engineering is designed to provide students with a comprehensive understanding of the principles and practices in structural and geotechnical engineering. The program includes coursework in mathematics, physics, and engineering sciences, as well as specialized courses in structural analysis, geotechnical engineering, and earthquake engineering. Students learn to apply theoretical knowledge to solve real-world engineering problems and are prepared for careers in consulting, government, or research."
  },
  {
    "name": "Structural Engineering with a Specialization in Structural Health Monitoring/Non-Destructive Evaluation (B.S.)",
    "id": "structural-engineering-with-a-specialization-in-structural-health-monitoring-non-destructive-evaluation-bs",
    "college": "Structural Engineering (SE)",
    "description": "The Structural Engineering with a Specialization in Structural Health Monitoring/Non-Destructive Evaluation program is designed to provide students with a comprehensive understanding of structural engineering principles and practices, with a focus on the application of structural health monitoring and non-destructive evaluation techniques. The program includes coursework in mathematics, physics, materials science, and structural analysis, as well as specialized courses in structural health monitoring and non-destructive evaluation."
  },
  {
    "name": "Dance (B.A.)",
    "id": "dance-ba",
    "college": "Theatre and Dance",
    "description": "The Dance major at UC San Diego offers students a comprehensive education in dance technique, history, and criticism, as well as choreography and performance. The program is designed to provide students with a deep understanding of dance as an art form and its various cultural and historical contexts. Students work with faculty to develop their technical skills, creative expression, and critical thinking."
  },
  {
    "name": "Theatre (B.A.)",
    "id": "theatre-ba",
    "college": "Theatre and Dance",
    "description": "The Theatre major at UC San Diego is designed to provide students with a comprehensive education in the art and craft of theatre. The program emphasizes the development of skills in acting, directing, playwriting, design, and technical theatre, as well as the study of theatre history and criticism. Students work closely with faculty and guest artists to create innovative productions that showcase their talents."
  },
  {
    "name": "Urban Studies and Planning (B.A.)",
    "id": "urban-studies-and-planning-ba",
    "college": "Urban Studies and Planning",
    "description": "The Urban Studies and Planning major provides students with a comprehensive understanding of urban issues, preparing them for careers in urban planning, policy, and related fields. The program covers topics such as urban development, transportation, housing, and community engagement, with a focus on social justice and equity."
  },
  {
    "name": "Real Estate and Development (B.S.)",
    "id": "real-estate-and-development-bs",
    "college": "Urban Studies and Planning",
    "description": "The Bachelor of Science degree in Real Estate and Development is designed to provide students with a comprehensive understanding of the real estate industry, including its economic, financial, legal, and spatial aspects. The program is interdisciplinary, drawing on coursework from various departments, including Urban Studies and Planning, Economics, and Finance. Students learn about real estate development, finance, law, and marketing, as well as the social and environmental impacts of real estate decisions."
  },
  {
    "name": "Art History/ Criticism (B.A.)",
    "id": "art-history--criticism-ba",
    "college": "Visual Arts",
    "description": "The Art History/Criticism major provides a comprehensive education in the history, theory, and criticism of art from a variety of cultures and time periods. The program emphasizes the development of critical thinking, writing, and visual analysis skills. Students engage with a broad range of artistic practices, from ancient to contemporary, and explore the social, cultural, and historical contexts in which artworks are created and interpreted."
  },
  {
    "name": "Interdisciplinary Computing and the Arts (B.A.)",
    "id": "interdisciplinary-computing-and-the-arts-ba",
    "college": "Visual Arts",
    "description": "The Interdisciplinary Computing and the Arts major is designed for students who are interested in the intersection of computing and the arts. The program is interdisciplinary, drawing on courses from the Departments of Computer Science and Engineering, Music, Visual Arts, and others. Students in this major gain a strong foundation in computing, as well as a deep understanding of the arts and humanities."
  },
  {
    "name": "Media (B.A.)",
    "id": "media-ba",
    "college": "Visual Arts",
    "description": "The Media major is designed for students interested in the study of media and its relationship to society. The program emphasizes the critical analysis of media forms, the cultural and social contexts of media production and consumption, and the ways in which media shape and reflect societal values."
  },
  {
    "name": "Speculative Design (B.A.)",
    "id": "speculative-design-ba",
    "college": "Visual Arts",
    "description": "The Speculative Design major is an interdisciplinary program that combines design, art, and critical thinking to explore the intersection of technology, culture, and society. Students learn to create innovative designs that challenge conventional thinking and foster new perspectives on the world."
  },
  {
    "name": "Studio (B.A.)",
    "id": "studio-ba",
    "college": "Visual Arts",
    "description": "The Studio program, offered through the Visual Arts department, provides students with a comprehensive education in studio arts, preparing them for careers or further study in the arts. The program emphasizes the development of technical skills, critical thinking, and creative expression. Coursework includes foundational studies in drawing, painting, sculpture, and other media, as well as intermediate and advanced courses that allow students to explore specific interests and techniques."
  }
]