{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Mathematics - Computer Science (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Mathematics-Computer Science program is designed for students who are interested in the overlap between mathematics and computer science, including algorithm design, computational complexity, and scientific computing. The program provides a strong foundation in both mathematics and computer science, preparing students for a variety of careers in industry, government, and academia, as well as for graduate study in either field.",
  "shortProgramDescription": "The Mathematics-Computer Science B.S. program at UC San Diego combines mathematical rigor with computational theory and practice, preparing students for technical careers or graduate study.",
  "classHighlights": [
    "The Mathematics-Computer Science program requires a foundation in calculus (MATH 20A-B-C-D), linear algebra (MATH 20F or MATH 18), and differential equations (MATH 20D or MATH 21D).",
    "Computer Science core courses include programming (CSE 11 or CSE 8A and CSE 8B), data structures (CSE 12), algorithms (CSE 101), and computer architecture (CSE 30 or CSE 140).",
    "Mathematics courses cover a range of topics, including real analysis (MATH 140A-B-C), abstract algebra (MATH 100 or 103A-B-C), and probability and statistics (MATH 180A-B-C).",
    "Students also take advanced computer science electives, such as artificial intelligence (CSE 151 or 250A), computer networks (CSE 123), or database systems (CSE 132A-B).",
    "Electives allow students to explore specialized areas, including machine learning, data science, computational complexity, or computational geometry."
  ],
  "learningOutcomes": [
    "Apply mathematical principles to the design and analysis of algorithms and computational systems.",
    "Understand and implement fundamental data structures and algorithms.",
    "Analyze and solve problems using computational methods.",
    "Demonstrate a strong foundation in mathematical theories and models relevant to computer science.",
    "Communicate complex mathematical and computational concepts effectively."
  ],
  "similarPrograms": [
    {
      "title": "Computer Science (B.S.)",
      "link": "https://catalog.ucsd.edu/curric/cse.html"
    },
    {
      "title": "Mathematics (B.S.)",
      "link": "https://catalog.ucsd.edu/curric/math.html"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/math.html",
    "https://math.ucsd.edu/undergrad/major.html"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180-190 quarter units (varies depending on course choices and preparation)",
  "additionalInformation": "Students are advised to consult with departmental advisors to plan their course sequence and choose electives that align with their interests and career goals. Preparation in high school mathematics and computer programming is recommended."
}