{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "NanoEngineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The NanoEngineering major provides a foundation in nanoscale science and engineering, preparing students for careers or graduate study in fields related to nanotechnology, materials science, and related engineering disciplines. The curriculum includes coursework in mathematics, physics, chemistry, and engineering, as well as specialized courses in nanoengineering.",
  "shortProgramDescription": "The NanoEngineering B.S. program at UC San Diego provides a comprehensive education in nanoscale science and engineering, preparing students for diverse careers or further study.",
  "classHighlights": [
    "Mathematics and Physics Foundation: Students take a sequence of calculus (MATH20A-B-C-D) and physics (PHYS2A-B-C) to build a strong foundation for understanding nanoscale phenomena.",
    "Chemistry and Materials Science: Coursework includes General Chemistry (CHEM6A-B-C), Materials Science (NANO15), and Thermodynamics and Kinetics (NANO106), providing a basis in chemical principles and materials properties.",
    "NanoEngineering Core: Required courses include Introduction to NanoEngineering (NANO1), NanoEngineering Materials (NANO15), and Nanoscale Characterization (NANO134), among others, focusing on nanoscale science, engineering principles, and characterization techniques.",
    "Engineering and Design: Students learn engineering and design principles through courses such as Engineering Design Graphics (MAE3), Mechanics of Solids (MAE101), and NanoEngineering Design (NANO151), emphasizing hands-on skills and project-based learning.",
    "Specialized and Advanced Courses: The curriculum includes a range of specialized nanoengineering courses, such as Nanoscale Transport Phenomena (NANO144), Nano and Bio Interfaces (NANO164), and Nanofabrication (NANO172), allowing students to explore advanced topics and develop depth in specific areas.",
    "Laboratory and Research Experience: Students gain practical laboratory experience through courses like NanoEngineering Laboratory I and II (NANO106L and NANO134L), preparing them for research or industry roles.",
    "Electives and Breadth: Students choose from a variety of technical electives to broaden their knowledge and tailor their education to their interests, including courses in related departments such as mechanical engineering, electrical engineering, or chemistry and biochemistry."
  ],
  "learningOutcomes": [
    "Demonstrate a comprehensive understanding of nanoscale science and engineering principles.",
    "Apply mathematical, physical, and chemical principles to analyze and solve problems in nanoengineering.",
    "Design and conduct experiments to characterize and manipulate materials at the nanoscale.",
    "Communicate complex scientific and engineering concepts effectively.",
    "Understand the societal and ethical implications of nanotechnology.",
    "Work effectively in teams to tackle complex engineering challenges."
  ],
  "similarPrograms": [
    {
      "title": "Materials Science and Engineering Minor",
      "link": "https://catalog.ucsd.edu/courses/MAE.html"
    },
    {
      "title": "Chemical Engineering (B.S.)",
      "link": "https://catalog.ucsd.edu/courses/CENG.html"
    },
    {
      "title": "Mechanical Engineering (B.S.)",
      "link": "https://catalog.ucsd.edu/courses/MAE.html"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/NANO-ug.html",
    "https://nano.ucsd.edu/undergraduate/",
    "https://catalog.ucsd.edu/front/courses.html?prefix=NANO"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "The NanoEngineering major is offered through the Department of NanoEngineering. Students are advised to consult with departmental advisors for specific course planning and to stay updated on program requirements."
}