{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Political Science/International Relations (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Political Science/International Relations major provides students with a broad understanding of the discipline of political science, including the subfields of international relations, comparative politics, political theory, and American politics. The major emphasizes the development of critical thinking, writing, and research skills. Students choose from a range of courses that cover various aspects of politics and international relations.",
  "shortProgramDescription": "The Political Science/International Relations B.A. major at UC San Diego provides a comprehensive understanding of political science and international relations, preparing students for diverse careers or further study.",
  "classHighlights": [
    "The major requires the completion of core courses including POSC 10: Introduction to Political Science, POSC 20: Introduction to International Relations, and POSC 30: Introduction to Comparative Politics. These courses provide a foundation in the subfields of political science.",
    "Students are also required to take POSC 100: Methods of Political Inquiry, which introduces students to research methods in political science. Additionally, students must complete POSC 102: Scope and Methods of Political Science, which covers the scope and methods of the discipline.",
    "The major offers a range of elective courses that cover various aspects of politics and international relations, such as comparative politics, international relations, political theory, and American politics. Students can choose from courses like POSC 121: International Political Economy, POSC 130: Comparative Politics, and POSC 140: American Politics.",
    "Students are also encouraged to explore specialized topics through upper-division courses, such as POSC 142: Politics and Society in China, POSC 143: Politics of Developing Countries, and POSC 160: International Conflict and Cooperation."
  ],
  "learningOutcomes": [
    "Understand the major subfields of political science, including international relations, comparative politics, political theory, and American politics.",
    "Apply critical thinking and analytical skills to understand complex political phenomena.",
    "Develop research skills, including the ability to design and conduct research projects.",
    "Communicate effectively in writing and orally about political science topics.",
    "Analyze the role of politics and international relations in shaping global events and outcomes."
  ],
  "similarPrograms": [
    {
      "title": "Political Science (B.A.)",
      "link": "https://catalog.ucsd.edu/front/courses/undeclared-majors/political-science-ba"
    },
    {
      "title": "Global Studies (B.A.)",
      "link": "https://catalog.ucsd.edu/front/courses/undeclared-majors/global-studies-ba"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/front/courses/undeclared-majors/political-science-international-relations-ba",
    "https://politicalscience.ucsd.edu/undergraduate/majors/political-science.html"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "48 upper-division units in the major; total approximately 180 quarter units",
  "additionalInformation": "The department is housed within the Division of Social Sciences. The major is flexible and allows students to pursue various interests within the field of political science and international relations. Students are advised to consult with department advisors to plan their course of study."
}