{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Political Science/American Politics (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Political Science/American Politics major provides students with a comprehensive understanding of American political institutions, processes, and behavior. The program includes coursework in political theory, methodology, and specialized courses in American politics, as well as electives that allow students to explore topics in greater depth. Students develop critical thinking, research, and analytical skills, preparing them for careers in government, law, politics, and related fields.",
  "shortProgramDescription": "The Political Science/American Politics B.A. major at UC San Diego provides a rigorous education in American political institutions and processes, preparing students for careers in politics, government, and related fields.",
  "classHighlights": [
    "The major requires foundational courses in political science, including Introduction to American Politics (POLI11) and Introduction to Political Theory (POLI30).",
    "Students take core courses in American Politics, including The American Presidency (POLI142), Congress and the Legislative Process (POLI143), and Political Behavior and Participation (POLI144).",
    "Methodology courses, such as Introduction to Social Science Research Methods (POLI100) and Quantitative Methods in Political Science (POLI101), provide students with skills in research design, data analysis, and statistical methods.",
    "Electives in American Politics allow students to explore specialized topics, such as Campaigns and Elections (POLI145), Politics and the Media (POLI146), and Race and American Politics (POLI149).",
    "Upper-division coursework in political theory, such as Classical Political Thought (POLI130) and Modern Political Thought (POLI131), provides a deeper understanding of the theoretical foundations of politics.",
    "The major also includes upper-division electives in various subfields, including comparative politics, international relations, and public policy."
  ],
  "learningOutcomes": [
    "Understand the fundamental institutions and processes of American politics.",
    "Analyze and interpret data related to political behavior and institutions.",
    "Develop critical thinking and research skills in the study of politics.",
    "Apply theoretical perspectives to understand political phenomena.",
    "Communicate complex ideas and research findings effectively in written and oral form.",
    "Evaluate the role of politics in shaping social and economic outcomes."
  ],
  "similarPrograms": [
    {
      "title": "Political Science/Global Politics (B.A.)",
      "link": "https://catalog.ucsd.edu/front/courses-and-programs/undergraduate-programs/political-science/global-politics-ba/"
    },
    {
      "title": "Political Science/Public Policy (B.A.)",
      "link": "https://catalog.ucsd.edu/front/courses-and-programs/undergraduate-programs/political-science/public-policy-ba/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/POLI-ug.html",
    "https://politicalscience.ucsd.edu/undergraduate/majors/index.html"
  ],
  "programDuration": "4 years (quarter system)",
  "creditRequirements": "Total of180 quarter units; major requirements include52-60 units of upper-division POLI courses",
  "additionalInformation": "The Department of Physics is not the home department for this major; the actual department is Political Science. Students should consult with advisors in the Department of Political Science for specific major requirements and advising."
}