{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Psychology with a Specialization in Cognitive Psychology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The B.S. in Psychology with a Specialization in Cognitive Psychology provides students with a foundation in the principles of psychology and a deeper understanding of cognitive processes, including perception, attention, memory, language, and decision-making. The program includes coursework in research methods, statistics, and experimental design, as well as elective courses in cognitive psychology and related areas.",
  "shortProgramDescription": "The B.S. in Psychology with a Specialization in Cognitive Psychology prepares students for careers in research, academia, or industry, or for graduate study in psychology or related fields.",
  "classHighlights": [
    "Foundational courses in psychology, including Introduction to Psychology (PSYC60) and Research Methods in Psychology (PSYC101), provide a broad understanding of the field and research principles.",
    "Cognitive psychology courses, such as Cognition (PSYC154) and Cognitive Neuroscience (PSYC155), focus on the mental processes that underlie human behavior and cognition.",
    "Statistics and research methods courses, including Statistics for Psychological Research (PSYC102) and Experimental Design (PSYC104), equip students with the skills to design, conduct, and analyze research studies.",
    "Elective courses in areas such as cognitive neuroscience, human factors, and developmental psychology allow students to explore related topics and deepen their understanding of cognitive psychology.",
    "Upper-division courses, such as Seminar in Cognitive Psychology (PSYC194), provide opportunities for students to engage with current research and issues in the field."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of psychology and cognitive psychology.",
    "Apply research methods and statistical techniques to investigate psychological questions.",
    "Analyze and interpret research findings in cognitive psychology.",
    "Demonstrate knowledge of cognitive processes, including perception, attention, memory, language, and decision-making.",
    "Evaluate the relevance and application of cognitive psychology to real-world problems."
  ],
  "similarPrograms": [
    {
      "title": "Psychology (B.A.)",
      "link": "https://catalog.ucsd.edu/front/courses/psychology-ba/"
    },
    {
      "title": "Psychology with a Specialization in Human Behavior (B.S.)",
      "link": "https://catalog.ucsd.edu/front/courses/psychology-with-a-specialization-in-human-behavior-bs/"
    },
    {
      "title": "Cognitive Science",
      "link": "https://catalog.ucsd.edu/front/departments/cognitive-science/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/PSYC-ug.html",
    "https://psychology.ucsd.edu/undergraduate-program/psychology-bs/"
  ],
  "programDuration": "4 years (8 quarters, quarter system)",
  "creditRequirements": "total of180 quarter units, with at least72 upper-division units",
  "additionalInformation": "Students must complete the major requirements, including foundational courses, cognitive psychology courses, and research methods and statistics courses. Elective courses and upper-division coursework provide opportunities for students to explore related areas and deepen their understanding of cognitive psychology."
}