{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Public Health with Concentration in Medicine Sciences (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Bachelor of Science in Public Health with a concentration in Medicine Sciences is designed to prepare students for careers in the healthcare industry, research, or graduate study. The program focuses on the application of public health principles to medical sciences, including the study of disease prevention, health promotion, and healthcare systems. Students gain a strong foundation in the biological and physical sciences, as well as coursework in public health, including epidemiology, health policy, and environmental health.",
  "shortProgramDescription": "The Public Health with Concentration in Medicine Sciences B.S. program prepares students for careers in healthcare, research, or graduate study by applying public health principles to medical sciences.",
  "classHighlights": [
    "The program includes foundational courses in public health such as Introduction to Public Health (FMPH40), Biostatistics for Public Health (FMPH101), and Principles of Epidemiology (FMPH102).",
    "Students take a series of core courses that cover the fundamental aspects of public health, including health policy, environmental health, and health behavior.",
    "The Medicine Sciences concentration requires coursework in areas such as human physiology, pathology, and pharmacology, as well as upper-division electives in medicine sciences.",
    "Additional coursework includes classes on global health, health disparities, and healthcare systems, providing students with a comprehensive understanding of public health issues.",
    "Students also complete upper-division public health electives, allowing them to tailor their education to their interests and career goals."
  ],
  "learningOutcomes": [
    "Apply public health principles to medical sciences",
    "Understand the biological and physical sciences underlying human health and disease",
    "Analyze health data and apply epidemiological methods to public health issues",
    "Evaluate health policies and programs",
    "Communicate public health information effectively to diverse audiences"
  ],
  "similarPrograms": [
    {
      "title": "Global Health (B.A./B.S.)",
      "link": "https://catalog.ucsd.edu/curriculum/global-health-b-a-b-s/"
    },
    {
      "title": "Biology (B.S.)",
      "link": "https://catalog.ucsd.edu/curriculum/biology-b-s/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/PH-ug.html",
    "https://healthsciences.ucsd.edu/academics/departments/hwshhs/Pages/default.aspx"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180-192 quarter units",
  "additionalInformation": "The Herbert Wertheim School of Public Health and Human Longevity Science offers various undergraduate research opportunities, internships, and study abroad programs that can enhance a student's educational experience."
}