{
  "collegeName": "University of California, San Diego",
  "programType": "Concentration",
  "programName": "Public Health with Concentration in Climate and Environmental Sciences (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Bachelor of Science in Public Health with a concentration in Climate and Environmental Sciences is an interdisciplinary program that focuses on the impact of climate and environmental factors on public health. Students in this program will gain a comprehensive understanding of the complex relationships between environmental factors, climate change, and human health. The program is designed to prepare students for careers in research, policy, and practice, with a focus on addressing the health impacts of climate change and environmental degradation.",
  "shortProgramDescription": "This program prepares students to understand and address the health impacts of climate change and environmental degradation.",
  "classHighlights": [
    "The program includes foundational courses in public health, such as Introduction to Public Health (FMPH40), Epidemiology (FMPH101), and Environmental Health (FMPH142).",
    "Students will take courses in climate and environmental sciences, including Climate Change and Public Health (FMPH156) and Environmental Exposures and Health (FMPH158).",
    "Additional coursework will cover topics such as environmental policy, health disparities, and sustainability, preparing students for a range of careers in public health and environmental fields."
  ],
  "learningOutcomes": [
    "Understand the complex relationships between environmental factors, climate change, and human health.",
    "Apply knowledge of epidemiology and environmental health to address the health impacts of climate change.",
    "Analyze the impact of environmental policies on public health.",
    "Develop skills in data analysis and interpretation to inform public health practice.",
    "Communicate effectively with diverse stakeholders on environmental health issues."
  ],
  "similarPrograms": [
    {
      "title": "Environmental Sciences (B.S.)",
      "link": "https://catalog.ucsd.edu/main/programs/ES-bs/"
    },
    {
      "title": "Global Health (B.A./B.S.)",
      "link": "https://catalog.ucsd.edu/main/programs/FMPH-ba-bs/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/FMPH-ug.html",
    "https://healthsciences.ucsd.edu/academics/departments/faculty/hws/Pages/default.aspx"
  ],
  "programDuration": "4 years (quarter system)",
  "creditRequirements": "Total:180 quarter units; Major:64-65 upper-division units in FMPH courses",
  "additionalInformation": "The program is housed in the Herbert Wertheim School of Public Health and Human Longevity Science. Students are advised to consult with departmental advisors for specific course requirements and electives."
}