{
  "collegeName": "University of California, San Diego",
  "programType": "Major with Concentration",
  "programName": "Public Health with Concentration in Epidemiology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Bachelor of Science in Public Health with a concentration in Epidemiology is designed to provide students with a comprehensive understanding of the distribution and determinants of health-related events, diseases, or health-related characteristics among populations. The program focuses on the application of epidemiological principles to understand and address public health issues. Students learn to design, conduct, and analyze studies, as well as to interpret and apply research findings to inform public health practice and policy.",
  "shortProgramDescription": "The Public Health B.S. with Epidemiology concentration prepares students to understand and investigate health-related events and disease patterns, applying epidemiological methods to public health issues.",
  "classHighlights": [
    "Foundational Courses: Students begin with core courses in Public Health, including Introduction to Public Health (FMPH40), Principles of Epidemiology (FMPH101), and Biostatistics for Public Health (FMPH102). These courses lay the groundwork for understanding public health concepts, epidemiological methods, and statistical analysis.",
    "Epidemiology Core: The concentration includes advanced epidemiology courses such as Epidemiologic Methods (FMPH150), Chronic Disease Epidemiology (FMPH151), and Infectious Disease Epidemiology (FMPH152), providing in-depth knowledge of epidemiological principles and their application to various health issues.",
    "Biostatistics and Research Methods: Students learn statistical methods and research design through courses like Biostatistics for Public Health (FMPH102) and Epidemiologic Methods (FMPH150), enabling them to analyze and interpret health data effectively.",
    "Public Health Context: Courses such as Social and Behavioral Factors in Public Health (FMPH120) and Environmental Health (FMPH130) provide context on the social, behavioral, and environmental determinants of health, rounding out students' understanding of public health issues.",
    "Electives and Specializations: Students can choose from a range of electives to explore specific areas of interest, such as global health, health policy, or health disparities, allowing for a tailored education that aligns with their career goals."
  ],
  "learningOutcomes": [
    "Apply epidemiological principles to understand and investigate health-related events and disease patterns.",
    "Design, conduct, and analyze studies to address public health issues.",
    "Interpret and apply research findings to inform public health practice and policy.",
    "Understand the social, behavioral, and environmental determinants of health.",
    "Utilize biostatistical methods to analyze health data.",
    "Communicate epidemiological concepts and research findings effectively to diverse audiences."
  ],
  "similarPrograms": [
    {
      "title": "Global Health (B.A.)",
      "link": "https://catalog.ucsd.edu/programs/GLBH/#bachelorofartsbaminortext"
    },
    {
      "title": "Public Health with Concentration in Health Policy and Management (B.S.)",
      "link": "https://catalog.ucsd.edu/programs/FMPH/#bachelorofsciencebsconcentrationinhealthpolicymanagementtext"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/FMPH-ug.html",
    "https://healthsciences.ucsd.edu/schools/departments/fmph/education/undergraduate-programs/public-health-epidemiology/Pages/default.aspx"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180-200 quarter units",
  "additionalInformation": "The program requires completion of a set of core courses, concentration-specific courses, and electives. Students must also fulfill the university's general education requirements. The program is designed to be completed in four years, assuming a standard course load each quarter."
}