{
  "collegeName": "University of California, San Diego",
  "programType": "Major with Concentration",
  "programName": "Public Health with Concentration in Community Health Sciences (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Bachelor of Science in Public Health with a concentration in Community Health Sciences is designed to prepare students for careers in public health practice, research, or further education. The program focuses on the application of public health principles to community-based settings, emphasizing the understanding of health disparities, social determinants of health, and the development of interventions to promote health equity. Students learn about the social, environmental, and behavioral factors that influence health outcomes and develop skills in program planning, implementation, and evaluation.",
  "shortProgramDescription": "The Public Health B.S. with a concentration in Community Health Sciences prepares students for careers in public health by focusing on health disparities, social determinants, and community-based interventions.",
  "classHighlights": [
    "The program includes foundational courses in public health such as FMPH40: Introduction to Public Health and FMPH101: Epidemiology, which introduce students to the field and the methods used to study health trends and outcomes.",
    "Courses in the Community Health Sciences concentration, such as FMPH162: Social and Behavioral Factors in Health and FMPH165: Health Disparities, provide students with an understanding of the complex factors that influence health at the community level.",
    "Students also learn about program planning and evaluation through courses like FMPH172: Public Health Program Planning and FMPH173: Public Health Program Evaluation, developing practical skills for implementing and assessing public health initiatives.",
    "Additional coursework covers health policy, environmental health, and global health, ensuring a comprehensive understanding of the multifaceted nature of public health.",
    "Electives allow students to explore specialized areas of interest, such as health education, health advocacy, or health policy, further tailoring their education to their career goals."
  ],
  "learningOutcomes": [
    "Understand the principles of public health and the factors that influence health outcomes at the individual, community, and population levels.",
    "Apply knowledge of social, environmental, and behavioral determinants of health to develop effective public health interventions.",
    "Demonstrate skills in program planning, implementation, and evaluation to address public health issues.",
    "Analyze health disparities and develop strategies to promote health equity.",
    "Communicate public health information effectively to diverse audiences."
  ],
  "similarPrograms": [
    {
      "title": "Global Health (B.A./B.S.)",
      "link": "https://catalog.ucsd.edu/front/courses/FMPH/undergradFMPHGlobalHealth.html"
    },
    {
      "title": "Minor in Public Health",
      "link": "https://catalog.ucsd.edu/front/courses/FMPH/undergradFMPHMinor.html"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/FMPH-ug.html",
    "https://healthsciences.ucsd.edu/schools/hws"
  ],
  "programDuration": "4 years (quarter system)",
  "creditRequirements": "Total:180 quarter units; Major:64-65 units",
  "additionalInformation": "The program is housed within the Herbert Wertheim School of Public Health and Human Longevity Science. Students are advised to consult with program advisors for specific course planning and to explore opportunities for internships and research experiences."
}