{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Structural Engineering with a Specialization in Aerospace Structures (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Structural Engineering with a Specialization in Aerospace Structures program is designed to provide students with a comprehensive understanding of the principles and practices of structural engineering, with a focus on the unique demands of aerospace structures. The program covers topics such as mechanics of solids and fluids, structural analysis and design, and materials science, with an emphasis on the application of these principles to the design and analysis of aerospace structures.",
  "shortProgramDescription": "The Structural Engineering with a Specialization in Aerospace Structures B.S. program provides students with a strong foundation in structural engineering principles and practices, with a focus on the unique demands of aerospace structures.",
  "classHighlights": [
    "The program begins with a foundation in mathematics and physics, including courses such as Calculus (MATH 20A-B-C-D), Physics (PHYS 2A-B-C), and Differential Equations (MATH 20D, MATH 130A-B).",
    "Students take core courses in structural engineering, including Mechanics of Solids (SE 101A-B), Structural Analysis (SE 121), and Structural Design (SE 151A-B).",
    "Aerospace-specific courses include Aerospace Structures (SE 141), Structural Dynamics (SE 161), and Aerospace Materials (SE 181).",
    "Students also complete courses in materials science, including Materials Science and Engineering (ENG 100A-B) and Materials Selection (MAE 156A).",
    "The program includes a range of electives, allowing students to explore topics such as computational mechanics, structural reliability, and aerospace engineering.",
    "Students learn about structural analysis and design using various software and tools, including finite element analysis.",
    "The program emphasizes hands-on learning, with laboratory and design projects that simulate real-world engineering challenges."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of mechanics, materials science, and structural analysis to the design and analysis of aerospace structures.",
    "Understand the unique demands and challenges of aerospace structures, including the effects of vibration, fatigue, and extreme environments.",
    "Use computational tools and software to analyze and design complex aerospace structures.",
    "Communicate complex technical information effectively to a range of audiences.",
    "Work effectively in teams to design and develop innovative solutions to aerospace engineering challenges."
  ],
  "similarPrograms": [
    {
      "title": "Structural Engineering (B.S.)",
      "link": "https://catalog.ucsd.edu/engineering/structural-engineering/se-bs/"
    },
    {
      "title": "Aerospace Engineering (B.S.)",
      "link": "https://catalog.ucsd.edu/engineering/aerospace-engineering/aerospace-bs/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/engineering/structural-engineering/se-bs/",
    "https://structural.ucsd.edu/"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "Students must complete a range of general education requirements, including courses in writing, humanities, and social sciences. The program is accredited by the Engineering Accreditation Commission of ABET."
}