{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Theatre (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Theatre major at UC San Diego is designed to provide students with a comprehensive education in the art and craft of theatre. The program emphasizes the development of skills in acting, directing, playwriting, design, and technical theatre, as well as the study of theatre history and criticism. Students work closely with faculty and guest artists to create innovative productions that showcase their talents.",
  "shortProgramDescription": "The Theatre B.A. program at UC San Diego fosters students' artistic and intellectual growth through a rigorous curriculum in theatre practice and theory.",
  "classHighlights": [
    "Theatre Core Courses: Students take foundational courses in theatre, including Introduction to Theatre (THDN 10), Acting I (THDN 30), and Theatre History (THDN 120A-B). These courses provide a comprehensive understanding of theatre practices and history.",
    "Acting and Directing: Advanced courses in acting (THDN 130-131) and directing (THDN 140-141) allow students to refine their skills in performance and production.",
    "Playwriting and Dramaturgy: Courses in playwriting (THDN 150-151) and dramaturgy (THDN 160) enable students to explore the creation of new works and the analysis of existing ones.",
    "Design and Technical Theatre: Students can choose from a range of courses in design (THDN 170-171, THDN 172-173) and technical theatre (THDN 180), learning about the technical aspects of production.",
    "Theatre History and Criticism: Upper-division courses (THDN 120A-B, THDN 122) deepen students' understanding of theatre history, theory, and criticism."
  ],
  "learningOutcomes": [
    "Develop skills in acting, directing, playwriting, design, and technical theatre.",
    "Understand the historical and cultural contexts of theatre.",
    "Analyze and critique theatre productions.",
    "Collaborate effectively with others in the production process.",
    "Apply theoretical knowledge to practical work in theatre."
  ],
  "similarPrograms": [
    {
      "title": "Dance Minor",
      "link": "https://catalog.ucsd.edu/front/courses/theatre-and-dance-minor/"
    },
    {
      "title": "Theatre and Dance Major",
      "link": "https://catalog.ucsd.edu/front/courses/theatre-and-dance-major/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/front/courses/theatre-and-dance-major/",
    "https://theatredance.ucsd.edu/undergraduate-programs/theatre-ba/index.html"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system, though some students finish in 3 years)",
  "creditRequirements": "Total of 180 quarter units, with at least 65 upper-division units; major requirements comprise around 64-68 units",
  "additionalInformation": "The Theatre B.A. program is housed within the Department of Theatre and Dance. Students are encouraged to explore various aspects of theatre and to engage with the vibrant cultural scene at UC San Diego."
}