{
  "collegeName": "University of California, San Diego",
  "programType": "Major",
  "programName": "Urban Studies and Planning (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Urban Studies and Planning major provides students with a comprehensive understanding of urban issues, preparing them for careers in urban planning, policy, and related fields. The program covers topics such as urban development, transportation, housing, and community engagement, with a focus on social justice and equity.",
  "shortProgramDescription": "The Urban Studies and Planning B.A. at UC San Diego equips students with knowledge of urban issues, policy, and planning, preparing them for careers in government, non-profits, and private sectors.",
  "classHighlights": [
    "The core courses provide a foundation in urban studies, including USP1: Introduction to Urban Studies and Planning, USP2: Urban Analysis, and USP3: Urban Policy. These courses introduce students to key concepts, theories, and methods in urban studies.",
    "Students take courses in urban policy and planning, including USP110: Urban Policy, USP120: Urban Planning, and USP130: Transportation Planning. These courses cover topics such as urban development, land use, and transportation systems.",
    "Electives allow students to explore specialized topics, such as housing, community development, and environmental planning, through courses like USP142: Housing Policy, USP152: Community Development, and USP162: Environmental Planning.",
    "Research methods and data analysis are emphasized through courses like USP101: Research Methods in Urban Studies and Planning and USP102: Data Analysis for Urban Planning.",
    "Students can choose from a range of electives that cover various aspects of urban studies, including social justice, community engagement, and urban design."
  ],
  "learningOutcomes": [
    "Understand the historical and contemporary contexts of urban development and planning.",
    "Analyze urban issues and develop evidence-based solutions.",
    "Apply urban planning principles and practices to real-world problems.",
    "Evaluate the social, economic, and environmental impacts of urban policies and plans.",
    "Communicate effectively with diverse stakeholders, including community members, policymakers, and professionals."
  ],
  "similarPrograms": [
    {
      "title": "Urban Studies and Planning Minor",
      "link": "https://catalog.ucsd.edu/degreeinfo/Urban-Studies-and-Planning-Minor/"
    },
    {
      "title": "Environmental Studies",
      "link": "https://catalog.ucsd.edu/degreeinfo/Environmental-Studies-BA/"
    },
    {
      "title": "Global Studies",
      "link": "https://catalog.ucsd.edu/degreeinfo/Global-Studies-BA/"
    }
  ],
  "sources": [
    "https://catalog.ucsd.edu/curric/USP-ug.html",
    "https://usp.ucsd.edu/undergraduate-programs/urban-studies-and-planning-ba/index.html"
  ],
  "programDuration": "8 quarters (4 academic years, quarter system)",
  "creditRequirements": "180-182 quarter units",
  "additionalInformation": "Students must complete the required courses and electives as specified by the department, maintain a minimum GPA, and adhere to university policies regarding transfer credits and course repeats."
}