{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Aeronautics and Astronautics (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Bachelor of Science in Aeronautics and Astronautics is designed to provide students with a foundation in the fundamental disciplines of aerospace engineering, as well as the opportunity to pursue advanced coursework and research in areas such as aerodynamics, structures, dynamics and control, and propulsion. The program prepares students for careers in the aerospace industry, government, and research institutions, as well as for graduate study.",
  "shortProgramDescription": "The Aeronautics and Astronautics program at Stanford provides a comprehensive education in aerospace engineering, preparing students for diverse careers or further study.",
  "classHighlights": [
    "The program begins with foundational courses in mathematics (MATH 19-21, MATH 51-52), physics (PHYSICS 41, 43, 61, 65 or PHYSICS 21, 23, 81), and introductory engineering courses (AA 21, ENGR 40M). These lay the groundwork for more advanced study in aeronautics and astronautics.",
    "Core courses in Aeronautics and Astronautics include Aerodynamics (AA 214), Aerospace Structures (AA 237), Dynamics and Control (AA 214B), and Propulsion (AA 283). Students also complete a laboratory course (AA 100A or AA 100B) to gain hands-on experience.",
    "Students then choose from a range of electives to pursue their interests, including courses in aerodynamics, structures, dynamics and control, and propulsion. They may also take courses in related fields, such as computer science, mechanical engineering, or materials science.",
    "The program also includes a writing in the major requirement, which is fulfilled by taking a designated writing course, such as AA 141W.",
    "Additional electives allow students to explore topics such as aircraft design, space systems engineering, or aerospace materials."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of aeronautics and astronautics to design and analyze aerospace systems.",
    "Understand and apply mathematical and scientific principles to solve problems in aerospace engineering.",
    "Design and conduct experiments to test hypotheses and validate designs.",
    "Communicate complex technical concepts effectively in written and oral form.",
    "Work effectively in teams to solve complex problems.",
    "Understand the social, environmental, and economic context of aerospace engineering."
  ],
  "similarPrograms": [
    {
      "title": "Mechanical Engineering",
      "link": "https://me.stanford.edu"
    },
    {
      "title": "Aerospace Design Minor",
      "link": "https://aa.stanford.edu/academics/minor"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/AA-BS",
    "https://aa.stanford.edu/academics/undergraduate",
    "https://aa.stanford.edu/academics/bs-curriculum"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "Students declare through the School of Engineering. The program requires a minimum GPA in major courses. AP/IB credits may apply in consultation with department advisors."
}