{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "American Studies (BA)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of American Studies offers an undergraduate major in American Studies leading to a Bachelor of Arts degree. The program is designed to introduce students to the interdisciplinary study of the United States, drawing on a range of methodologies and fields in the humanities and social sciences. Students explore topics such as culture, history, literature, politics, and identity.",
  "shortProgramDescription": "The American Studies major at Stanford provides an interdisciplinary exploration of U.S. culture, history, and society, preparing students for a wide range of careers or further academic study.",
  "classHighlights": [
    "The introductory course, Introduction to American Studies (AMSTUD 101), provides a foundational understanding of the field, exploring key concepts, theories, and methodologies.",
    "Courses in the department are organized around thematic and historical areas, such as the history of the United States, American literature, and the cultural and social dynamics of American society.",
    "Students take courses that cover a range of historical periods and topics, from the colonial era to the present, and explore diverse themes such as identity, politics, and culture.",
    "Electives allow students to tailor their major to their interests, choosing from courses that span multiple departments and disciplines, including English, History, and Comparative Studies.",
    "The major requires a minimum of 45 units, with a senior seminar or research paper, ensuring students develop advanced research and analytical skills."
  ],
  "learningOutcomes": [
    "Understand the complex history and cultures of the United States through an interdisciplinary lens.",
    "Analyze the diverse experiences and representations of American identity.",
    "Apply critical methodologies to the study of American culture and society.",
    "Develop research, writing, and critical thinking skills.",
    "Engage with the ethical and social implications of their studies."
  ],
  "similarPrograms": [
    {
      "title": "English",
      "link": "https://english.stanford.edu"
    },
    {
      "title": "History",
      "link": "https://history.stanford.edu"
    },
    {
      "title": "Comparative Studies in Race and Ethnicity",
      "link": "https://csre.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/AMSTU-BA",
    "https://amstud.stanford.edu"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units in American Studies, plus additional university requirements; total approximately 180 quarter units",
  "additionalInformation": "Students are advised to consult with the American Studies department for specific advising and course selection."
}