{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Art History (BA)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Art and Art History offers undergraduate and graduate degrees in the study of the history of art. The undergraduate major in Art History is designed to provide students with a broad understanding of the history of art from a variety of cultures and historical periods. Students develop critical thinking, research, and writing skills through the study of art historical methods, theories, and practices.",
  "shortProgramDescription": "The Art History major at Stanford provides a comprehensive education in the history of art from diverse cultures and periods, focusing on critical analysis, research, and writing.",
  "classHighlights": [
    "The introductory course sequence, Introduction to the History of Art (ARTHIST 1A-1B) or Introduction to the History of Art: Renaissance to Modern (ARTHIST 2A-2B), provides a foundational understanding of the history of art from ancient to modern times.",
    "Students are required to take four pre-20th century period survey courses, which cover the history of art from ancient to modern times, including European and non-European traditions.",
    "Four upper-division courses provide in-depth study of specific art historical topics, such as style, iconography, and cultural context.",
    "The major requires four additional upper-division courses in Art History, allowing students to explore their interests in specific areas, such as Asian art, European painting, or contemporary art.",
    "Students are also required to take one course in a related field outside of Art History, such as history, literature, or anthropology, to broaden their understanding of the cultural and historical contexts of art."
  ],
  "learningOutcomes": [
    "Understand the history of art from diverse cultures and historical periods",
    "Analyze and interpret works of art within their cultural and historical contexts",
    "Develop critical thinking, research, and writing skills through the study of art historical methods and theories",
    "Apply art historical knowledge to contemporary issues and debates",
    "Cultivate an appreciation for the diversity of artistic traditions and practices"
  ],
  "similarPrograms": [
    {
      "title": "Modern Thought and Literature",
      "link": "https://bulletin.stanford.edu/programs/MTL-BA"
    },
    {
      "title": "History",
      "link": "https://bulletin.stanford.edu/programs/HISTORY-BA"
    },
    {
      "title": "Comparative Literature",
      "link": "https://bulletin.stanford.edu/programs/COMPLIT-BA"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/ARTHIST-BA",
    "https://arthistory.stanford.edu/undergraduate/major"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "55-60 units of Art History coursework, plus related field requirement; total approximately 180 quarter units",
  "additionalInformation": "The Art History major is designed to be flexible, allowing students to pursue their interests in specific areas of art history. The department also offers a range of courses in studio art, which can be taken in addition to the major requirements."
}