{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Biology (BS)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Department of Biology offers a Bachelor of Science degree in Biology, which provides a foundation in the principles of biology and prepares students for a wide range of careers in the life sciences. The program includes coursework in genetics, biochemistry, molecular biology, ecology, evolution, and more.",
  "shortProgramDescription": "Stanford's Biology BS provides a comprehensive education in the biological sciences, preparing students for careers or further study.",
  "classHighlights": [
    "The biology core curriculum includes Genetics and Molecular Biology (BIO44Y/BIO81/82), Biochemistry and Molecular Biology (BIOC44Y/BIOC121/122), and Ecology and Evolution (BIOE44Y/BIOE81/82).",
    "Students also complete a minimum of 7 additional biology or related courses, including at least one laboratory or research experience.",
    "Laboratory courses provide hands-on experience in experimental design, data collection, and analysis.",
    "Upper-level courses allow students to explore specialized topics in biology, such as developmental biology, immunology, and microbiology.",
    "Students can also take related courses in other departments, such as chemistry, physics, and mathematics, to broaden their understanding of biological principles."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of biology, including genetics, biochemistry, and ecology.",
    "Apply biological concepts to real-world problems.",
    "Design and conduct experiments to test hypotheses.",
    "Analyze and interpret biological data.",
    "Communicate complex biological concepts effectively."
  ],
  "similarPrograms": [
    {
      "title": "Biological Sciences Minor",
      "link": "https://bulletin.stanford.edu/programs/BIOL-MIN"
    },
    {
      "title": "Bioengineering",
      "link": "https://bioeng.stanford.edu"
    },
    {
      "title": "Chemistry",
      "link": "https://chemistry.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/BIO-BS",
    "https://biology.stanford.edu/undergraduate-program"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 total units, including 7 biology core courses and additional biology or related electives",
  "additionalInformation": "Students must declare the major through the Department of Biology. Course requirements may be adjusted in consultation with a departmental advisor."
}