{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Bioengineering (BS)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Bioengineering undergraduate major provides a broad foundation in the engineering and biological sciences, preparing students for a wide range of career opportunities in medicine, research, industry, and government. The program emphasizes the development of skills in problem-solving, critical thinking, and communication, as well as the ability to work effectively in interdisciplinary teams.",
  "shortProgramDescription": "Stanford's Bioengineering BS program integrates engineering principles with biological sciences to prepare students for careers or further study in bioengineering and related fields.",
  "classHighlights": [
    "The program begins with foundational courses in biology, chemistry, physics, and mathematics, including Introduction to Biology (BIO 43-45), General Chemistry (CHEM 31, 32, 33), Physics (PHYSICS 41, 43 or PHYSICS 21, 23), and Calculus (MATH 19, 20, 21 or MATH 41, 42).",
    "Students then progress to core bioengineering courses, such as Biomechanics (BIOE 131), Bioengineering Fundamentals (BIOE 221), and Biochemical Engineering (BIOE 205).",
    "Additional required courses include Biochemistry (BIOC 218 or BIO 82), Molecular Biology (BIO 83 or BIOC 219), and Statistics (STAT 116 or STAT 141).",
    "Students also complete a series of electives in bioengineering and related fields, chosen from a range of courses that include topics such as biomaterials, tissue engineering, and biomedical imaging.",
    "Throughout the program, students are encouraged to develop their skills in computational programming, data analysis, and scientific communication, with courses such as Programming Abstractions (CS 106B) and Bioengineering Laboratory (BIOE 192)."
  ],
  "learningOutcomes": [
    "Apply engineering principles to biological systems and medical devices",
    "Understand the biological sciences at the molecular, cellular, and systems levels",
    "Develop skills in problem-solving, critical thinking, and communication",
    "Work effectively in interdisciplinary teams",
    "Analyze and interpret data related to bioengineering and biological systems",
    "Communicate complex technical information to diverse audiences"
  ],
  "similarPrograms": [
    {
      "title": "Biomedical Engineering Minor",
      "link": "https://bioengineering.stanford.edu/academics/minor"
    },
    {
      "title": "Chemical Engineering",
      "link": "https://cheme.stanford.edu/academics/bs"
    },
    {
      "title": "Mechanical Engineering",
      "link": "https://me.stanford.edu/academics/bs"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/BIOE-BS",
    "https://bioengineering.stanford.edu/academics/ugrad/bs",
    "https://ughb.stanford.edu/majors-minors/bioengineering-program"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "Students declare through the School of Engineering. The major requires a minimum GPA of 2.0 in the major courses. Students are encouraged to participate in research and internship opportunities to gain practical experience in bioengineering."
}