{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Communication (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Communication at Stanford University offers an undergraduate major in Communication that provides students with a broad understanding of the field and its connections to other disciplines. The major is designed for students who wish to explore the ways in which communication shapes and is shaped by social, cultural, and political contexts. Students in the major choose from a range of courses that cover topics such as media studies, interpersonal communication, persuasion, and public discourse. The major prepares students for a variety of careers in fields such as media, public relations, advertising, and education, as well as for graduate study in Communication and related fields.",
  "shortProgramDescription": "The Communication major at Stanford University provides a comprehensive education in the study of communication, preparing students for careers or further study in related fields.",
  "classHighlights": [
    "The Communication major requires students to take a foundational course, Introduction to Communication (COMM 1), which introduces students to the field and its key concepts. Students also take a methods course, Research Methods in Communication (COMM 166), which provides training in research design and methodology.",
    "Students choose from a range of elective courses that cover topics such as media studies (COMM 124, COMM 140), interpersonal communication (COMM 127), persuasion (COMM 120), and public discourse (COMM 145). These courses allow students to explore specific areas of interest and develop their knowledge and skills in the field.",
    "Students also have the opportunity to take courses that focus on the intersection of communication and other disciplines, such as sociology, psychology, and politics. These courses provide students with a nuanced understanding of the complex relationships between communication and other social and cultural factors."
  ],
  "learningOutcomes": [
    "Understand the key concepts and theories in the field of Communication",
    "Apply research methods and methodologies to the study of communication phenomena",
    "Analyze the role of communication in shaping social, cultural, and political contexts",
    "Evaluate the impact of communication on individuals, groups, and society",
    "Develop effective communication skills in a variety of contexts",
    "Demonstrate an understanding of the complex relationships between communication and other disciplines"
  ],
  "similarPrograms": [
    {
      "title": "English",
      "link": "https://english.stanford.edu"
    },
    {
      "title": "Comparative Literature",
      "link": "https://complit.stanford.edu"
    },
    {
      "title": "Modern Thought and Literature",
      "link": "https://mtl.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/COMMU-BA",
    "https://communication.stanford.edu"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units in Communication, with additional units in related fields; total approximately 180 quarter units",
  "additionalInformation": "Students must declare the major through the Department of Communication. The major is designed to be flexible, allowing students to tailor their coursework to their interests and career goals."
}