{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Comparative Studies in Race and Ethnicity (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Comparative Studies in Race and Ethnicity major is an interdisciplinary program that examines the complex ways in which race and ethnicity shape individual and group experiences within historical and contemporary contexts. The program draws on a range of disciplines, including sociology, history, literature, and cultural studies, to provide students with a nuanced understanding of the ways in which race and ethnicity are constructed and deployed. Students develop critical thinking, research, and analytical skills through coursework and a senior research seminar.",
  "shortProgramDescription": "The CSRE major explores the social, cultural, and historical dimensions of race and ethnicity, preparing students for diverse careers or graduate study.",
  "classHighlights": [
    "Core Courses: The program requires foundational courses such as Introduction to Comparative Studies in Race and Ethnicity (CSRE 121), Methods in Comparative Studies (CSRE 200), and Theoretical Perspectives on Race and Ethnicity (CSRE 221/223), providing a critical framework for understanding the complex dynamics of race and ethnicity.",
    "Thematic Clusters: Students choose from thematic clusters such as 'Identity and Difference,' 'Power and Inequality,' and 'Culture and Representation,' allowing for exploration of specific areas of interest through upper-division electives.",
    "Disciplinary Foundations: Courses draw on multiple disciplines, including sociology (e.g., SOC 121), history (e.g., HIST 144C), and literature (e.g., ENGL 171), to provide a rich, interdisciplinary understanding of the field.",
    "Research and Analysis: Students develop advanced research and analytical skills, culminating in a senior research seminar where they produce an original research project."
  ],
  "learningOutcomes": [
    "Analyze the complex ways in which race and ethnicity are constructed and deployed in different historical and contemporary contexts.",
    "Apply critical theories and methodologies to understand the intersections of race, ethnicity, and other social categories.",
    "Develop advanced research skills, including the ability to design, conduct, and present original research.",
    "Cultivate critical thinking, writing, and analytical skills through engagement with diverse disciplinary perspectives.",
    "Understand the complex power dynamics and social inequalities related to race and ethnicity."
  ],
  "similarPrograms": [
    {
      "title": "African and African American Studies",
      "link": "https://bulletin.stanford.edu/programs/AAAS-BA"
    },
    {
      "title": "Feminist, Gender, and Sexuality Studies",
      "link": "https://bulletin.stanford.edu/programs/FGS-BA"
    },
    {
      "title": "Native American and Indigenous Studies",
      "link": "https://bulletin.stanford.edu/programs/NAIS-BA"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/CSRE-BA",
    "https://csre.stanford.edu",
    "https://exploredegrees.stanford.edu/undergraduate/comparative_studies_in_race_and_ethnicity_ba"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units minimum: 7 core courses (28–30 units), 3 cluster courses (12–15 units), and a senior research seminar (3–5 units); total approx.180 quarter units for the degree",
  "additionalInformation": "The major is open to students from all disciplines. Coursework can include relevant courses from departments such as Sociology, History, English, and Comparative Literature. Students are encouraged to pursue research and internship opportunities related to their interests in race and ethnicity."
}