{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "East Asian Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of East Asian Languages and Cultures offers an undergraduate major in East Asian Studies leading to the Bachelor of Arts degree. The major is designed for students who wish to develop an understanding of East Asia from an interdisciplinary perspective. Students are expected to acquire a broad knowledge of East Asia, including its history, cultures, and languages, as well as to develop a deeper understanding of a particular discipline or area of concentration.",
  "shortProgramDescription": "The East Asian Studies major at Stanford provides a comprehensive, interdisciplinary understanding of East Asia, preparing students to engage with the region's cultures, histories, and societies.",
  "classHighlights": [
    "Language and Literature: The major begins with foundational language courses in Chinese, Japanese, or Korean (first- and second-year levels), followed by advanced literature and culture courses. Students must demonstrate proficiency in an East Asian language.",
    "History and Culture: Courses cover the history, thought, and cultural practices of East Asia, including China, Japan, and Korea, from ancient times to the present. These courses explore diverse topics such as Buddhism, literature, art, and modern societal changes.",
    "Thematic and Disciplinary Courses: The program includes thematic courses that incorporate various disciplines, including history, literature, religious studies, and cultural studies, allowing students to contextualize their knowledge.",
    "Regional Focus: While the major encompasses East Asia as a whole, students can focus on specific countries or subregions through their choice of electives and research projects."
  ],
  "learningOutcomes": [
    "Demonstrate a broad understanding of East Asian cultures, histories, and societies.",
    "Acquire proficiency in an East Asian language.",
    "Analyze and interpret significant cultural, historical, and literary works from East Asia.",
    "Apply interdisciplinary perspectives to understand complex issues in East Asia.",
    "Conduct independent research using appropriate methodologies and sources."
  ],
  "similarPrograms": [
    {
      "title": "Asian American Studies",
      "link": "https://asianamericanstudies.stanford.edu"
    },
    {
      "title": "Comparative Literature",
      "link": "https://comparativelit.stanford.edu"
    },
    {
      "title": "History",
      "link": "https://history.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/EASST-BA",
    "https://eastasianlanguages.stanford.edu/undergraduate"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units minimum for the major; total approximately 180 quarter units for the B.A. degree",
  "additionalInformation": "Language proficiency is required; study abroad is encouraged but not required. Students declare the major through the Department of East Asian Languages and Cultures."
}