{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Economics (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Economics offers an undergraduate major in Economics leading to a Bachelor of Arts degree. The major provides students with a broad understanding of economic theory, econometrics, and applied economics, and prepares students for careers in a variety of fields, including government, finance, and research.",
  "shortProgramDescription": "The Economics B.A. program provides a comprehensive education in economic theory, econometrics, and applied economics, preparing students for diverse careers.",
  "classHighlights": [
    "Introductory courses: Students begin with Principles of Economics (ECON1/1V or ECON50/50V), followed by Intermediate Microeconomics (ECON102) and Intermediate Macroeconomics (ECON103), which introduce the fundamental concepts of economic analysis.",
    "Mathematical and statistical foundations: Students complete Econometrics (ECON140) and Mathematical Methods for Economic Analysis (ECON121 or 221), building the necessary mathematical and statistical tools for advanced coursework.",
    "Field courses: Students take at least four field courses, chosen from a range of offerings including Labor Economics, Public Finance, International Trade, and Monetary Economics, to deepen their understanding of specific economic areas.",
    "Electives and advanced courses: The major allows for additional electives in specialized topics, such as Economic Development, Econometrics, and Economic History, enabling students to tailor their education to their interests.",
    "Seminar and research courses: Students can participate in seminars and research courses, such as the Economics Honors Program, to engage in original research and advanced study."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of microeconomics and macroeconomics.",
    "Apply mathematical and statistical techniques to economic analysis.",
    "Analyze economic data and policy issues using econometric methods.",
    "Demonstrate an understanding of the historical and institutional context of economic systems.",
    "Communicate complex economic ideas clearly and effectively in writing and speech."
  ],
  "similarPrograms": [
    {
      "title": "Mathematical and Computational Science",
      "link": "https://mcs.stanford.edu"
    },
    {
      "title": "International Relations",
      "link": "https://fsi.stanford.edu/education/undergraduate/international-relations"
    },
    {
      "title": "Public Policy",
      "link": "https://publicpolicy.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/ECON-BA",
    "https://economics.stanford.edu/undergraduate-program",
    "https://economics.stanford.edu/undergraduate/handbook"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units of Economics courses, plus required math and other prerequisites; total approximately 180 quarter units",
  "additionalInformation": "Students are advised to consult with the Economics Department for specific requirements and advising. Transfer credits and AP/IB credits may be applied with department approval."
}