{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "English (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of English offers a program of study leading to a Bachelor of Arts degree in English. The undergraduate major is designed to give students a broad understanding of English literature, including the historical development of the language, literary genres, and major authors. Students develop skills in close reading, critical thinking, and written and oral communication.",
  "shortProgramDescription": "The English major at Stanford provides a comprehensive education in English literature, preparing students for diverse careers or further study.",
  "classHighlights": [
    "📚 **Introductory Courses**: Students typically begin with introductory courses such as Introduction to Creative Writing (ENGL 110) or Introduction to Literary Studies (ENGL 171), which lay the groundwork for more advanced study.",
    "🕰️ **Historical Surveys**: Courses like English Literature: From the Beginnings to 1700 (ENGL 174A) and English Literature: 1700 to the Present (ENGL 174B) provide a historical framework for understanding the development of English literature.",
    "📝 **Genre and Period Courses**: Students explore various genres and periods through courses such as Shakespeare (ENGL 121A-B), The English Novel (ENGL 142), and Modern and Contemporary Literature (ENGL 146).",
    "💡 **Theoretical and Contextual Approaches**: Courses like Critical Approaches to Literature (ENGL 191) and Literary Theory (ENGL 294) introduce students to various theoretical and contextual approaches to literary study.",
    "📄 **Seminars and Senior Seminars**: Advanced seminars, including Senior Seminars (ENGL 195), allow students to engage deeply with specific topics and develop their research and writing skills."
  ],
  "learningOutcomes": [
    "Demonstrate a broad knowledge of English literature across historical periods and genres.",
    "Analyze literary texts critically and thoughtfully.",
    "Develop effective written and oral communication skills.",
    "Understand various theoretical and contextual approaches to literary study.",
    "Apply close reading skills to interpret literary texts.",
    "Produce well-researched and well-argued written work."
  ],
  "similarPrograms": [
    {
      "title": "Comparative Literature",
      "link": "https://complit.stanford.edu"
    },
    {
      "title": "Modern Thought and Literature",
      "link": "https://mtl.stanford.edu"
    },
    {
      "title": "English Minor",
      "link": "https://english.stanford.edu/undergrad/requirements/minor"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/ENGL-BA",
    "https://english.stanford.edu/undergrad/requirements/major",
    "https://undergrad.stanford.edu/programs/english-major"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 English department units; total approx. 180 quarter units",
  "additionalInformation": "Students declare through the School of Humanities and Sciences. Course choices should be made in consultation with an adviser to ensure breadth and depth in the major."
}