{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Human Biology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Human Biology Major is an interdisciplinary program that focuses on the study of human health, the factors that influence health, and the ways that health can be improved. It allows students to explore the biology of human health and disease, the impact of social and environmental factors on health, and the development of interventions to promote health.",
  "shortProgramDescription": "The Human Biology Major provides students with a comprehensive understanding of human health and disease, and prepares them for a variety of careers in the health field.",
  "classHighlights": [
    "The Human Biology core (HUMBIO3N, HUMBIO4, HUMBIO105A, HUMBIO105B, HUMBIO106) provides foundational knowledge in human biology, including the biological and social factors that influence health.",
    "Students take additional courses in biology, chemistry, and statistics, including Genetics and Molecular Biology (BIO44), Biochemistry (CHEM152/153), and Statistical Methods in the Biological Sciences (STAT216/STAT243).",
    "The major also includes a range of electives that allow students to explore specific topics in human biology, such as epidemiology, nutrition, and global health.",
    "Students can choose from a variety of tracks, including the standard track, the honors track, and the concentration in Health and Society."
  ],
  "learningOutcomes": [
    "Understand the biological and social factors that influence human health and disease.",
    "Apply knowledge of human biology to real-world problems and issues.",
    "Analyze data and research related to human health and disease.",
    "Communicate effectively about human biology and health issues.",
    "Think critically and creatively about the complex factors that influence human health."
  ],
  "similarPrograms": [
    {
      "title": "Biology",
      "link": "https://biology.stanford.edu/undergraduate-program/major"
    },
    {
      "title": "Psychology",
      "link": "https://psychology.stanford.edu/undergraduate-program/major"
    },
    {
      "title": "Public Health",
      "link": "https://healthpolicy.stanford.edu/academics/undergraduate"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/HUMBI-BS",
    "https://humbio.stanford.edu/undergraduate-program/major"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units",
  "additionalInformation": "The Human Biology Major is open to students from a variety of backgrounds and disciplines. Students are encouraged to explore the many research opportunities available through the department and to pursue a senior thesis or research project."
}