{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Individually Designed Major in Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Individually Designed Major in Engineering is a flexible program that enables undergraduates to propose, design, and complete an interdisciplinary engineering curriculum tailored to their individual interests and career goals. Students work with a faculty adviser to define a coherent program that combines courses from multiple engineering disciplines and related fields, such as the natural sciences, mathematics, and computer science. The program is ideal for students whose interests span traditional departmental boundaries or who wish to integrate engineering with other disciplines.",
  "shortProgramDescription": "Stanford's Individually Designed Major in Engineering allows students to create a customized, interdisciplinary program combining multiple engineering disciplines with other fields.",
  "classHighlights": [
    "Students must complete a minimum of 96 units in engineering and related fields, with at least 48 units from the School of Engineering.",
    "Courses must be selected from multiple engineering disciplines and related fields, such as natural sciences, mathematics, and computer science.",
    "The program requires a coherent set of courses that aligns with the student's stated academic and career goals.",
    "At least 55 units must be taken for a letter grade, and students must maintain a minimum GPA in their Individually Designed Major courses.",
    "Students work with a faculty adviser to design and approve their program, ensuring it meets the University's and School of Engineering's requirements."
  ],
  "learningOutcomes": [
    "Design and complete an interdisciplinary engineering curriculum tailored to individual interests and career goals.",
    "Integrate knowledge from multiple engineering disciplines and related fields.",
    "Apply engineering principles to solve complex problems.",
    "Communicate effectively about their academic and professional plans.",
    "Meet the University's and School of Engineering's academic requirements."
  ],
  "similarPrograms": [
    {
      "title": "Aeronautics and Astronautics (B.S.)",
      "link": "https://bulletin.stanford.edu/programs/AA-BS"
    },
    {
      "title": "Bioengineering (B.S.)",
      "link": "https://bulletin.stanford.edu/programs/BIOEN-BS"
    },
    {
      "title": "Mechanical Engineering (B.S.)",
      "link": "https://bulletin.stanford.edu/programs/ME-BS"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/IDMEN-BS",
    "https://engineering.stanford.edu/"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "Minimum 180 quarter units, including at least 96 units in engineering and related fields",
  "additionalInformation": "Students must petition for and be approved to enter the program; a faculty adviser is required. Students must maintain a minimum GPA and complete the required units for a letter grade."
}