{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Jewish Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Jewish Studies program is an interdisciplinary field that explores the diverse cultural, historical, religious, and literary traditions associated with Jewish identity and communities. Students engage with a range of topics, from biblical and rabbinic texts to modern Jewish history, literature, and culture. Through coursework and research, students develop a nuanced understanding of Jewish experiences, analyzing the complexities and richness of Jewish heritage within various global contexts.",
  "shortProgramDescription": "Stanford's Jewish Studies B.A. offers an interdisciplinary exploration of Jewish history, culture, and identity, preparing students for diverse careers or further study.",
  "classHighlights": [
    "📜 **Foundational Texts**: Courses such as Introduction to Jewish Studies (JEWST100A), Biblical Narrative (JEWST101), and Talmudic Narrative (JEWST102) introduce students to classical Jewish texts and interpretive methods, developing foundational knowledge of Jewish literature and religious traditions.",
    "🕊️ **History and Culture**: Classes like Modern Jewish History (JEWST145) and Jews in America (JEWST147) explore Jewish historical experiences, cultural adaptations, and identity formation across time and geography, fostering an understanding of Jewish communities in diverse contexts.",
    "📚 **Language and Literature**: Students can engage with Jewish literature and language through courses like Hebrew Literature (JEWST110), Modern Hebrew (HEBREW), and Jewish American Literature (JEWST149), building linguistic proficiency and literary analysis skills.",
    "🌐 **Thematic and Contemporary Issues**: Courses such as Jewish Ethics (JEWST106), Jews and the Mediterranean (JEWST125), and Gender and Sexuality in Jewish Culture (JEWST135) allow students to explore contemporary and thematic issues in Jewish Studies, integrating historical perspectives with modern concerns.",
    "🎓 **Advanced Research and Electives**: Students complete advanced courses and seminars, such as Senior Seminar in Jewish Studies (JEWST190), and choose electives that align with their interests, developing specialized knowledge and analytical skills."
  ],
  "learningOutcomes": [
    "Analyze Jewish texts, history, and culture within their historical and cultural contexts.",
    "Understand the diversity of Jewish experiences and identity formations.",
    "Apply interdisciplinary approaches to the study of Jewish Studies.",
    "Communicate complex ideas and research findings effectively in written and oral forms.",
    "Engage critically with Jewish heritage, literature, and contemporary issues."
  ],
  "similarPrograms": [
    {
      "title": "Religious Studies",
      "link": "https://religiousstudies.stanford.edu"
    },
    {
      "title": "Comparative Literature",
      "link": "https://complit.stanford.edu"
    },
    {
      "title": "History",
      "link": "https://history.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/JEWSH-BA",
    "https://jewishstudies.stanford.edu"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units of Jewish Studies coursework, including foundational courses and advanced electives; total approx. 180 quarter units for the B.A. degree",
  "additionalInformation": "Students are encouraged to study abroad in relevant programs and to engage in research or community projects related to Jewish Studies. Honors and research opportunities are available for qualified students."
}