{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Mathematics (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Mathematics major is designed to provide a broad foundation in the major areas of mathematics and to develop students' ability to critically analyze and solve problems using mathematical reasoning. The program includes a range of courses in pure and applied mathematics, as well as the opportunity to explore advanced topics through electives.",
  "shortProgramDescription": "The Mathematics B.S. at Stanford provides a comprehensive education in mathematical theory and application, preparing students for graduate study or careers in fields requiring strong analytical skills.",
  "classHighlights": [
    "The Mathematics Core: Students complete a series of foundational courses including Calculus (MATH 19-21), Linear Algebra and Applications (MATH 51 or 151), and Introduction to Mathematical Reasoning (MATH 41 or 61CM). These courses provide a rigorous introduction to the principles of mathematics.",
    "Analysis and Algebra: Advanced courses in real analysis (MATH 161A-B) and abstract algebra (MATH 113) deepen understanding of mathematical structures and proof-based reasoning. Students also engage with topics such as complex analysis and number theory.",
    "Applied Mathematics and Electives: Students choose from a range of electives that apply mathematical principles to areas like physics, computer science, and engineering. Courses in differential equations, numerical analysis, and mathematical modeling are popular choices, allowing students to tailor their degree to their interests.",
    "Upper-Level Mathematics: Advanced electives enable students to explore specialized areas, including topology, differential geometry, and probability theory, preparing them for sophisticated mathematical applications or further academic study."
  ],
  "learningOutcomes": [
    "Demonstrate a strong foundation in calculus, linear algebra, and mathematical reasoning.",
    "Apply mathematical principles to solve problems in pure and applied contexts.",
    "Understand and construct rigorous mathematical proofs.",
    "Analyze and model real-world phenomena using mathematical techniques.",
    "Communicate complex mathematical concepts effectively."
  ],
  "similarPrograms": [
    {
      "title": "Statistics",
      "link": "https://statistics.stanford.edu/undergrad/statistics-major"
    },
    {
      "title": "Mathematical and Computational Science",
      "link": "https://mcs.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/MATH-BS",
    "https://math.stanford.edu/undergrad/handbook"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units, including 45 units of mathematics at the 100-level or above",
  "additionalInformation": "Students must declare the major through the Mathematics Department. Course choices should be made in consultation with a departmental adviser to ensure alignment with academic and career goals."
}