{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Materials Science and Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The undergraduate major in Materials Science and Engineering (MSE) at Stanford provides a broad foundation in the properties and applications of materials, with a strong emphasis on the underlying science and engineering principles. The program is designed to be flexible, allowing students to balance depth in their chosen field with exploration of related areas. Students engage with core coursework in materials properties, processing, and characterization, as well as advanced electives and laboratory experiences, culminating in a comprehensive understanding of materials science and its applications.",
  "shortProgramDescription": "The Materials Science and Engineering B.S. at Stanford equips students with a deep understanding of materials properties, applications, and the underlying science, preparing them for diverse careers or further study.",
  "classHighlights": [
    "Materials Fundamentals: Students learn about the structure, properties, and performance of materials through courses like Materials Science and Engineering (MATSCI 151) and Thermodynamics of Materials (MATSCI 152), building a foundational understanding of materials science.",
    "Materials Processing and Characterization: Courses such as Materials Processing (MATSCI 156) and Materials Characterization (MATSCI 158) teach students about various techniques for processing and analyzing materials, providing hands-on experience with laboratory equipment and methods.",
    "Laboratory and Research Experience: The MSE laboratory requirement (MATSCI 161 and MATSCI 162) and additional electives in materials science and engineering allow students to gain practical experience in materials characterization, synthesis, and application.",
    "Advanced Electives and Specializations: Students can choose from a range of advanced electives, including courses on biomaterials, nanomaterials, electronic materials, and more, allowing for specialization in areas of interest.",
    "MSE Curriculum Structure: The program requires a total of 11 core courses, including materials science fundamentals, processing, and characterization, as well as laboratory experiences, and an additional 3-4 elective courses in materials science or related fields."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles governing the structure, properties, and performance of materials.",
    "Apply materials science and engineering principles to design, process, and characterize materials.",
    "Demonstrate proficiency in materials laboratory techniques and equipment.",
    "Analyze and solve problems related to materials selection, processing, and application.",
    "Communicate complex materials science concepts effectively in written and oral forms.",
    "Recognize the societal, environmental, and economic impacts of materials science and engineering."
  ],
  "similarPrograms": [
    {
      "title": "Chemical Engineering",
      "link": "https://bulletin.stanford.edu/programs/CHE-BS"
    },
    {
      "title": "Mechanical Engineering",
      "link": "https://bulletin.stanford.edu/programs/ME-BS"
    },
    {
      "title": "Engineering Minor",
      "link": "https://engineering.stanford.edu/students/engineering-minor"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/MATSC-BS",
    "https://mse.stanford.edu/undergraduate-program",
    "https://mse.stanford.edu/academics"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "180 quarter units (minimum), including major requirements, GERs, and electives",
  "additionalInformation": "The MSE major is offered through the School of Engineering. Students must declare the major through the School of Engineering and meet specific GPA and course requirements. Research and internship opportunities are available, and students are encouraged to explore these to enhance their undergraduate experience."
}