{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Music (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Music offers an undergraduate major leading to a Bachelor of Arts degree in Music. The program provides a comprehensive education in music theory, history, and performance, and is designed to be flexible enough to accommodate students with diverse musical backgrounds and interests. Students are encouraged to explore the full range of musical styles and genres, from classical to jazz and beyond.",
  "shortProgramDescription": "The Music B.A. at Stanford provides a broad education in music theory, history, and performance, preparing students for a wide range of musical pursuits.",
  "classHighlights": [
    "The music major requires a minimum of 55 units of music coursework, including courses in music theory, history, and performance. Students must complete a core sequence in music theory (MUSIC 106A-B-C), as well as a series of music history courses (MUSIC 208A-B-C).",
    "Students must also complete a minimum of 6 units of ensemble performance (MUSIC 105, 205, or 305), and may choose to pursue additional performance studies through private lessons or additional ensemble participation.",
    "Music electives allow students to explore specialized areas such as jazz studies, music technology, or musicology, and may include courses such as Improvisation (MUSIC 156), Music and Technology (MUSIC 218), or Topics in Musicology (MUSIC 256).",
    "The department also offers a range of courses that integrate music with other disciplines, such as the humanities, social sciences, or natural sciences, allowing students to contextualize their musical studies within a broader liberal arts framework."
  ],
  "learningOutcomes": [
    "Demonstrate a comprehensive understanding of music theory and history",
    "Perform at a high level in their chosen instrument or voice",
    "Analyze and interpret musical works from diverse styles and periods",
    "Communicate effectively about music in written and oral forms",
    "Apply musical knowledge and skills in a variety of contexts, including performance, composition, and musicology"
  ],
  "similarPrograms": [
    {
      "title": "Music Minor",
      "link": "https://bulletin.stanford.edu/programs/MUSIC-MN"
    },
    {
      "title": "Arts Institute",
      "link": "https://arts.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/MUSIC-BA",
    "https://music.stanford.edu/undergraduate"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "At least 55 music units; total approximately 180 quarter units",
  "additionalInformation": "Students must declare the major through the Department of Music and maintain satisfactory progress in music theory, history, and performance. Opportunities for research, honors, and study abroad are available."
}