{
  "collegeName": "Stanford University",
  "programType": "Major",
  "programName": "Sociology (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Sociology major provides a framework for analyzing social structures, institutions, and relationships. Students examine how social forces shape individual and group outcomes, and how individuals and groups, in turn, influence social structures. The major prepares students for careers in fields such as research, policy, education, law, business, and non-profit organizations, as well as for graduate study in sociology and related fields.",
  "shortProgramDescription": "The Sociology B.A. at Stanford equips students to understand social dynamics, inequalities, and institutions, preparing them for a range of careers or further study.",
  "classHighlights": [
    "The introductory course, Introduction to Sociology (SOC1), provides a broad overview of the field, covering key concepts, theories, and methods. Additional foundational courses include Sociological Theory (SOC142) and Sociological Research Methods (SOC61).",
    "Students take a range of core courses that explore specific sociological topics, such as social inequality, identity, culture, and institutions. These courses include Race and Ethnic Relations (SOC140), Sociology of Gender (SOC147), and The Sociology of Organizations (SOC153).",
    "Sociology electives allow students to delve deeper into specialized areas, such as social movements, education, or the sociology of law. Students may choose from a variety of courses, including Social Movements (SOC145), The Sociology of Education (SOC149), and Crime and Delinquency (SOC152).",
    "Methods and statistics courses, such as Sociological Research Methods (SOC61) and Statistics for Sociologists (SOC162), provide students with the skills to design and conduct sociological research, analyze data, and interpret findings."
  ],
  "learningOutcomes": [
    "Analyze social structures, institutions, and relationships using sociological theories and concepts.",
    "Design and conduct sociological research using appropriate methods and techniques.",
    "Critically evaluate social phenomena and identify the social, cultural, and economic factors that shape individual and group outcomes.",
    "Communicate complex sociological ideas and research findings effectively in written and oral forms.",
    "Apply sociological insights to understand and address social issues and problems."
  ],
  "similarPrograms": [
    {
      "title": "Comparative Studies in Race and Ethnicity",
      "link": "https://csre.stanford.edu"
    },
    {
      "title": "Feminist, Gender, and Sexuality Studies",
      "link": "https://fgs.stanford.edu"
    },
    {
      "title": "Urban Studies",
      "link": "https://urbanstudies.stanford.edu"
    }
  ],
  "sources": [
    "https://bulletin.stanford.edu/programs/SOCIO-BA",
    "https://sociology.stanford.edu/undergraduate-program"
  ],
  "programDuration": "12 quarters (4 academic years, quarter system)",
  "creditRequirements": "45 units (quarter system)",
  "additionalInformation": "Students declare the Sociology major through the School of Humanities and Sciences. The major is flexible, allowing students to tailor their coursework to their interests and career goals."
}