[
  {
    "id": "stanford",
    "name": "Stanford University",
    "description": "A top private university near Silicon Valley, known for innovation and leadership in technology, business, and the humanities. Its alumni include numerous tech founders, scholars, and global leaders.",
    "imageUrl": "/images/stanford.png",
    "website": "https://www.stanford.edu",
    "path": "/stanford"
  },
  {
    "id": "ucberkeley",
    "name": "University of California, Berkeley",
    "description": "A leading public university renowned for its rigorous academics, activism, and pioneering research. It has produced Nobel laureates, influential thinkers, and social change movements.",
    "imageUrl": "/images/ucberkeley.png",
    "website": "https://www.berkeley.edu",
    "path": "/ucberkeley"
  },
  {
    "id": "ucla",
    "name": "University of California, Los Angeles",
    "description": "A top public university known for excellence in medicine, engineering, arts, and athletics. Its vibrant campus life and location in Los Angeles make it a hub of culture and innovation.",
    "imageUrl": "/images/ucla.png",
    "website": "https://www.ucla.edu",
    "path": "/ucla"
  },
  {
    "id": "ucsd",
    "name": "University of California, San Diego",
    "description": "A coastal research university known for its strengths in oceanography, biotechnology, and engineering. UCSD fosters interdisciplinary collaboration and forward-thinking science.",
    "imageUrl": "/images/ucsd.png",
    "website": "https://www.ucsd.edu",
    "path": "/ucsandiego"
  },
  {
    "id": "purdue",
    "name": "Purdue University",
    "description": "A major public university in Indiana with a strong focus on engineering, aerospace, and computer science. Purdue is home to a robust research community and space exploration legacy.",
    "imageUrl": "/images/purdue.png",
    "website": "https://www.purdue.edu",
    "path": "/purdue"
  },
  {
    "id": "harvard",
    "name": "Harvard University",
    "description": "An Ivy League university in Cambridge, Massachusetts, known for academic rigor and a legacy of leadership. Harvard excels in fields like law, medicine, business, and the social sciences.",
    "imageUrl": "/images/harvard.png",
    "website": "https://www.harvard.edu",
    "path": "/harvard"
  },
  {
    "id": "yale",
    "name": "Yale University",
    "description": "A historic Ivy League institution in Connecticut with strengths in liberal arts, law, and the performing arts. Yale is known for its collegiate traditions and cultural influence.",
    "imageUrl": "/images/yale.png",
    "website": "https://www.yale.edu",
    "path": "/yale"
  },
  {
    "id": "cornell",
    "name": "Cornell University",
    "description": "An Ivy League university in upstate New York that blends public and private colleges. Cornell is recognized for academic diversity and a scenic, rural campus environment.",
    "imageUrl": "/images/cornell.png",
    "website": "https://www.cornell.edu",
    "path": "/cornell"
  },
  {
    "id": "mit",
    "name": "Massachusetts Institute of Technology",
    "description": "A global leader in science, engineering, and technology education and research. MIT is celebrated for innovation, entrepreneurship, and shaping the future of industries.",
    "imageUrl": "/images/mit.svg",
    "website": "https://www.mit.edu",
    "path": "/mit"
  }
]
