{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Aerospace Engineering and Business Administration",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Aerospace Engineering and Business Administration program is an interdisciplinary program that combines the technical aspects of aerospace engineering with the foundational elements of business administration. Students in this program gain a deep understanding of aerospace engineering principles, including aerodynamics, propulsion, and systems engineering, alongside business fundamentals such as management, marketing, and finance. The program is designed to prepare students for careers at the intersection of technology and business, particularly in industries related to aerospace and related sectors.",
  "shortProgramDescription": "This program integrates aerospace engineering with business administration, preparing students for leadership roles in aerospace and related industries.",
  "classHighlights": [
    "The program includes foundational courses in aerospace engineering such as Aerodynamics (AE 131), Propulsion (AE 135), and Aerospace Systems (AE 160), which provide a comprehensive technical background.",
    "Students also complete a series of business administration courses, including Financial Management (BA 103), Marketing Management (BA 120), and Organizational Behavior (BA 130A), to develop their understanding of business principles and practices.",
    "Additional engineering coursework includes Mathematics (Math 53, 54, 55), Physics (Physics 7A, 7B), and other engineering core courses, ensuring a strong foundation in the sciences and engineering disciplines.",
    "The business administration component includes courses on accounting, finance, and management, providing a well-rounded education in business administration.",
    "Technical electives allow students to explore specialized topics in aerospace engineering, while business electives offer further depth in areas such as finance, marketing, or organizational behavior."
  ],
  "learningOutcomes": [
    "Apply aerospace engineering principles to design and analyze aerospace systems.",
    "Understand and apply business administration concepts to manage and lead organizations.",
    "Integrate technical knowledge with business acumen to solve complex problems.",
    "Communicate effectively with both technical and non-technical stakeholders.",
    "Analyze market trends and make informed decisions based on data and business principles.",
    "Demonstrate an understanding of the ethical and societal implications of aerospace engineering and business practices."
  ],
  "similarPrograms": [
    {
      "title": "Mechanical Engineering",
      "link": "https://me.berkeley.edu/undergraduate"
    },
    {
      "title": "Business Administration",
      "link": "https://haas.berkeley.edu/undergraduate"
    },
    {
      "title": "Industrial Engineering and Operations Research",
      "link": "https://ieor.berkeley.edu/undergraduate"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/aerospace-engineering-business-administration",
    "https://aero.berkeley.edu",
    "https://haas.berkeley.edu/undergraduate/major"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of approximately 120-128 semester units, including major and breadth requirements",
  "additionalInformation": "Students must complete lower division requirements in both aerospace engineering and business administration before advancing to upper division coursework. The program is highly interdisciplinary and requires careful planning to ensure all requirements are met within four years."
}