{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "American Studies (BA)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The American Studies major is an interdisciplinary program that examines the history, culture, and society of the United States from a variety of perspectives. Students explore the complexities of American identity, culture, and politics through coursework in departments such as English, History, Ethnic Studies, and others. The major emphasizes critical thinking, research, and analytical writing skills.",
  "shortProgramDescription": "The American Studies major provides a comprehensive understanding of American culture, history, and society through an interdisciplinary approach.",
  "classHighlights": [
    "Foundational Courses: The major begins with introductory courses such as American Studies 101, which introduces students to the field's key concepts and methodologies.",
    "Historical Perspectives: Courses like History 105A-B-C (History of the United States) provide a comprehensive historical framework for understanding American society.",
    "Literary and Cultural Analysis: English and Comparative Literature courses, such as English 166 (American Literature), allow students to analyze American cultural production.",
    "Thematic and Topical Courses: American Studies and related departments offer courses on specific themes, such as race, gender, and politics, enabling students to explore American culture in depth.",
    "Electives and Concentrations: Students select from a range of electives to create a personalized course of study, potentially focusing on areas like cultural studies, social justice, or historical preservation."
  ],
  "learningOutcomes": [
    "Analyze American culture, history, and society from multiple disciplinary perspectives.",
    "Apply critical thinking and research skills to understand complex social and cultural phenomena.",
    "Develop written and oral communication skills appropriate for a range of audiences.",
    "Understand the historical and cultural contexts shaping American identity.",
    "Engage with diverse perspectives and methodologies in the study of America."
  ],
  "similarPrograms": [
    {
      "title": "Ethnic Studies",
      "link": "https://ethnicstudies.berkeley.edu/undergraduate/major"
    },
    {
      "title": "History",
      "link": "https://history.berkeley.edu/undergraduate/major"
    },
    {
      "title": "English",
      "link": "https://english.berkeley.edu/undergraduate/major"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/american-studies",
    "https://americanstudies.berkeley.edu"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 total units (semester credits)",
  "additionalInformation": "The major requires a minimum of 36 units of upper-division coursework in American Studies and related fields. Students must maintain a GPA of 2.0 or higher in major coursework. The major is designed to be completed within four years, assuming a standard course load per semester."
}