{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "American Studies (BA)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The American Studies major is an interdisciplinary program that examines the history, culture, and politics of the United States. Students explore the complex experiences and identities that have shaped American society, from the colonial era to the present. The major emphasizes the importance of understanding the diversity of American cultures and the ways in which they have been represented in various forms of media and art.",
  "shortProgramDescription": "The American Studies major provides students with a nuanced understanding of American culture, history, and politics, preparing them for careers in fields such as education, law, journalism, and public policy.",
  "classHighlights": [
    "The American Studies major requires students to take a series of core courses that introduce them to the field's key concepts and methodologies. These courses include 'Introduction to American Studies,' 'The United States Since 1945,' and 'Approaches to American Culture.'",
    "Students then choose from a range of electives that allow them to explore specific topics in more depth, such as 'American Cultural History,' 'Racial and Ethnic Identity in America,' and 'American Literature and Culture.'",
    "The major also includes a range of upper-division courses that provide students with advanced training in research and analysis, such as 'Senior Seminar in American Studies' and 'American Studies Research Methods.'"
  ],
  "learningOutcomes": [
    "Analyze the complex cultural, historical, and political contexts that have shaped American society",
    "Understand the diversity of American experiences and identities",
    "Apply interdisciplinary methodologies to the study of American culture and society",
    "Develop effective research and writing skills",
    "Critically evaluate representations of American culture in various forms of media and art"
  ],
  "similarPrograms": [
    {
      "title": "History",
      "link": "https://history.berkeley.edu/undergraduate/major"
    },
    {
      "title": "English",
      "link": "https://english.berkeley.edu/undergraduate/major"
    },
    {
      "title": "Ethnic Studies",
      "link": "https://ethnicstudies.berkeley.edu/undergraduate/major"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/american-studies",
    "https://americanstudies.berkeley.edu/"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 units (semester system)",
  "additionalInformation": "The American Studies major is designed to be completed in four years. Students are encouraged to study abroad and to participate in internships and research projects."
}