{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Art Practice (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Art Practice major at UC Berkeley provides a comprehensive studio art education within a rigorous liberal arts context. Students explore a range of media, including drawing, painting, sculpture, photography, video, and digital art. The program emphasizes technical skill, creative experimentation, and critical thinking, preparing students for careers in the arts or further study.",
  "shortProgramDescription": "The Art Practice B.A. program at UC Berkeley offers a diverse studio art education within a liberal arts framework, fostering technical expertise and creative growth.",
  "classHighlights": [
    "Studio Art Foundations: Students complete foundational studio courses (ART 1-6) that introduce various media and techniques, establishing a broad base for artistic exploration.",
    "Intermediate Studio Practice: Majors take intermediate-level studio courses (ART 101-106) that deepen technical skills and encourage creative experimentation across multiple media.",
    "Advanced Studio Work: Advanced courses (ART 201-206) allow students to focus on specific artistic areas, developing a personal practice and preparing for professional or graduate paths.",
    "Art History and Theory: The program includes art history and theory requirements, ensuring students understand their work within historical and contemporary contexts.",
    "Critical Studies and Writing: Courses emphasize critical thinking and writing about art, preparing students to contextualize their work and articulate their artistic vision.",
    "Senior Gateway and Exhibition: Students complete a senior-level gateway course and participate in a department exhibition, demonstrating their technical and creative accomplishments."
  ],
  "learningOutcomes": [
    "Develop technical proficiency in a range of artistic media.",
    "Cultivate creative problem-solving and experimentation skills.",
    "Understand contemporary art practices and historical contexts.",
    "Analyze and articulate the conceptual underpinnings of their work.",
    "Prepare a professional body of work for exhibition or further study.",
    "Apply critical thinking to their artistic practice and the broader art world."
  ],
  "similarPrograms": [
    {
      "title": "History of Art",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/history-art"
    },
    {
      "title": "Media Studies",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/media-studies"
    },
    {
      "title": "Theater, Dance, and Performance Studies",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/theater-dance-performance-studies"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/art-practice",
    "https://art.berkeley.edu",
    "https://www.berkeley.edu/catalog"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 total units (semester system); specific distribution requirements within the major",
  "additionalInformation": "Students must declare the major through the College of Letters & Science. The program encourages study abroad and internship opportunities. GPA and other performance thresholds may apply for major declaration and satisfactory completion."
}