{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Atmospheric Science (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Atmospheric Science major provides a foundation in the science of the atmosphere, including its dynamics, thermodynamics, and physics. The program focuses on understanding the Earth's climate system, weather patterns, and the impact of human activities on the atmosphere. Students gain a broad understanding of atmospheric science and its applications, preparing them for careers in research, education, government, and private industry.",
  "shortProgramDescription": "The Atmospheric Science B.S. program at UC Berkeley provides a comprehensive education in atmospheric dynamics, climate science, and weather patterns, preparing students for careers or graduate study in the field.",
  "classHighlights": [
    "The Atmospheric Science major requires a strong foundation in mathematics and physics, including courses such as Calculus (MATH 1A-1B), Differential Equations (MATH 54), and Physics (PHYSICS 7A-7B).",
    "Core courses in atmospheric science cover topics such as atmospheric dynamics, thermodynamics, and climate science, including Introduction to Atmospheric Dynamics (EPS 101), Atmospheric Physics (EPS 131), and Climate Change (EPS C104).",
    "Electives allow students to explore specialized areas, including courses on weather forecasting, air quality, and climate modeling, such as Weather Forecasting (EPS 141) and Atmospheric Chemistry (EPS C161)."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of atmospheric dynamics, thermodynamics, and physics.",
    "Analyze and interpret data related to weather patterns and climate trends.",
    "Apply knowledge of atmospheric science to real-world problems, such as weather forecasting and climate change mitigation.",
    "Communicate complex scientific information effectively to diverse audiences."
  ],
  "similarPrograms": [
    {
      "title": "Earth and Planetary Science",
      "link": "https://eps.berkeley.edu"
    },
    {
      "title": "Environmental Earth Science",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/environmental-earth-science"
    },
    {
      "title": "Environmental Engineering Science",
      "link": "https://ce.berkeley.edu/programs/environmental-engineering-science"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/atmospheric-science",
    "https://eps.berkeley.edu/academics/undergraduate/atmospheric-science",
    "https://www.berkeley.edu/catalog/degree-programs/atmospheric-science-bs"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The Atmospheric Science major is administered by the Department of Earth and Planetary Science. Students are advised to consult with departmental advisors to ensure timely completion of major requirements."
}