{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Chemical Engineering / Materials Science & Engineering Joint Major (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Chemical Engineering / Materials Science & Engineering Joint Major is an interdisciplinary program that combines the fundamentals of chemical engineering with the principles of materials science and engineering. Students in this major gain a deep understanding of the properties and behavior of materials, as well as the processes used to design, synthesize, and characterize them. The program prepares students for careers in a wide range of industries, including energy, biotechnology, and advanced materials.",
  "shortProgramDescription": "The Chemical Engineering / Materials Science & Engineering Joint Major provides students with a strong foundation in the principles of chemical engineering and materials science, preparing them for careers in industries that involve the design, synthesis, and characterization of materials.",
  "classHighlights": [
    "The core chemical engineering courses, including Chemical Process Principles (CHMENG 141), Thermodynamics (CHMENG 150A), and Transport Phenomena (CHMENG 170), provide students with a strong foundation in the principles of chemical engineering.",
    "The materials science and engineering courses, including Introduction to Materials Science and Engineering (MATSCENG 45), Thermodynamics of Materials (MATSCENG 110), and Materials Characterization (MATSCENG 120), provide students with a deep understanding of the properties and behavior of materials.",
    "The laboratory courses, including Chemical Engineering Laboratory (CHMENG 162L) and Materials Science and Engineering Laboratory (MATSCENG 104L), provide students with hands-on experience with experimental techniques and data analysis.",
    "The mathematics and physics courses, including Calculus (MATH 1A-1B), Differential Equations (MATH 54), and Physics (PHYSICS 7A-7B), provide students with a strong foundation in the underlying principles of engineering and science.",
    "The elective courses, including Advanced Materials Science and Engineering (MATSCENG 191) and Special Topics in Chemical Engineering (CHMENG 195), allow students to explore specialized topics in depth and tailor their education to their interests and career goals."
  ],
  "learningOutcomes": [
    "Apply the principles of chemical engineering and materials science to design and analyze materials and processes.",
    "Understand the properties and behavior of materials and their applications in various industries.",
    "Design and conduct experiments to characterize materials and processes.",
    "Analyze and interpret data from experiments and simulations.",
    "Communicate complex technical information effectively in written and oral form.",
    "Work effectively in teams to solve problems and complete projects."
  ],
  "similarPrograms": [
    {
      "title": "Chemical Engineering",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/chemical-engineering"
    },
    {
      "title": "Materials Science & Engineering",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/materials-science-engineering-major"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/chemical-engineering-materials-science-joint-major",
    "https://chemical.berkeley.edu/",
    "https://materials.berkeley.edu/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "128-130 units (semester system)",
  "additionalInformation": "Students must complete the lower division requirements, including mathematics, physics, and chemistry, before declaring the major. The major requires a minimum GPA of 2.0 in the major courses. Students are encouraged to participate in research and internship opportunities to gain practical experience."
}