{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Chemical Biology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Chemical Biology major is an interdisciplinary program that combines the study of chemistry and biology to understand the chemical processes that occur in living organisms. The major provides a foundation in the principles of chemistry, biology, and biochemistry, and allows students to explore the applications of chemical biology in fields such as medicine, agriculture, and biotechnology.",
  "shortProgramDescription": "The Chemical Biology major at UC Berkeley provides students with a comprehensive understanding of the chemical processes that occur in living organisms and prepares them for careers in fields such as medicine, agriculture, and biotechnology.",
  "classHighlights": [
    "The major requires a foundation in chemistry, including courses in General Chemistry (CHEM1A/1B), Organic Chemistry (CHEM3A/3B/3BL), and Physical Chemistry (CHEM120A/120B).",
    "Students also take courses in biology, including Molecular and Cell Biology (BIOLOGY1A/1B) and Genetics (BIOLOGY130).",
    "The major includes a set of core courses that cover the principles of chemical biology, including Biochemistry (BIOLOGY130/CHEM C130) and Chemical Biology (CHEM C162/IB 162).",
    "Students also choose from a range of electives that allow them to explore specialized topics in chemical biology, such as medicinal chemistry and chemical genetics."
  ],
  "learningOutcomes": [
    "Understand the principles of chemistry and biology and their application to the study of chemical biology",
    "Apply knowledge of chemical biology to understand the chemical processes that occur in living organisms",
    "Analyze and interpret data related to chemical biology",
    "Communicate complex ideas related to chemical biology effectively",
    "Apply knowledge of chemical biology to real-world problems in fields such as medicine, agriculture, and biotechnology"
  ],
  "similarPrograms": [
    {
      "title": "Molecular and Cell Biology",
      "link": "https://mcb.berkeley.edu/undergraduate/major"
    },
    {
      "title": "Chemistry",
      "link": "https://chemistry.berkeley.edu/undergraduate/chemistry-major"
    },
    {
      "title": "Biochemistry",
      "link": "https://chemistry.berkeley.edu/undergraduate/biochemistry-major"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/chemical-biology",
    "https://chemistry.berkeley.edu/undergraduate/chemical-biology-major",
    "https://mcb.berkeley.edu/undergraduate/major"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The Chemical Biology major is a rigorous program that requires a strong foundation in chemistry and biology. Students are advised to consult with a department advisor to ensure that they are meeting the major requirements and to plan their course schedule."
}