{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Chemical Engineering / Nuclear Engineering Joint Major (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Chemical Engineering / Nuclear Engineering Joint Major is a comprehensive undergraduate program that combines the fundamental principles of chemical engineering and nuclear engineering to prepare students for careers at the intersection of energy, environment, and technology. The program covers the core concepts of chemical engineering, including thermodynamics, transport phenomena, and reaction engineering, alongside the principles of nuclear engineering, such as nuclear reactions, radiation protection, and nuclear systems.",
  "shortProgramDescription": "The Chemical Engineering / Nuclear Engineering Joint Major provides a rigorous foundation in both fields, preparing students for diverse careers in energy, environment, and related industries.",
  "classHighlights": [
    "The program begins with foundational courses in chemistry (Chemistry 1A, 1B), physics (Physics 7A, 7B), and mathematics (Math 1A, 1B, 53, 54), establishing a strong base for advanced study.",
    "Chemical engineering core courses include Chemical Process Analysis (ChE 10), Thermodynamics (ChE 102A), Transport Phenomena (ChE 101A, 101B), and Chemical Reaction Engineering (ChE 162), providing a comprehensive understanding of chemical processes and systems.",
    "Nuclear engineering core courses cover Nuclear Reactions and Radiation (NE 104), Nuclear Reactor Theory (NE 105), and Nuclear Engineering Fundamentals (NE 106), introducing students to the principles of nuclear reactions, radiation protection, and reactor design.",
    "Students also complete laboratory courses, such as ChE 101C and NE 102, to gain practical experience in experimental techniques and data analysis.",
    "Electives in both departments allow students to explore specialized topics, such as energy systems, environmental engineering, and advanced nuclear technologies.",
    "Engineering design and economics are emphasized through courses like ChE 140 and NE 143, teaching students to apply engineering principles to real-world problems and evaluate economic and environmental impacts."
  ],
  "learningOutcomes": [
    "Apply the principles of chemical engineering to design and analyze chemical processes and systems.",
    "Understand the fundamental concepts of nuclear reactions, radiation protection, and nuclear reactor theory.",
    "Analyze complex systems involving both chemical and nuclear engineering principles.",
    "Design and optimize processes for energy production, conversion, and utilization.",
    "Evaluate the safety, environmental, and economic implications of chemical and nuclear engineering projects.",
    "Communicate technical information effectively in written and oral forms."
  ],
  "similarPrograms": [
    {
      "title": "Chemical Engineering (B.S.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/chemical-engineering"
    },
    {
      "title": "Nuclear Engineering (B.S.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/nuclear-engineering"
    },
    {
      "title": "Energy and Resources Group (ERG) Undergraduate Program",
      "link": "https://erg.berkeley.edu/undergraduate/"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/chemical-engineering-nuclear-joint-major",
    "https://che.berkeley.edu/",
    "https://nuceng.berkeley.edu/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "approximately 128-130 semester units",
  "additionalInformation": "The program is administered jointly by the Department of Chemical and Biomolecular Engineering and the Department of Nuclear Engineering. Students are advised to consult with departmental advisors to ensure timely completion of major requirements and to plan for electives and specializations."
}