{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Civil Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Department of Civil and Environmental Engineering offers a program leading to the Bachelor of Science degree in Civil Engineering. The program provides a broad background in the basic engineering sciences, an in-depth knowledge in the student's selected area within civil engineering, and the skills needed to apply this knowledge to the solution of practical problems. The program is accredited by the Engineering Accreditation Commission of ABET.",
  "shortProgramDescription": "The Civil Engineering B.S. program provides a broad foundation in engineering principles, with specialized knowledge in areas like structures, transportation, and water resources.",
  "classHighlights": [
    "The Civil Engineering program includes foundational courses in mathematics, physics, and chemistry, ensuring a strong base in the sciences.",
    "Core courses in civil engineering cover topics like mechanics, materials, and systems, providing a comprehensive understanding of engineering principles.",
    "Students take courses in specific areas such as structural engineering, transportation engineering, water resources engineering, and geotechnical engineering, allowing for depth in chosen fields.",
    "Technical electives enable students to further explore their interests and gain practical skills in areas like environmental engineering, construction management, and urban planning.",
    "Laboratory and project-based courses provide hands-on experience, integrating theoretical knowledge with practical application.",
    "The curriculum includes courses on engineering economics, ethics, and communication, preparing students for professional practice."
  ],
  "learningOutcomes": [
    "Apply knowledge of mathematics, science, and engineering to solve civil engineering problems.",
    "Design and conduct experiments, as well as to analyze and interpret data in civil engineering contexts.",
    "Design a system, component, or process to meet desired needs within realistic constraints.",
    "Function on multidisciplinary teams, collaborating with professionals from various disciplines.",
    "Identify, formulate, and solve engineering problems in areas like structures, transportation, and water resources.",
    "Understand professional and ethical responsibility in engineering practice."
  ],
  "similarPrograms": [
    {
      "title": "Environmental Engineering (B.S.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/environmental-engineering"
    },
    {
      "title": "Mechanical Engineering (B.S.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/mechanical-engineering"
    },
    {
      "title": "Engineering Science (B.S.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/engineering-science"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/civil-engineering",
    "https://ce.berkeley.edu/undergraduate/civil-engineering-bs",
    "https://www.berkeley.edu/catalog/current/degree_programs/civil_engineering.html"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "128-130 semester units",
  "additionalInformation": "The program is designed to be completed in four years. Students are advised to declare their major early and plan their course schedule carefully to ensure timely completion of degree requirements."
}