{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Cognitive Science (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Cognitive Science major is designed to provide students with a broad understanding of the mind and brain, drawing on work from psychology, philosophy, computer science, linguistics, and neuroscience. The major emphasizes the development of skills in critical thinking, problem-solving, and research methods, as well as the ability to integrate knowledge from multiple disciplines.",
  "shortProgramDescription": "The Cognitive Science major at UC Berkeley provides a comprehensive education in the study of the mind and brain, integrating insights from multiple disciplines.",
  "classHighlights": [
    "Cognitive Science Core: The major requires foundational courses in Cognitive Science, including Introduction to Cognitive Science (COGS 1), Methods in Cognitive Science (COGS 101), and Cognitive Science Laboratory (COGS 102).",
    "Philosophy: Courses in Philosophy, such as Philosophy of Mind (PHILOS 142) and Epistemology (PHILOS 144), provide a rigorous examination of the fundamental questions in Cognitive Science.",
    "Computer Science and Programming: Courses like Introduction to Programming (COMPSCI 61A) and Data Structures (COMPSCI 61B) equip students with essential programming skills and knowledge of computational concepts.",
    "Linguistics: Linguistics courses, including Introduction to Linguistics (LINGUIS 1) and Phonetics and Phonology (LINGUIS 110), explore the structure and processing of language.",
    "Neuroscience and Psychology: Courses such as Introduction to Psychology (PSYCH 1) and Brain and Behavior (PSYCH 125) introduce students to the biological and psychological aspects of cognition.",
    "Electives and Specializations: Students can choose from a range of electives and specializations, including areas like artificial intelligence, human-computer interaction, and cognitive development."
  ],
  "learningOutcomes": [
    "Understand the core concepts and theories of Cognitive Science",
    "Apply knowledge from multiple disciplines to understand the mind and brain",
    "Develop skills in critical thinking, problem-solving, and research methods",
    "Analyze and evaluate complex information and arguments",
    "Communicate effectively in written and oral forms",
    "Integrate knowledge from different disciplines to address complex problems"
  ],
  "similarPrograms": [
    {
      "title": "Psychology",
      "link": "https://psychology.berkeley.edu/undergraduate/psychology-major"
    },
    {
      "title": "Linguistics",
      "link": "https://linguistics.berkeley.edu/undergraduate/linguistics-major"
    },
    {
      "title": "Computer Science",
      "link": "https://www.cs.berkeley.edu/ugrad/csd-major"
    },
    {
      "title": "Philosophy",
      "link": "https://philosophy.berkeley.edu/undergraduate/philosophy-major"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/cognitive-science",
    "https://cogsci.berkeley.edu/undergraduate/cognitive-science-major/",
    "https://www.berkeley.edu/catalog/departments/Cognitive_Science/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The Cognitive Science major is an interdisciplinary program that draws on courses from multiple departments. Students are advised to consult with the Cognitive Science department advisor to plan their course schedule and ensure they meet the major requirements."
}