{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Conservation and Resource Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Conservation and Resource Studies major is an interdisciplinary program that focuses on the social, political, and ecological dimensions of environmental issues. Students examine the interactions between human societies and the natural environment, exploring the causes and consequences of environmental degradation and the ways to conserve and manage natural resources sustainably.",
  "shortProgramDescription": "The Conservation and Resource Studies major prepares students to understand and address environmental challenges through an interdisciplinary lens, combining social, political, and ecological perspectives.",
  "classHighlights": [
    "The program begins with foundational courses such as Environmental Economics (ECON N1B) and Introduction to Environmental Science, Policy, and Politics (ESP 1), which introduce students to key concepts and frameworks.",
    "Students then engage with a range of upper-division courses that explore topics such as conservation biology, environmental policy, and sustainable development, including Conservation Biology (IB 158) and Environmental Policy (ESP 120).",
    "Additional course work includes classes on research methods, statistics, and environmental law, ensuring a well-rounded understanding of the field.",
    "Students can also select from a range of electives that allow them to tailor their education to their interests, including courses on topics such as climate change, environmental justice, and sustainable agriculture.",
    "Throughout the program, students develop critical thinking, research, and analytical skills, preparing them for careers in fields such as conservation, policy, and environmental management."
  ],
  "learningOutcomes": [
    "Understand the social, political, and ecological dimensions of environmental issues",
    "Analyze the causes and consequences of environmental degradation",
    "Develop skills in research, analysis, and problem-solving related to conservation and resource management",
    "Evaluate the effectiveness of environmental policies and programs",
    "Communicate complex environmental issues effectively to diverse audiences"
  ],
  "similarPrograms": [
    {
      "title": "Environmental Science, Policy, and Management",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/environmental-science-policy-management"
    },
    {
      "title": "Energy and Resources Group",
      "link": "https://erg.berkeley.edu"
    },
    {
      "title": "Environmental Economics and Policy Minor",
      "link": "https://are.berkeley.edu/programs/minor-environmental-economics-and-policy"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/conservation-resource-studies",
    "https://cnr.berkeley.edu/conservation-and-resource-studies-major"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The major is designed to be completed within four years, with students taking a mix of lower- and upper-division courses. The program encourages students to engage in internships, research projects, and other experiential learning opportunities to gain practical skills and experience."
}