{
  "collegeName": "University of California, Berkeley",
  "programType": "Joint Major",
  "programName": "EECS / Materials Science & Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Joint Major in Electrical Engineering and Computer Sciences (EECS) and Materials Science & Engineering is designed for students who wish to be trained in both the EECS and MSE departments. The program combines the core requirements of both majors, providing a comprehensive education in the principles of electrical engineering, computer science, and materials science.",
  "shortProgramDescription": "The EECS / Materials Science & Engineering Joint Major provides a comprehensive education in the principles of electrical engineering, computer science, and materials science.",
  "classHighlights": [
    "The program includes foundational courses in EECS such as Introduction to Electrical Engineering and Computer Science (EECS 16A/B), Data Structures and Algorithms (CS 61B), and Computer Architecture (CS 61C).",
    "Students also take core MSE courses like Introduction to Materials Science and Engineering (MAT SCI 45), Thermodynamics of Materials (MAT SCI 102), and Materials Structure and Preparation (MAT SCI 103).",
    "EECS upper division courses include Signals and Systems (EECS 120), Electronics (EECS 130), and Computer Systems and Programming (CS 162), among others.",
    "MSE upper division courses include Materials Characterization (MAT SCI 104), Transport and Kinetics (MAT SCI 106), and Materials Selection (MAT SCI 151).",
    "Students must also fulfill the breadth requirements for both departments, which include courses in mathematics, physics, and other related fields."
  ],
  "learningOutcomes": [
    "Apply the fundamental principles of electrical engineering, computer science, and materials science to solve complex problems.",
    "Design and analyze electronic circuits, systems, and software.",
    "Understand the properties and applications of various materials.",
    "Develop skills in programming and software development.",
    "Analyze and solve problems using mathematical and computational techniques.",
    "Communicate technical information effectively."
  ],
  "similarPrograms": [
    {
      "title": "Electrical Engineering and Computer Sciences (B.S.)",
      "link": "https://eecs.berkeley.edu"
    },
    {
      "title": "Materials Science & Engineering (B.S.)",
      "link": "https://mse.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/electrical-engineering-computer-sciences-materials",
    "https://eecs.berkeley.edu",
    "https://mse.berkeley.edu"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of approximately 120-128 semester units, including major, breadth, and other requirements",
  "additionalInformation": "Students must meet the requirements of both departments and maintain a satisfactory GPA. The program is highly competitive, and students are advised to consult with advisors in both departments."
}