{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Engineering Physics (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Bachelor of Science in Engineering Physics is an interdisciplinary program that combines the study of physics with the principles of engineering. It provides a foundation in the fundamental laws of physics, mathematical techniques, and computational methods, as well as the application of these principles to real-world engineering problems. The program is designed for students who want to pursue a career in research, development, or academia, or who wish to pursue a graduate degree in physics, engineering, or a related field.",
  "shortProgramDescription": "The Engineering Physics B.S. program provides a strong foundation in physics and mathematics, combined with the application of these principles to real-world engineering problems.",
  "classHighlights": [
    "The program requires a strong foundation in physics, including Mechanics (PHYSICS106A), Electricity and Magnetism (PHYSICS106B), and Thermodynamics (ENGIN105).",
    "Mathematics coursework includes Calculus (MATH1A, MATH1B), Differential Equations (MATH54), and Linear Algebra (MATH54).",
    "Engineering coursework includes Introduction to Engineering (ENGIN1), Mechanics of Solids (ENGIN105), and Electronics (EE105).",
    "Students also take courses in computational methods, including Numerical Methods (ENGIN106) and Computational Physics (PHYSICS211A).",
    "Additional required courses include Statistical Mechanics (PHYSICS112), Quantum Mechanics (PHYSICS137A), and Experimental Physics (PHYSICS195)."
  ],
  "learningOutcomes": [
    "Apply fundamental laws of physics to engineering problems",
    "Use mathematical techniques to model and analyze complex systems",
    "Design and conduct experiments to test hypotheses and validate results",
    "Communicate complex ideas and results effectively",
    "Work effectively in teams to solve complex problems",
    "Apply computational methods to solve engineering problems"
  ],
  "similarPrograms": [
    {
      "title": "Physics (B.A./B.S.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/physics"
    },
    {
      "title": "Applied Physics (Minor)",
      "link": "https://guide.berkeley.edu/undergraduate/minors/applied-physics-minor"
    },
    {
      "title": "Materials Science and Engineering (B.S.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/materials-science-engineering"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/engineering-physics",
    "https://physics.berkeley.edu/undergraduate-program",
    "https://engineering.berkeley.edu/academics/undergraduate-programs"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "128-129 semester units",
  "additionalInformation": "Students must complete a set of lower division physics and mathematics courses before advancing to upper division coursework. The program has specific GPA requirements for major coursework. Students are encouraged to participate in research projects and internships to gain practical experience."
}