{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Engineering Mathematics and Statistics (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Bachelor of Science in Engineering Mathematics and Statistics program at UC Berkeley combines mathematical, statistical, and computational techniques to solve complex engineering and scientific problems. The program provides a foundation in mathematical modeling, statistical analysis, and computational methods, preparing students for careers in industry, government, or academia.",
  "shortProgramDescription": "The Engineering Mathematics and Statistics B.S. at UC Berkeley equips students with skills in mathematical modeling, statistical analysis, and computational techniques to tackle complex problems.",
  "classHighlights": [
    "Mathematical Foundations: The program requires a strong foundation in mathematics, including calculus (MATH 1A, 1B, 53), linear algebra (MATH 54), and differential equations (MATH 54, ENGIN 118). Students also take courses in mathematical methods for engineers (ENGIN 118, MATH 128A).",
    "Statistical Techniques: Students learn statistical concepts and methods, including probability (STAT C70), statistics (STAT 134, 135), and data analysis. They also study statistical computing and data science.",
    "Computational Methods: The program emphasizes computational skills, including programming (COMPSCI 61A, 61B), numerical methods, and computational modeling. Students learn to apply these methods to solve complex problems in engineering and science.",
    "Engineering Applications: Students take courses that apply mathematical and statistical techniques to engineering problems, such as signal processing, control systems, and data analysis.",
    "Electives and Specializations: The program allows students to choose electives in areas like data science, machine learning, and mathematical finance, enabling them to tailor their education to their interests and career goals."
  ],
  "learningOutcomes": [
    "Apply mathematical and statistical techniques to solve complex engineering and scientific problems.",
    "Develop computational models and algorithms to analyze and solve problems.",
    "Analyze and interpret data using statistical methods.",
    "Communicate complex technical information effectively.",
    "Work effectively in teams to tackle interdisciplinary problems.",
    "Stay current with new developments in mathematical and statistical techniques."
  ],
  "similarPrograms": [
    {
      "title": "Applied Mathematics",
      "link": "https://math.berkeley.edu/undergrad/major-applied-mathematics"
    },
    {
      "title": "Statistics",
      "link": "https://statistics.berkeley.edu/programs/undergraduate-statistics"
    },
    {
      "title": "Data Science",
      "link": "https://data.berkeley.edu/academics/undergraduate"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/engineering-math-statistics",
    "https://advising.berkeley.edu/catalog/degree-programs/engineering-mathematics-statistics-bs",
    "https://engineering.berkeley.edu/students/advising/academic-programs"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "128-130 units (semester system)",
  "additionalInformation": "The program is designed to be completed in four years. Students are encouraged to participate in research, internships, and other extracurricular activities to enhance their education."
}