{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Environmental Economics and Policy (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Environmental Economics and Policy major is designed to provide students with a comprehensive understanding of the economic and policy aspects of environmental issues. The program combines coursework in economics, environmental science, and policy to equip students with the analytical tools and knowledge necessary to address complex environmental problems. Students learn about the economic principles that underlie environmental decision-making, the policy frameworks that shape environmental outcomes, and the scientific principles that inform environmental management.",
  "shortProgramDescription": "The Environmental Economics and Policy major prepares students to analyze and address environmental issues using economic and policy tools.",
  "classHighlights": [
    "Core economics courses, such as Environmental Economics (ECON C115) and Economic Development (ECON 157), provide a foundation in economic principles and their application to environmental issues.",
    "Environmental science and policy courses, including Introduction to Environmental Science (ESPM C10) and Environmental Policy (ESPM 101), offer a comprehensive understanding of environmental systems and the policy frameworks that govern them.",
    "Electives in areas like conservation biology, environmental law, and sustainability allow students to explore specific topics in depth and tailor their coursework to their interests.",
    "Quantitative methods courses, such as Statistics (STAT C10) and Data Analysis for Social Scientists (SOC 139), equip students with the analytical skills necessary to analyze environmental data and evaluate policy effectiveness.",
    "The major also includes a range of upper-division courses that cover topics like climate change economics, environmental valuation, and sustainable development."
  ],
  "learningOutcomes": [
    "Apply economic principles to analyze environmental issues and policy interventions.",
    "Understand the scientific principles that underlie environmental management and policy.",
    "Analyze and evaluate environmental policies and their impacts.",
    "Develop effective written and oral communication skills to convey environmental and economic ideas.",
    "Apply quantitative methods to analyze environmental data and evaluate policy effectiveness."
  ],
  "similarPrograms": [
    {
      "title": "Environmental Science, Policy, and Management (B.S.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/environmental-science-policy-management"
    },
    {
      "title": "Conservation and Resource Studies (B.A.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/conservation-resource-studies"
    },
    {
      "title": "Energy and Resources Group (B.A.)",
      "link": "https://erg.berkeley.edu/undergraduate/"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/environmental-economics-policy",
    "https://econ.berkeley.edu/undergraduate",
    "https://environ.berkeley.edu/academics/undergraduate-programs"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students must complete a set of core courses, electives, and upper-division requirements, and maintain a minimum GPA. The major is administered by the Department of Agricultural and Resource Economics."
}