{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Genetics and Plant Biology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Genetics and Plant Biology major is an interdisciplinary program that integrates genetics, plant biology, and related fields to understand the fundamental principles governing the biology of plants. The program prepares students for careers in research, industry, and education, as well as for graduate study in fields such as genetics, plant biology, and biotechnology.",
  "shortProgramDescription": "The Genetics and Plant Biology major provides a comprehensive education in the principles of genetics and plant biology, with a strong foundation in molecular biology, biochemistry, and related fields.",
  "classHighlights": [
    "Foundational courses in biology, chemistry, and mathematics provide a broad base for understanding genetics and plant biology. Students take courses such as Biology 1A/1AL, Biology 1B, Chemistry 1A/1AL, and Math 1A.",
    "Core courses in genetics, molecular biology, and plant biology include Genetics (IB 160), Molecular Biology (MCB 104 or MCB 150), and Plant Physiology (PLANTBI 112).",
    "Students also take laboratory courses, such as Genetics Laboratory (IB 161L) and Molecular Biology Laboratory (MCB 103L), to gain hands-on experience in experimental design and techniques.",
    "Upper-division courses in genetics, plant biology, and related fields provide advanced knowledge and training in areas such as genomics, gene regulation, and plant development. Examples include Genomics (IB 163), Plant Development (PLANTBI 140), and Plant Molecular Biology (PLANTBI 147)."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of genetics and plant biology",
    "Apply molecular biology and genetic techniques to analyze biological systems",
    "Demonstrate knowledge of plant physiology, development, and evolution",
    "Analyze and interpret data from experiments in genetics and plant biology",
    "Communicate scientific concepts and results effectively in written and oral forms"
  ],
  "similarPrograms": [
    {
      "title": "Molecular and Cell Biology",
      "link": "https://mcb.berkeley.edu/undergraduate/program"
    },
    {
      "title": "Integrative Biology",
      "link": "https://ib.berkeley.edu/undergraduate"
    },
    {
      "title": "Plant and Microbial Biology",
      "link": "https://plantandmicrobialbiology.berkeley.edu/undergraduate"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/genetics-plant-biology",
    "https://ib.berkeley.edu/undergraduate/genetics-plant-biology-major",
    "https://advising.berkeley.edu/catalog/major-descriptions/genetics-plant-biology"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits (including major, breadth, and university requirements)",
  "additionalInformation": "Students are advised to consult with the department's undergraduate advisor to plan their course schedule and to ensure that they meet all major requirements."
}