{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Geophysics (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Geophysics major is an interdisciplinary program that provides a strong foundation in the fundamental sciences of physics, mathematics, and geology, with a focus on the application of these disciplines to understanding the Earth's internal and external processes. The program combines coursework in geophysics, seismology, gravity, magnetism, and heat flow to prepare students for a wide range of careers in academia, research, government, and industry.",
  "shortProgramDescription": "The Geophysics B.S. provides a comprehensive education in the Earth's physical processes, combining coursework in physics, mathematics, and geology to prepare students for careers in research, academia, and industry.",
  "classHighlights": [
    "The Geophysics major requires a strong foundation in physics, including Mechanics (PHYSICS 7A/7B), Electricity and Magnetism (PHYSICS 7C), and Mathematical Methods for Physicists (PHYSICS 105).",
    "Mathematics coursework includes Calculus (MATH 1A/1B), Differential Equations (MATH 53, MATH 54 or MATH 105), and Linear Algebra (MATH 110).",
    "Geology coursework includes Introduction to Geology (EARTH 10 or EARTH 11), Structural Geology (EARTH 101 or EARTH 120), and Geophysics (EARTH 162 or EARTH 168).",
    "Additional geophysics coursework includes Seismology (EARTH 161 or EARTH 163), Gravity and Magnetic Methods (EARTH 164), and Heat Flow and Geodynamics (EARTH 166).",
    "Students also take upper division elective courses in geophysics, such as Earthquake Seismology (EARTH 163), Computational Geophysics (EARTH 168), and Geomechanics (EARTH 170)."
  ],
  "learningOutcomes": [
    "Apply mathematical and physical principles to understand the Earth's internal and external processes.",
    "Analyze and interpret geophysical data to understand the Earth's structure and evolution.",
    "Demonstrate an understanding of the fundamental principles of geophysics, including seismology, gravity, magnetism, and heat flow.",
    "Communicate complex geophysical concepts effectively in written and oral form.",
    "Evaluate the limitations and uncertainties of geophysical data and models."
  ],
  "similarPrograms": [
    {
      "title": "Earth and Planetary Science",
      "link": "https://eps.berkeley.edu/undergrad/major"
    },
    {
      "title": "Geology",
      "link": "https://eps.berkeley.edu/undergrad/geology"
    },
    {
      "title": "Environmental Earth Science",
      "link": "https://eps.berkeley.edu/undergrad/env-earth-science"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/geophysics",
    "https://eps.berkeley.edu/undergrad/geophysics",
    "https://www.berkeley.edu/catalog/degree-programs/geophysics-bs"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The Geophysics major is administered by the Department of Earth and Planetary Science. Students are advised to consult with departmental advisors to ensure they meet the major requirements."
}