{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Greek (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Classics at UC Berkeley offers a major in Greek that provides students with a comprehensive understanding of the Greek language and its literature, as well as the cultural and historical context of ancient Greece. Students develop their knowledge of Greek language and literature through a sequence of courses that cover various genres, periods, and themes.",
  "shortProgramDescription": "The Greek major at UC Berkeley provides a rigorous foundation in the Greek language and its literature, preparing students for diverse careers or further study.",
  "classHighlights": [
    "Elementary and intermediate Greek courses (Greek 101-104, 1a-4b) provide a foundation in the language, while advanced courses (Greek 105, 106, 107, 108) focus on specific authors, genres, or themes.",
    "Upper-division courses (Greek 110-189) cover a range of topics, including Greek tragedy, comedy, historiography, and oratory, as well as the cultural and historical context of ancient Greece.",
    "Courses in Greek language and literature are complemented by related courses in Classics, such as Classical Civilization and Latin, to provide a broader understanding of the ancient Mediterranean world."
  ],
  "learningOutcomes": [
    "Read and analyze Greek texts with accuracy and nuance",
    "Understand the cultural and historical context of ancient Greece",
    "Develop critical thinking and interpretive skills through the study of Greek literature",
    "Communicate complex ideas effectively in written and oral form"
  ],
  "similarPrograms": [
    {
      "title": "Classics",
      "link": "https://classics.berkeley.edu/undergraduate/major"
    },
    {
      "title": "Latin (B.A.)",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/latin"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/greek",
    "https://classics.berkeley.edu/undergraduate/major",
    "https://classics.berkeley.edu/undergraduate/courses"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of 120 units required for graduation; major requirements include 30-40 units in Greek language and literature",
  "additionalInformation": "Students are encouraged to study abroad in Greece or participate in archaeological field schools to enhance their understanding of ancient Greek culture and language."
}