{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Japanese Language (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of East Asian Languages and Cultures offers a major in Japanese Language, which includes the study of Japanese language, literature, and culture. Students develop proficiency in the Japanese language and explore various aspects of Japanese culture, history, and society. The program aims to provide students with a deep understanding of Japan and its significance in the world.",
  "shortProgramDescription": "The Japanese Language major at UC Berkeley focuses on developing language proficiency and exploring Japanese culture, literature, and society.",
  "classHighlights": [
    "The Japanese Language major requires coursework in Japanese language, including grammar, vocabulary, and kanji. Students progress from introductory to advanced levels, developing their reading, writing, and speaking skills.",
    "Literature and cultural courses examine Japanese texts, history, and cultural practices, providing context and depth to language study. These courses cover a range of topics, from classical literature to contemporary culture.",
    "Electives allow students to explore specialized areas, such as Japanese linguistics, history, or cultural studies, tailoring their major to their interests and career goals."
  ],
  "learningOutcomes": [
    "Develop advanced proficiency in reading, writing, and speaking Japanese.",
    "Analyze and interpret Japanese literary and cultural texts.",
    "Understand the historical and cultural contexts of Japan.",
    "Apply knowledge of Japanese language and culture to various fields, such as business, education, or international relations."
  ],
  "similarPrograms": [
    {
      "title": "East Asian Languages and Cultures",
      "link": "https://ealc.berkeley.edu"
    },
    {
      "title": "Asian American and Asian Diaspora Studies",
      "link": "https://www.aasd.berkeley.edu"
    },
    {
      "title": "Asian Studies Minor",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/asian-studies-minor"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/japanese-language",
    "https://ealc.berkeley.edu"
  ],
  "programDuration": "4 years (8 semesters, semester system)",
  "creditRequirements": "120 semester credits (including major requirements and breadth courses)",
  "additionalInformation": "Students are encouraged to study abroad in Japan to enhance their language skills and cultural understanding. The major provides a foundation for various careers, including education, translation, international business, and government service."
}