{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Legal Studies (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Legal Studies major is an interdisciplinary program that explores the role of law in society, examining its social, political, economic, and cultural contexts. The major provides students with a comprehensive understanding of the complex relationships between law, power, and social justice, and prepares them for careers in law, government, non-profit organizations, and private industry. Students choose from a range of courses that cover topics such as the history and theory of law, the relationship between law and social inequality, and the role of law in shaping public policy.",
  "shortProgramDescription": "The Legal Studies major provides students with a nuanced understanding of law and its social contexts, preparing them for diverse careers or further study.",
  "classHighlights": [
    "The major requires students to take a series of core courses that introduce them to the key concepts and theories of law, including the historical and social contexts of law, the relationship between law and power, and the role of law in shaping social justice. Courses such as 'Introduction to Legal Studies' and 'Law and Society' provide a foundation for further study.",
    "Students then choose from a range of upper-division courses that allow them to explore specific topics in greater depth, such as the law and social inequality, the law and public policy, and the history of law. Courses such as 'Law, Identity, and Social Justice' and 'The Politics of Law and Courts' provide students with a nuanced understanding of the complex relationships between law, power, and social justice.",
    "The major also allows students to take electives in related fields, such as sociology, political science, and history, providing them with a rich and interdisciplinary understanding of the role of law in society."
  ],
  "learningOutcomes": [
    "Understand the complex relationships between law, power, and social justice.",
    "Analyze the historical and social contexts of law.",
    "Evaluate the role of law in shaping public policy.",
    "Apply theoretical frameworks to understand the relationship between law and society.",
    "Communicate complex ideas about law and society effectively in written and oral form."
  ],
  "similarPrograms": [
    {
      "title": "Jurisprudence and Social Policy",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/jurisprudence-social-policy"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/legal-studies",
    "https://ls.berkeley.edu"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students must meet the college's general education requirements and maintain a minimum GPA. The major is administered by the Legal Studies Department."
}