{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Mechanical Engineering / Nuclear Engineering (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Mechanical Engineering major with a Nuclear Engineering emphasis is an interdisciplinary program that combines the fundamental principles of mechanical engineering with the specialized knowledge of nuclear engineering. The program aims to provide students with a broad foundation in mechanical engineering and a deep understanding of nuclear engineering principles, preparing them for careers in the nuclear industry or for graduate study.",
  "shortProgramDescription": "The Mechanical Engineering / Nuclear Engineering B.S. program combines core mechanical engineering with nuclear engineering principles, preparing students for nuclear industry careers or graduate study.",
  "classHighlights": [
    "The program begins with foundational courses in mathematics (Calculus, Differential Equations), physics (Mechanics, Electricity & Magnetism), and chemistry, which provide the necessary background for advanced engineering coursework.",
    "Mechanical engineering core courses cover topics such as mechanics of solids and fluids, thermodynamics, heat transfer, mechanical design, and systems dynamics, ensuring a broad understanding of mechanical systems.",
    "Nuclear engineering courses include Nuclear Reactions and Radiation, Nuclear Reactor Design, and Nuclear Reactor Thermal Hydraulics, providing a comprehensive understanding of nuclear principles and applications.",
    "Students also complete a range of technical electives, allowing them to explore specialized areas within mechanical and nuclear engineering, such as energy systems, materials science, or computational methods.",
    "Laboratory and project-based courses, such as Mechanical Engineering Laboratory and Nuclear Engineering Laboratory, provide hands-on experience with experimental techniques, data analysis, and engineering design."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of mechanical engineering to analyze and design complex systems.",
    "Understand the principles of nuclear engineering, including nuclear reactions, radiation, and reactor design.",
    "Analyze and solve problems in nuclear engineering using mathematical and computational techniques.",
    "Design and conduct experiments, and analyze data in mechanical and nuclear engineering contexts.",
    "Communicate technical information effectively in written and oral forms.",
    "Work effectively in teams to solve complex engineering problems."
  ],
  "similarPrograms": [
    {
      "title": "Mechanical Engineering (B.S.)",
      "link": "https://me.berkeley.edu/undergraduate/degree-programs/bs-mechanical-engineering"
    },
    {
      "title": "Nuclear Engineering (B.S.)",
      "link": "https://nuceng.berkeley.edu/academics/undergraduate-programs/nuclear-engineering-bs"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/mechanical-engineering-nuclear",
    "https://me.berkeley.edu/undergraduate/degree-programs/bs-mechanical-engineering",
    "https://nuceng.berkeley.edu/academics/undergraduate-programs/nuclear-engineering-bs"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "128-130 semester credits (including major and breadth requirements)",
  "additionalInformation": "Students must complete a set of required courses in mechanical and nuclear engineering, as well as satisfy the university's breadth requirements. The program is designed to be completed in four years, with careful planning and advising recommended to ensure timely progress."
}