{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Neuroscience (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The undergraduate major in Neuroscience is an interdisciplinary program that studies the nervous system at multiple levels: molecular, cellular, systems, and behavioral. The program emphasizes a deep understanding of the structure, function, and development of the nervous system, as well as the underlying mechanisms of neurological and psychiatric disorders.",
  "shortProgramDescription": "The Neuroscience major at UC Berkeley provides a comprehensive education in the biological and psychological aspects of the nervous system, preparing students for a range of careers in research, medicine, and related fields.",
  "classHighlights": [
    "The major begins with foundational courses in biology, chemistry, physics, and mathematics, including Biology 1A, 1B, Chemistry 1A, 1B, Physics 7A, 7B, and Math 1A, 1B.",
    "Core neuroscience courses include Molecular and Cell Biology 102, Neurobiology 101, and Psychology 101, providing a comprehensive introduction to the field.",
    "Upper-division courses allow students to explore specific topics in depth, including neurophysiology, neuroanatomy, neuropharmacology, and behavioral neuroscience, through courses such as MCB 165, Neurobiology 104, and Psych 131.",
    "Electives and special topics courses enable students to engage with current research and emerging areas in neuroscience, such as stem cell biology, neuroplasticity, and neurological disorders."
  ],
  "learningOutcomes": [
    "Understand the structure and function of the nervous system at multiple levels, from molecules to behavior.",
    "Apply knowledge of neuroscience to understand neurological and psychiatric disorders.",
    "Analyze and interpret data from neuroscience research studies.",
    "Communicate complex scientific information effectively in written and oral forms.",
    "Demonstrate a strong foundation in the biological and psychological principles underlying neuroscience."
  ],
  "similarPrograms": [
    {
      "title": "Molecular and Cell Biology",
      "link": "https://mcb.berkeley.edu/undergrad/major"
    },
    {
      "title": "Psychology",
      "link": "https://psychology.berkeley.edu/undergraduate/psychology-major"
    },
    {
      "title": "Integrative Biology",
      "link": "https://ib.berkeley.edu/undergraduate/major"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/neuroscience",
    "https://neuroscience.berkeley.edu/undergraduate-major",
    "https://advising.berkeley.edu/departments/neuroscience"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The Neuroscience major requires a strong foundation in biology, chemistry, physics, and mathematics. Students must complete a set of core courses in neuroscience, as well as upper-division electives and special topics courses. Research opportunities and internships are available to provide hands-on experience."
}