{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Nutritional Sciences: Toxicology (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Nutritional Sciences: Toxicology major is designed for students interested in the study of toxicology and its relationship to nutrition. The program provides a strong foundation in the biological and physical sciences, as well as courses specific to toxicology, nutrition, and biochemistry. Students learn about the adverse effects of chemicals on living organisms and how nutritional factors influence toxicity and disease. The curriculum prepares students for careers in research, government, industry, or further study in fields like toxicology, nutrition, or environmental health.",
  "shortProgramDescription": "The Nutritional Sciences: Toxicology B.S. provides a foundation in toxicology, nutrition, and biochemistry, preparing students for careers in research, government, or industry.",
  "classHighlights": [
    "The major begins with foundational courses in biology, chemistry, and biochemistry, including Biology 1A/1AL, 1B, and Chemistry 1A/1AL, 1B, 3A/3AL.",
    "Students then progress to upper division courses such as Molecular and Cell Biology 110 and Nutritional Sciences 100, 101, and 103, which cover topics like molecular toxicology and nutritional biochemistry.",
    "Toxicology-specific coursework includes Nutritional Sciences 160 and Molecular Toxicology (not always available), which discuss mechanisms of toxicity and risk assessment.",
    "Other required courses include Public Health 142, which covers principles of epidemiology, and Statistics 2 or 20, to provide a statistical foundation.",
    "Electives allow students to explore related areas, such as environmental health, molecular biology, or nutritional aspects of disease."
  ],
  "learningOutcomes": [
    "Understand the principles of toxicology, including mechanisms of toxicity and risk assessment.",
    "Apply knowledge of biochemistry and molecular biology to understand toxicant effects.",
    "Analyze the role of nutrition in modulating toxicity and disease.",
    "Use statistical and epidemiological methods to evaluate toxicological data.",
    "Communicate scientific information effectively in written and oral forms.",
    "Evaluate the impact of environmental and dietary factors on health and disease."
  ],
  "similarPrograms": [
    {
      "title": "Nutritional Sciences",
      "link": "https://guide.berkeley.edu/undergraduate/degree-programs/nutritional-sciences"
    },
    {
      "title": "Public Health",
      "link": "https://publichealth.berkeley.edu/academics/undergraduate/public-health-bachelors/"
    },
    {
      "title": "Molecular and Cell Biology",
      "link": "https://mcb.berkeley.edu/undergrad/major"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/nutritional-sciences-toxicology",
    "https://nutrsci.berkeley.edu/programs/undergraduate/nutritional-sciences-major",
    "https://www.berkeley.edu/catalog/current/catalog-req.html"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits (including major, breadth, and degree requirements)",
  "additionalInformation": "Students must complete lower division prerequisites before advancing to upper division major courses. GPA requirements apply to major courses. Internship and research opportunities are available."
}