{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Philosophy (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Philosophy offers an undergraduate major leading to the Bachelor of Arts degree. The major is designed to provide students with a broad understanding of the main areas of philosophy, including metaphysics, epistemology, ethics, logic, and the history of philosophy. Students are encouraged to explore the department's diverse course offerings, which cover a wide range of philosophical topics and periods.",
  "shortProgramDescription": "The Philosophy B.A. program at UC Berkeley provides a comprehensive education in the fundamental areas of philosophy, preparing students for diverse careers or further study.",
  "classHighlights": [
    "The department offers a range of courses in the history of philosophy, including ancient, modern, and contemporary periods. These courses provide students with a deep understanding of the development of philosophical thought and its key figures.",
    "Courses in metaphysics and epistemology explore fundamental questions about reality, knowledge, and existence. Students examine topics such as the nature of time, the mind-body problem, and the sources of knowledge.",
    "The department offers a variety of courses in ethics, including normative ethics, metaethics, and applied ethics. Students engage with questions about moral value, obligation, and the nature of ethical judgment.",
    "Logic courses introduce students to the principles of reasoning and argumentation, covering topics such as propositional and predicate logic, modal logic, and non-classical logics.",
    "Courses in other areas of philosophy, such as philosophy of language, philosophy of mind, and philosophy of science, provide students with a broad understanding of the field and its many subfields."
  ],
  "learningOutcomes": [
    "Understand the main areas of philosophy, including metaphysics, epistemology, ethics, and logic.",
    "Analyze and evaluate philosophical arguments and texts.",
    "Develop critical thinking and writing skills.",
    "Cultivate an appreciation for the history of philosophy and its relevance to contemporary debates.",
    "Apply philosophical concepts and methods to a range of topics and issues."
  ],
  "similarPrograms": [
    {
      "title": "Classics",
      "link": "https://classics.berkeley.edu"
    },
    {
      "title": "Cognitive Science",
      "link": "https://cogsci.berkeley.edu"
    },
    {
      "title": "History",
      "link": "https://history.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/philosophy",
    "https://philosophy.berkeley.edu/undergraduate/major-requirements"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 total units (semester system)",
  "additionalInformation": "Students must complete the university's general education requirements and the department's major requirements. The major is flexible, allowing students to pursue their interests within the field."
}