{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Physics (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Physics B.S. program at UC Berkeley provides a comprehensive education in physics, preparing students for careers in research, academia, and industry, as well as for graduate study. The curriculum includes coursework in classical mechanics, electromagnetism, thermodynamics, quantum mechanics, and statistical mechanics, as well as laboratory and computational physics.",
  "shortProgramDescription": "The Physics B.S. program at UC Berkeley provides a rigorous foundation in physics, preparing students for diverse careers or further study.",
  "classHighlights": [
    "The introductory sequence includes Physics 7A-B-C (or 8A-B-C) and Mathematics 1A-B-C (or 53-54), providing a foundation in classical mechanics, electromagnetism, and mathematical methods.",
    "Upper division courses include Classical Mechanics (Physics 105), Electromagnetism (Physics 110A-B), Quantum Mechanics (Physics 137A-B), and Statistical Mechanics (Physics 112), as well as laboratory courses (Physics 105, 111, and 118) and computational physics (Physics 129).",
    "Students also complete coursework in mathematics, including Differential Equations (Mathematics 54 or 128A) and Linear Algebra (Mathematics 53 or 110).",
    "Electives allow students to explore topics such as condensed matter physics, particle physics, and astrophysics, as well as interdisciplinary areas like biophysics and computational physics."
  ],
  "learningOutcomes": [
    "Apply fundamental principles of physics to analyze and solve problems.",
    "Demonstrate understanding of classical mechanics, electromagnetism, thermodynamics, quantum mechanics, and statistical mechanics.",
    "Use mathematical and computational methods to model and analyze physical systems.",
    "Design and conduct experiments to test hypotheses and measure physical phenomena.",
    "Communicate complex scientific concepts effectively in written and oral form."
  ],
  "similarPrograms": [
    {
      "title": "Astronomy B.A.",
      "link": "https://astro.berkeley.edu/undergraduate/programs/ba/"
    },
    {
      "title": "Astrophysics B.S.",
      "link": "https://astro.berkeley.edu/undergraduate/programs/bs/"
    },
    {
      "title": "Engineering Physics B.S.",
      "link": "https://www.mse.berkeley.edu/undergraduate/engineering-physics-bs/"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/physics",
    "https://physics.berkeley.edu/undergraduate/program",
    "https://www.berkeley.edu/catalog/current/physics"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students must complete the university's general education requirements and maintain a minimum GPA in the major. Research opportunities are available through the department's research programs."
}