{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Planetary Science (B.S.)",
  "degreeAwarded": "Bachelor of Science",
  "fullProgramDescription": "The Planetary Science major is an interdisciplinary program that provides a rigorous foundation in the Earth sciences, astronomy, and physics, as well as in the mathematical and computational methods used to study planetary systems. Students in this major gain a broad understanding of the formation and evolution of planetary systems, the physics and chemistry of planetary bodies, and the techniques used to study them.",
  "shortProgramDescription": "The Planetary Science B.S. provides a comprehensive education in the Earth sciences, astronomy, and physics, preparing students for careers in research, industry, or education.",
  "classHighlights": [
    "Core Courses: Students take a series of core courses that provide a foundation in the Earth sciences, astronomy, and physics, including Introduction to Planetary Science, Earth and Planetary Materials, and Planetary Physics.",
    "Mathematics and Physics: Students complete a series of mathematics and physics courses, including Calculus, Differential Equations, and Mechanics, that provide a foundation for understanding planetary systems.",
    "Earth and Planetary Sciences: Students take courses in Earth and planetary sciences, including Earth and Planetary Materials, Geophysics, and Planetary Geology, that provide a comprehensive understanding of planetary bodies and processes.",
    "Astronomy and Astrophysics: Students take courses in astronomy and astrophysics, including Astrophysics, Stellar Structure and Evolution, and Planetary Systems, that provide a foundation for understanding the formation and evolution of planetary systems."
  ],
  "learningOutcomes": [
    "Understand the fundamental principles of planetary science, including the formation and evolution of planetary systems.",
    "Apply mathematical and computational methods to study planetary systems.",
    "Analyze data from a variety of sources, including spacecraft and laboratory experiments.",
    "Communicate complex scientific concepts effectively in written and oral form.",
    "Understand the interdisciplinary nature of planetary science and its connections to other fields."
  ],
  "similarPrograms": [
    {
      "title": "Astrophysics B.S.",
      "link": "https://physics.berkeley.edu/undergraduate/astrophysics-bs"
    },
    {
      "title": "Earth and Planetary Science B.S.",
      "link": "https://eps.berkeley.edu/undergraduate/eps-bs"
    },
    {
      "title": "Physics B.S.",
      "link": "https://physics.berkeley.edu/undergraduate/physics-bs"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/planetary-science",
    "https://eps.berkeley.edu/undergraduate/planetary-science"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students must complete a series of core courses, as well as a set of upper division courses in planetary science, astronomy, and physics. The major requires a strong foundation in mathematics and physics."
}