{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Political Science (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Political Science offers an undergraduate major leading to the Bachelor of Arts degree. The major is designed to acquaint students with the knowledge and skills needed to understand politics and to evaluate public issues and events. The department offers a range of introductory and advanced courses, from the study of institutions and political behavior to the analysis of global issues and international relations.",
  "shortProgramDescription": "The Political Science major at UC Berkeley provides a comprehensive understanding of politics, governments, and international relations, preparing students for a wide range of careers.",
  "classHighlights": [
    "The major requires a total of 11 courses. Students must complete a core curriculum that includes Introduction to Empirical Analysis and Methods (POL SCI 3), Introduction to Comparative Politics (POL SCI 11), and either American Politics (POL SCI 1) or Introduction to International Relations (POL SCI 15A).",
    "Students must also complete four upper-division courses in a chosen field: American Politics, Comparative Politics, International Relations, or Political Theory. These courses provide in-depth knowledge of specific areas of political science.",
    "In addition, students are required to take four elective courses, which can be chosen from a wide range of offerings across the department, allowing students to explore various topics and areas of interest.",
    "Some of the upper-division courses include topics such as Voting and Elections (POL SCI 102), Political Parties and Interest Groups (POL SCI 104), and International Security (POL SCI 136).",
    "The department also offers a range of courses that focus on specific regions, such as Latin America, Europe, and Asia, providing students with a global perspective on politics and governance."
  ],
  "learningOutcomes": [
    "Understand the major theories and concepts in the field of political science.",
    "Analyze and evaluate political institutions, behaviors, and outcomes.",
    "Apply empirical methods to the study of politics.",
    "Demonstrate an understanding of the global and comparative dimensions of politics.",
    "Communicate effectively about political issues and phenomena."
  ],
  "similarPrograms": [
    {
      "title": "Global Studies",
      "link": "https://globalstudies.berkeley.edu/undergraduate"
    },
    {
      "title": "Public Policy",
      "link": "https://goldenbear.gspp.berkeley.edu/undergraduate/public-policy"
    },
    {
      "title": "Legal Studies",
      "link": "https://ls.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/political-science",
    "https://polisci.berkeley.edu/undergraduate/major",
    "https://politicalscience.berkeley.edu/undergraduate/advising"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of 120 units required for graduation; major requires 11 courses (at least 44 units) with a minimum GPA of 2.0",
  "additionalInformation": "Students must fulfill the university's general education requirements and maintain a minimum GPA of 2.0 in their major courses. The department offers advising and support to help students navigate the major and plan their course schedule."
}