{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Psychology (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Psychology at UC Berkeley offers an undergraduate major in Psychology that provides a broad understanding of the principles and methods of psychology. The program includes coursework in research methods, statistics, and a range of content areas such as cognition, social psychology, and developmental psychology. Students are encouraged to explore the many subfields within psychology and to develop their research skills through participation in faculty-mentored research projects.",
  "shortProgramDescription": "The Psychology B.A. at UC Berkeley provides a comprehensive education in the principles and methods of psychology, preparing students for a wide range of careers or further study.",
  "classHighlights": [
    "The Psychology major requires a set of core courses that include Introduction to Psychology (Psychology 1), Statistical Methods in Psychology (Psychology 41 or 101), and Research Methods in Psychology (Psychology 102). These courses provide a foundation in the methods and statistics used in psychological research.",
    "Students also take a series of breadth courses that cover the major subfields of psychology, including Developmental Psychology (Psychology 112A or 112B), Social Psychology (Psychology 130), Cognitive Psychology (Psychology 140), and Biological Psychology (Psychology 123).",
    "In addition to these required courses, students choose from a range of electives that allow them to explore specialized topics in psychology, such as Personality (Psychology 134), Abnormal Psychology (Psychology 138), and Psychology of Emotion (Psychology 155).",
    "Upper-division courses provide more in-depth coverage of specific topics and often involve research projects or other hands-on activities. Examples include Advanced Developmental Psychology (Psychology 212A or 212B) and Advanced Social Psychology (Psychology 230)."
  ],
  "learningOutcomes": [
    "Apply knowledge of psychological theories and principles to real-world problems",
    "Understand the methods and statistics used in psychological research",
    "Analyze and interpret research findings",
    "Communicate complex ideas and research results effectively",
    "Demonstrate an understanding of the major subfields of psychology",
    "Participate in research projects or other hands-on activities that demonstrate research skills"
  ],
  "similarPrograms": [
    {
      "title": "Cognitive Science",
      "link": "https://cogsci.berkeley.edu"
    },
    {
      "title": "Neuroscience",
      "link": "https://neuroscience.berkeley.edu"
    },
    {
      "title": "Psychology Minor",
      "link": "https://psychology.berkeley.edu/undergraduate-program/psychology-minor"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/psychology",
    "https://psychology.berkeley.edu/undergraduate-program",
    "https://psychology.berkeley.edu/undergraduate-program/psychology-major"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "Total of 120 units required for graduation; major requires 32-34 upper-division units in Psychology",
  "additionalInformation": "Students must fulfill the university's general education requirements in addition to the major requirements. The major is designed to be flexible, allowing students to pursue their interests within the field of psychology."
}