{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Scandinavian (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Scandinavian offers an undergraduate major in Scandinavian Languages and Literatures leading to the Bachelor of Arts degree. The major is designed to give students a broad understanding of the language, literature, and culture of Scandinavia.",
  "shortProgramDescription": "The Scandinavian major provides students with a comprehensive understanding of Scandinavian languages, literatures, and cultures, preparing them for diverse careers or further study.",
  "classHighlights": [
    "Language courses: Students take a sequence of courses in a Scandinavian language (Danish, Norwegian, or Swedish) to develop proficiency. Courses cover grammar, vocabulary, and conversation skills.",
    "Literature and culture courses: The department offers a range of courses on Scandinavian literature, folklore, and cultural history, exploring works from the medieval period to the present day.",
    "Electives and special topics: Students can choose from a variety of electives that focus on specific aspects of Scandinavian culture, such as film, history, or contemporary issues."
  ],
  "learningOutcomes": [
    "Demonstrate proficiency in a Scandinavian language.",
    "Analyze and interpret Scandinavian literary and cultural texts.",
    "Understand the historical and cultural contexts of Scandinavia.",
    "Apply knowledge of Scandinavian languages and cultures to various fields, such as literature, history, or cultural studies."
  ],
  "similarPrograms": [
    {
      "title": "German",
      "link": "https://german.berkeley.edu"
    },
    {
      "title": "Dutch",
      "link": "https://dutch.berkeley.edu"
    },
    {
      "title": "Comparative Literature",
      "link": "https://comparative-literature.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/scandinavian",
    "https://scandinavian.berkeley.edu",
    "https://registrar.berkeley.edu/enrollment-requirements"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students are advised to consult with the department for specific course requirements and recommendations."
}