{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Social Welfare (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The undergraduate program in Social Welfare is designed to provide students with a comprehensive understanding of social welfare issues, policies, and practices. The major prepares students for careers in social services, policy analysis, and community organization, as well as for graduate study in social work and related fields. Students learn about the social, economic, and political contexts that shape social welfare policies and programs, and develop skills in critical thinking, analysis, and communication.",
  "shortProgramDescription": "The Social Welfare B.A. at UC Berkeley equips students with knowledge of social welfare issues, policies, and practices, preparing them for careers in social services or graduate study.",
  "classHighlights": [
    "The Social Welfare major requires a set of core courses that introduce students to the field, including an introductory course (SOCWEL 101AC), research methods (SOCWEL 105), and social policy (SOCWEL 130).",
    "Students also take courses in the social sciences, including sociology, psychology, and economics, to provide a foundation for understanding social welfare issues.",
    "In addition to core courses, students choose from a range of electives that allow them to explore specific topics, such as child and family policy, health and mental health, and social inequality.",
    "The major also includes a range of upper-division courses that provide advanced training in areas such as social work practice, policy analysis, and community organization.",
    "Students can choose from a variety of courses that focus on specific populations, such as children, youth, and families, or specific issues, such as poverty and inequality."
  ],
  "learningOutcomes": [
    "Understand the social, economic, and political contexts that shape social welfare policies and programs.",
    "Analyze social welfare issues and policies from a critical perspective.",
    "Develop skills in critical thinking, analysis, and communication.",
    "Apply knowledge of social welfare policies and programs to real-world problems.",
    "Understand the role of social work and social services in promoting social justice and human well-being."
  ],
  "similarPrograms": [
    {
      "title": "Sociology",
      "link": "https://sociology.berkeley.edu/undergraduate-program"
    },
    {
      "title": "Psychology",
      "link": "https://psychology.berkeley.edu/undergraduate-program"
    },
    {
      "title": "Public Policy",
      "link": "https://gspp.berkeley.edu/undergraduate-program"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/socialwelfare",
    "https://socialwelfare.berkeley.edu/undergraduate-program",
    "https://registrar.berkeley.edu/enrollment-requirements"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "Students must complete a set of core courses, as well as a range of electives, and maintain a minimum GPA. The major is designed to be completed in four years, and students are encouraged to pursue internships and research opportunities to gain practical experience."
}