{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Sociology (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Department of Sociology at UC Berkeley offers a comprehensive undergraduate program that introduces students to the study of social institutions, social relations, and social change. The program emphasizes the development of critical thinking, research skills, and sociological theory, preparing students for a wide range of careers or further study in sociology and related fields.",
  "shortProgramDescription": "The Sociology B.A. at UC Berkeley provides a rigorous foundation in sociological theory, research methods, and statistical analysis, enabling students to understand and analyze social phenomena.",
  "classHighlights": [
    "The introductory course, Sociology 1, provides a broad introduction to the field, covering key concepts, theories, and methods. Subsequent courses build upon this foundation, exploring topics such as social inequality, institutions, and social change.",
    "Courses in sociological theory (e.g., Sociology 130A-B) and research methods (e.g., Sociology 102, 103) provide students with a deeper understanding of the discipline's core concepts and the skills necessary to conduct sociological research.",
    "Electives in areas such as social inequality (e.g., Sociology 135, 138), institutions (e.g., Sociology 115, 119), and social change (e.g., Sociology 140, 145) allow students to explore specific topics in greater depth, applying sociological theories and methods to real-world issues.",
    "Upper-division courses, such as Sociology 131, 132, and 133, offer advanced training in sociological theory, while courses like Sociology 104 and 105 focus on statistical analysis and research design.",
    "The program also includes a range of specialized courses that apply sociological perspectives to specific issues, such as crime and deviance, education, and family sociology."
  ],
  "learningOutcomes": [
    "Understand the major sociological theories and concepts",
    "Apply sociological research methods and statistical analysis to social issues",
    "Analyze social phenomena, including social inequality and institutions",
    "Develop critical thinking and writing skills",
    "Understand the social and cultural contexts that shape individual and group behavior",
    "Evaluate the impact of social change on individuals and society"
  ],
  "similarPrograms": [
    {
      "title": "Demography",
      "link": "https://demography.berkeley.edu"
    },
    {
      "title": "Social Welfare",
      "link": "https://socialwelfare.berkeley.edu"
    },
    {
      "title": "Gender and Women's Studies",
      "link": "https://gsi.berkeley.edu"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/sociology",
    "https://sociology.berkeley.edu/undergraduate-program",
    "https://www.berkeley.edu/catalog/departments/sociology"
  ],
  "programDuration": "4 years (semester system)",
  "creditRequirements": "120 total units (semester credits)",
  "additionalInformation": "The Sociology B.A. requires completion of the major requirements, including core courses, electives, and a minimum of 30 upper-division units in sociology. Students are encouraged to consult with departmental advisors to plan their course of study."
}