{
  "collegeName": "University of California, Berkeley",
  "programType": "Major",
  "programName": "Sustainable Environmental Design (B.A.)",
  "degreeAwarded": "Bachelor of Arts",
  "fullProgramDescription": "The Sustainable Environmental Design major provides students with a comprehensive understanding of the interrelationships between the built environment, cultural landscapes, and ecological systems. The program focuses on the social, cultural, and environmental aspects of design and planning, preparing students for careers in fields such as architecture, landscape architecture, urban planning, and environmental consulting.",
  "shortProgramDescription": "The Sustainable Environmental Design B.A. program at UC Berkeley explores the intersections of design, culture, and the environment, preparing students for careers in built environment fields.",
  "classHighlights": [
    "The program's core courses introduce students to the principles of sustainable design, environmental systems, and the cultural context of design. Courses such as 'Introduction to Sustainable Environmental Design' and 'Environmental Design: Culture and Context' provide a foundation for further study.",
    "Students explore the technical and scientific aspects of environmental design through courses in environmental systems, sustainable materials, and energy-efficient design. Classes such as 'Environmental Systems' and 'Sustainable Materials and Technologies' provide hands-on experience with design and analysis tools.",
    "The major's upper-division courses allow students to specialize in areas such as sustainable architecture, landscape architecture, or urban planning. Electives include courses like 'Sustainable Architecture', 'Landscape Ecology', and 'Urban Planning for Sustainability', enabling students to tailor their education to their career goals."
  ],
  "learningOutcomes": [
    "Understand the social, cultural, and environmental dimensions of sustainable design.",
    "Apply principles of sustainability to the design and planning of built environments.",
    "Analyze the interrelationships between environmental systems, cultural landscapes, and design.",
    "Communicate design ideas and principles effectively through written, visual, and oral means.",
    "Evaluate the environmental and social impacts of design decisions."
  ],
  "similarPrograms": [
    {
      "title": "Landscape Architecture and Environmental Planning",
      "link": "https://ced.berkeley.edu/academics/led/"
    },
    {
      "title": "Architecture",
      "link": "https://ced.berkeley.edu/academics/arch/"
    },
    {
      "title": "Environmental Economics and Policy",
      "link": "https://are.berkeley.edu/undergraduate/major/eep"
    }
  ],
  "sources": [
    "https://guide.berkeley.edu/undergraduate/degree-programs/sustainable-environmental-design",
    "https://ced.berkeley.edu/academics/sed/"
  ],
  "programDuration": "8 semesters (4 academic years, semester system)",
  "creditRequirements": "120 semester credits",
  "additionalInformation": "The Sustainable Environmental Design major is administered by the Department of Architecture. Students are advised to consult with departmental advisors for specific course requirements and electives."
}